{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\gmoore\desktop\honors\analysis\master\code\../Output/master.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Mar 2019, 17:53:49
{txt}
{com}. 
. set more off
{txt}
{com}. 
. //Import data from parent file (NLSY 79)
. cd ../../NLSY79ParentData/Code
{res}C:\Users\gmoore\desktop\honors\analysis\NLSY79ParentData\Code
{txt}
{com}. do ParImport
{txt}
{com}. import delimited ../Input/parInc.csv, clear case(preserve)
{res}{text}(30 vars, 12686 obs)
{com}. 
. 
. //Names family income variables
. rename R7006500 parInc0
{res}{txt}
{com}. rename R7703700 parInc2
{res}{txt}
{com}. rename R8496100 parInc4
{res}{txt}
{com}. rename T0987800 parInc6
{res}{txt}
{com}. rename T2210000 parInc8
{res}{txt}
{com}. rename T3107800 parInc10
{res}{txt}
{com}. rename T4112300 parInc12 
{res}{txt}
{com}. rename T5022600 parInc14 
{res}{txt}
{com}. 
. rename R0000100 mid
{res}{txt}
{com}. 
. //Names family variable assets
. //Bases missing years on last recorded assets
. //Top 2% of values topcoded each year by average of obscured values
. rename R6940103 assets0
{res}{txt}
{com}. gen assets2 = assets0
{txt}
{com}. rename R8378703 assets4
{res}{txt}
{com}. gen assets6 = assets4
{txt}
{com}. rename T2142702 assets8
{res}{txt}
{com}. gen assets10 = assets8
{txt}
{com}. rename T4045802 assets12
{res}{txt}
{com}. gen assets14 = assets12
{txt}
{com}. 
. //Names family home value
. //Bases missing years on last recorded value
. //Top values topcoded
. rename R6944402 homeVal0
{res}{txt}
{com}. gen homeVal2 = homeVal0
{txt}
{com}. rename R8379601 homeVal4
{res}{txt}
{com}. gen homeVal6 = homeVal4
{txt}
{com}. rename T2143900 homeVal8
{res}{txt}
{com}. gen homeVal10 = homeVal8
{txt}
{com}. rename T4047100 homeVal12
{res}{txt}
{com}. gen homeVal14 = homeVal12
{txt}
{com}. 
. //Renames marriage
. rename R6917500 married0
{res}{txt}
{com}. rename R7616100 married2
{res}{txt}
{com}. rename R8324800 married4
{res}{txt}
{com}. rename T0919900 married6
{res}{txt}
{com}. rename T2084600 married8
{res}{txt}
{com}. rename T3055100 married10
{res}{txt}
{com}. rename T3986700 married12
{res}{txt}
{com}. rename T4924000 married14
{res}{txt}
{com}. 
. //Adds birth month
. replace R0410300 = . if R0410300 < 0
{txt}(491 real changes made, 491 to missing)

{com}. replace R0410100 = . if R0410100 < 0
{txt}(491 real changes made, 491 to missing)

{com}. gen parDob = ym(1900 + R0410300, R0410100)
{txt}(491 missing values generated)

{com}. format parDob %tm
{txt}
{com}. drop R0410300 R0410100
{txt}
{com}. 
. keep parInc* assets* homeVal* married* mid parDob
{txt}
{com}. 
. reshape long parInc assets homeVal married, i(mid) j(year)
{txt}(note: j = 0 2 4 6 8 10 12 14)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}   12686   {txt}->{res}  101488
{txt}Number of variables            {res}      34   {txt}->{res}       7
{txt}j variable (8 values)                     ->   {res}year
{txt}xij variables:
           {res}parInc0 parInc2 ... parInc14   {txt}->   {res}parInc
           assets0 assets2 ... assets14   {txt}->   {res}assets
        homeVal0 homeVal2 ... homeVal14   {txt}->   {res}homeVal
        married0 married2 ... married14   {txt}->   {res}married
{txt}{hline 77}

{com}. replace parInc = . if parInc < 0
{txt}(49007 real changes made, 49007 to missing)

{com}. replace assets = . if inlist(assets, -1, -2, -3, -4, -5)
{txt}(49616 real changes made, 49616 to missing)

{com}. replace homeVal = . if homeVal < 0
{txt}(40388 real changes made, 40388 to missing)

{com}. replace married = . if married < 0
{txt}(40772 real changes made, 40772 to missing)

{com}. 
. rename married momMarried
{res}{txt}
{com}. 
. sort mid year
{txt}
{com}. 
. save ../Output/ParData.dta, replace
{txt}file ../Output/ParData.dta saved

{com}. 
{txt}end of do-file

{com}. 
. //Import data from children file (NLSY 79 CYA)
. cd ../../NLSYChild79Data/Code
{res}C:\Users\gmoore\desktop\honors\analysis\NLSYChild79Data\Code
{txt}
{com}. do Import
{txt}
{com}. clear all
{txt}
{com}. 
. infile using ../Input/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026400 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED PT) 2000"
  Y1026500 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED FT) 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271600 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED PT) 2002"
  Y1271700 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED FT) 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505600 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED PT) 2004"
  Y1505700 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED FT) 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1755900 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED PT) 2006"
  Y1756000 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED FT) 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2036900 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED PT) 2008"
  Y2037000 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED FT) 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361400 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED PT) 2010"
  Y2361500 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED FT) 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
  Y2633101 "DATE OF CAPI INTERVIEW-MONTH 2012"
  Y2633102 "DATE OF CAPI INTERVIEW-YEAR 2012"
  Y2673200 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2012"
  Y2691100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2012"
  Y2691900 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED PT) 2012"
  Y2692000 "AMT FULL-TIME COLLEGE TUITION & FEES (ENROLLED FT) 2012"
  Y2692100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2012"
  Y2692200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2012"
  Y2967200 "REGION OF RESIDENCE 2012"
  Y2990501 "DATE OF CAPI INTERVIEW-MONTH 2014"
  Y2990502 "DATE OF CAPI INTERVIEW-YEAR 2014"
  Y3029600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2014"
  Y3046600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2014"
  Y3047500 "AMOUNT OF FULL-TIME COLLEGE TUITION & FEES 2014"
  Y3047600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2014"
  Y3047700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2014"
  Y3332700 "REGION OF RESIDENCE 2014"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. rename Y2673200 grade12
{res}{txt}
{com}. rename Y3029600 grade14
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. rename Y2691100 maj12
{res}{txt}
{com}. rename Y3046600 maj14
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. label define vlY3046600   0 "NONE, NO MAJOR DECLARED YET"  54 "ACCOUNTING"  1 "AGRICULTURE/NATURAL RESOURCES"  34 "ANIMAL SCIENCE"  2 "ANTHROPOLOGY"  60 "APPLIED SCIENCES"  65 "APPLIED TECHNOLOGY (ELECTRICAL, HVAC, INDUSTRIAL MAINTENANCE, ETC.)"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  64 "AUTOMOTIVE/DIESEL TECHNOLOGY"  35 "BIOLOGY"  36 "BIOCHEMISTRY/PHYSIOLOGY/BIOMEDICAL SCIENCE"  7 "BUSINESS"  37 "CHEMISTRY"  39 "COGNITIVE SCIENCE/NEUROSCIENCE"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE/INFORMATION TECHNOLOGY"  38 "COSOMETOLOGY/AESTHETICS"  73 "COUNSELING"  10 "CRIMINOLOGY/CRIMINAL JUSTICE"  40 "CULINARY ARTS"  41 "DENTAL ASSISTANT"  11 "ECONOMICS"  12 "EDUCATION"  74 "EMERGENCY MEDICAL TECHNOLOGY"  13 "ENGINEERING"  14 "ENGLISH"  67 "ENVIRONMENTAL SCIENCES"  42 "FINANCE"  15 "FINE AND APPLIED ARTS/ART HISTORY"  16 "FOREIGN LANGUAGES"  75 "GENERAL EDUCATION"  43 "GENERAL STUDIES/LIBERAL ARTS"  56 "GEOGRAPHY"  44 "GRAPHIC DESIGN"  71 "HEALTH SCIENCES"  45 "HEALTHCARE ADMINISTRATION"  17 "HISTORY"  59 "HOSPITALITY/HOTEL MANAGEMENT"  18 "HUMAN ECOLOGY/HOME ECONOMICS"  46 "HUMAN RESOURCES"  19 "INTERDISCIPLINARY STUDIES"  55 "JOURNALISM/MEDIA STUDIES"  68 "KINESIOLOGY/SPORTS SCIENCE"  47 "MARKETING/ADVERTISING"  20 "MATHEMATICS"  48 "MEDICAL ASSISTANT"  72 "MEDICAL TECHNOLOGY"  49 "MUSIC"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  52 "OTHER SCIENCE"  62 "PARALEGAL STUDIES"  50 "PHARMACY/PRE-PHARMACY"  23 "PHILOSOPHY"  70 "PHYSICAL/OCCUPATIONAL THERAPY"  51 "PHYSICS"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  63 "PUBLIC HEALTH/HUMAN SERVIES"  61 "PUBLIC POLICY/ADMINISTRATION"  58 "PUBLIC SAFETY"  57 "SECURITY/EMERGENCY MANAGEMENT"  32 "SOCIAL WORK"  31 "SOCIOLOGY"  53 "THEATRE/ MUSICAL THEATRE/DANCE"  33 "THEOLOGY/RELIGIOUS STUDIES"  69 "VETERINARY TECHNOLOGY"  66 "WELDING"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. //Recoded majors in 2014
. label values maj14 vlY3046600
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. rename Y2692100 recloan12
{res}{txt}
{com}. rename Y3047600 recloan14
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. rename Y2967200 region12
{res}{txt}
{com}. rename Y3332700 region14
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. rename Y2692200 loan12
{res}{txt}
{com}. rename Y3047700 loan14
{res}{txt}
{com}. 
. //Tuition
. rename Y1026400 fulltuition0
{res}{txt}
{com}. rename Y1026500 partialtuition0
{res}{txt}
{com}. rename Y1271600 fulltuition2
{res}{txt}
{com}. rename Y1271700 partialtuition2
{res}{txt}
{com}. rename Y1505600 fulltuition4
{res}{txt}
{com}. rename Y1505700 partialtuition4
{res}{txt}
{com}. rename Y1755900 fulltuition6
{res}{txt}
{com}. rename Y1756000 partialtuition6
{res}{txt}
{com}. rename Y2036900 fulltuition8
{res}{txt}
{com}. rename Y2037000 partialtuition8
{res}{txt}
{com}. rename Y2361400 fulltuition10
{res}{txt}
{com}. rename Y2361500 partialtuition10
{res}{txt}
{com}. rename Y2691900 fulltuition12
{res}{txt}
{com}. rename Y2692000 partialtuition12
{res}{txt}
{com}. 
. rename Y3047500 tuition14
{res}{txt}
{com}. 
. forvalues i = 0(2)12{c -(}
{txt}  2{com}.         assert fulltuition`i' < 0 | partialtuition`i' < 0
{txt}  3{com}.         gen tuition`i' = max(fulltuition`i', partialtuition`i')
{txt}  4{com}. {c )-}
{txt}
{com}. 
. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. //gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
. gen intDate0 = ym(Y1180502, Y1180501)
{txt}(8496 missing values generated)

{com}. //gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
. gen intDate2 = ym(Y1421102, Y1421101)
{txt}(7283 missing values generated)

{com}. //gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
. gen intDate4 = ym(Y1450202, Y1450201)
{txt}(6497 missing values generated)

{com}. //gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
. gen intDate6 = ym(Y1695602, Y1695601)
{txt}(5677 missing values generated)

{com}. //gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
. gen intDate8 = ym(Y1981602, Y1981601) 
{txt}(5216 missing values generated)

{com}. //gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
. gen intDate10 = ym(Y2300402, Y2300401)
{txt}(5419 missing values generated)

{com}. 
. gen intDate12 = ym(Y2633102, Y2633101)
{txt}(5713 missing values generated)

{com}. gen intDate14 = ym(Y2990502, Y2990501)
{txt}(5786 missing values generated)

{com}. format intDate* %tm
{txt}
{com}. drop Y1* Y2*
{txt}
{com}. 
. //Calculates how many siblings total
. duplicates tag mid, generate(sibs)

{p 0 4}{txt}Duplicates in terms of {res} mid{p_end}
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate tuition fulltuition partialtuition, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10 12 14)
(note: fulltuition14 not found)
(note: partialtuition14 not found)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   25360
{txt}Number of variables            {res}      76   {txt}->{res}      16
{txt}j variable (8 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj14   {txt}->   {res}maj
        recloan0 recloan2 ... recloan14   {txt}->   {res}recloan
                 loan0 loan2 ... loan14   {txt}->   {res}loan
           region0 region2 ... region14   {txt}->   {res}region
              grade0 grade2 ... grade14   {txt}->   {res}grade
        intDate0 intDate2 ... intDate14   {txt}->   {res}intDate
        tuition0 tuition2 ... tuition14   {txt}->   {res}tuition
fulltuition0 fulltuition2 ... fulltuition14{txt}->  {res}fulltuition
partialtuition0 partialtuition2 ... partialtuition14{txt}->{res}partialtuition
{txt}{hline 77}

{com}. 
. //Dummy for student in college; used to find concurrent siblings
. gen inCollege = grade >= 13
{txt}
{com}. duplicates tag year mid inCollege if inCollege > 0, generate(sibsInCollege)

{p 0 4}{txt}Duplicates in terms of {res} year mid inCollege{p_end}
{txt}
{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(16163 real changes made, 16163 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3607 real changes made)

{com}. replace loan = . if loan < 0
{txt}(19063 real changes made, 19063 to missing)

{com}. replace region = . if region < 0
{txt}(6388 real changes made, 6388 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(5257 real changes made, 5257 to missing)

{com}. replace grade = . if grade < 0
{txt}(14783 real changes made, 14783 to missing)

{com}. replace partialtuition = . if partialtuition < 0
{txt}(17757 real changes made, 17757 to missing)

{com}. replace fulltuition = . if fulltuition < 0
{txt}(21278 real changes made, 21278 to missing)

{com}. replace tuition = . if tuition < 0
{txt}(19683 real changes made, 19683 to missing)

{com}. 
. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. replace polImpact = 1000 if  ((grade == 14 & inrange(intDate, ym(2007, 8), ym(2008, 8))) | ///
>          (grade == 15 & inrange(intDate, ym(2008, 8), ym(2009, 8))) | ///
>          (grade == 16 & inrange(intDate, ym(2009, 8), ym(2010, 8))) | ///
>          (grade == 17 & inrange(intDate, ym(2010, 8), ym(2011, 8))))
{txt}(538 real changes made)

{com}. 
. //Students who enter school after the policy change get full impact
. replace polImpact = 1875 if  ((grade == 13 & intDate > ym(2007, 8)) | ///
>          (grade == 14 & intDate > ym(2008, 8)) | ///
>          (grade == 15 & intDate > ym(2009, 8)) | ///
>          (grade == 16 & intDate > ym(2010, 8)) | ///
>          (grade == 17 & intDate > ym(2011, 8)))
{txt}(2541 real changes made)

{com}.         
. 
. //Places majors into bins
. gen majType = .
{txt}(25360 missing values generated)

{com}. //Humanities: Area Studies (5) English (14) Art (15) Language (16) History (17)
. //              Interdisciplinary Studies (19) Philosophy (23) Theology (33)
. replace majType = 0 if inlist(maj, 5, 14, 15, 16, 17, 19, 23, 33)
{txt}(525 real changes made)

{com}. //STEM: Agriculture (1) Architecture (4) Biology (6) CS(9) Engineering (13) 
. //              Math (20) Physics (24)
. replace majType = 1 if inlist(maj, 1, 4, 6, 9, 13, 20, 24)
{txt}(1413 real changes made)

{com}. //Social Science: Anthropology(2) Archaeology (3) Economics (11) Home Ec (18)
. //              Political Science (25) Psychology (30) Sociology (31)
. replace majType = 2 if inlist(maj, 2, 3, 11, 18, 25, 30, 31)
{txt}(703 real changes made)

{com}. //Professional: Communications (8) Criminology (10) Education (12)
. //              Nursing (21) Other Health (22) Pre-Dental/Law/Med/Vet (26-29)
. //              Social Work (32)
. replace majType = 3 if inlist(maj, 7, 8, 10, 12, 21, 22, 26, 27, 28, 29, 32)
{txt}(4461 real changes made)

{com}. //Business: Business (7)
. replace majType = 4 if maj == 7
{txt}(1412 real changes made)

{com}. 
. 
. //Tests if siblings are in college
. 
. 
. 
. 
. //assert missing(majType) == missing(maj) | maj == 0 | maj == 99
. 
. label values majType majTypeLab
{txt}
{com}. 
. gen fallSemester = halfyear(dofm(intDate)) - 1
{txt}(6257 missing values generated)

{com}. 
. keep if grade == 16
{txt}(24410 observations deleted)

{com}. 
. save ../Output/ChildData.dta, replace
{txt}file ../Output/ChildData.dta saved

{com}. 
. 
. 
{txt}end of do-file

{com}. 
. //Need many:one due to siblings
. //Assertion guarantees all children have parental incomes
. //Drop those women without children in college
. merge m:1 mid year using ../../NLSY79ParentData/Output/ParData.dta, assert(match using) nogen keep(match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             950{txt}  
{col 5}{hline 41}

{com}. 
. //Saves merged file as input for need calculations, then outputs file
. //with completed need calcs
. cd ../../NeedCalc/Code
{res}C:\Users\gmoore\desktop\honors\analysis\NeedCalc\Code
{txt}
{com}. save ../Input/Merged.dta, replace
{txt}file ../Input/Merged.dta saved

{com}. do NeedCalc
{txt}
{com}. use ../Input/Merged.dta, clear
{txt}
{com}. //Available Income Calc
. 
. //Preliminary stats:
. 
. //Household is composed of:
. //Child and mother, plus siblings, plus spouse
. gen hhSize = 2 + sibs + momMarried
{txt}(70 missing values generated)

{com}. 
. //Mother's age
. gen mAge = floor((ym(2008, 1) - parDob) / 12)
{txt}(15 missing values generated)

{com}. 
. //Box 1: Just parInc
. 
. //Box 2: Income Allowances
. tempvar incAllowance
{txt}
{com}. gen `incAllowance' = 0
{txt}
{com}. 
. //Social security allowance
. replace `incAllowance' = `incAllowance' + .0765 * parInc if parInc < 94200
{txt}(476 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 7206.3 + 0.145 * (parInc - 94200) if parInc >= 94200
{txt}(465 real changes made, 195 to missing)

{com}. 
. 
. 
. //Income protection (line 12), aka table A3
. //Assumes parents are not also in college
. 
. //Household size 2
. replace `incAllowance' = `incAllowance' + 15000 if hhSize == 2
{txt}(32 real changes made)

{com}. 
. //Household size 3
. replace `incAllowance' = `incAllowance' + 18680 if hhSize == 3 & sibsInCollege == 0
{txt}(91 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 16130 if hhSize == 3 & sibsInCollege == 1
{txt}(20 real changes made)

{com}. 
. //Household size 4
. replace `incAllowance' = `incAllowance' + 23070 if hhSize == 4 & sibsInCollege == 0
{txt}(208 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 20510 if hhSize == 4 & sibsInCollege == 1
{txt}(84 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 17950 if hhSize == 4 & sibsInCollege == 2
{txt}(2 real changes made)

{com}. 
. //Household size 5
. replace `incAllowance' = `incAllowance' + 27220 if hhSize == 5 & sibsInCollege == 0
{txt}(119 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 24660 if hhSize == 5 & sibsInCollege == 1
{txt}(62 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 22100 if hhSize == 5 & sibsInCollege == 2
{txt}(21 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 19540 if hhSize == 5 & sibsInCollege == 3
{txt}(0 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 16980 if hhSize == 5 & sibsInCollege == 4
{txt}(0 real changes made)

{com}. 
. //Household size 6
. replace `incAllowance' = `incAllowance' + 31840 if hhSize >= 6 & sibsInCollege == 0
{txt}(55 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 29280 if hhSize >= 6 & sibsInCollege == 1
{txt}(45 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 26720 if hhSize >= 6 & sibsInCollege == 2
{txt}(13 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 24160 if hhSize >= 6 & sibsInCollege == 3
{txt}(3 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 21600 if hhSize >= 6 & sibsInCollege == 4
{txt}(0 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 21600 - 2550 if hhSize >= 6 & sibsInCollege == 5
{txt}(0 real changes made)

{com}. replace `incAllowance' = `incAllowance' + 21600 - (sibsInCollege - 6) * 2550 if hhSize >= 6 & sibsInCollege >= 6
{txt}(0 real changes made)

{com}. replace `incAllowance' = `incAllowance' + (hhSize - 6) * 3590 if hhSize >= 6
{txt}(43 real changes made)

{com}. 
. 
. 
. //Single-parent deducation (line 13)
. replace `incAllowance' = `incAllowance' + min(3200, .35 * parInc) if !momMarried & !missing(momMarried)
{txt}(241 real changes made)

{com}. 
. 
. //Box 3
. tempvar availInc
{txt}
{com}. gen `availInc' = parInc - `incAllowance'
{txt}(195 missing values generated)

{com}. 
. 
. //Box 4
. tempvar availAssets
{txt}
{com}. gen `availAssets' = assets - homeVal
{txt}(267 missing values generated)

{com}. //Table A5
. replace `availAssets' = . if missing(momMarried)
{txt}(9 real changes made, 9 to missing)

{com}. 
. //Mother married
. replace `availAssets' = `availAssets' - 0 if mAge <= 25 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 2500 if mAge == 26 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 5100 if mAge == 27 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 7600 if mAge == 28 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 10200 if mAge == 29 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 12700 if mAge == 30 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 15200 if mAge == 31 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 17800 if mAge == 32 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 20300 if mAge == 33 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 22900 if mAge == 34 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 25400 if mAge == 35 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 27900 if mAge == 36 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 30500 if mAge == 37 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 33000 if mAge == 38 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 35600 if mAge == 39 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 38100 if mAge == 40 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 39100 if mAge == 41 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 40100 if mAge == 42 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 41100 if mAge == 43 & momMarried & !missing(momMarried)
{txt}(14 real changes made)

{com}. replace `availAssets' = `availAssets' - 42100 if mAge == 44 & momMarried & !missing(momMarried)
{txt}(31 real changes made)

{com}. replace `availAssets' = `availAssets' - 43100 if mAge == 45 & momMarried & !missing(momMarried)
{txt}(42 real changes made)

{com}. replace `availAssets' = `availAssets' - 44200 if mAge == 46 & momMarried & !missing(momMarried)
{txt}(63 real changes made)

{com}. replace `availAssets' = `availAssets' - 45300 if mAge == 47 & momMarried & !missing(momMarried)
{txt}(60 real changes made)

{com}. replace `availAssets' = `availAssets' - 46400 if mAge == 48 & momMarried & !missing(momMarried)
{txt}(70 real changes made)

{com}. replace `availAssets' = `availAssets' - 47600 if mAge == 49 & momMarried & !missing(momMarried)
{txt}(72 real changes made)

{com}. replace `availAssets' = `availAssets' - 48700 if mAge == 50 & momMarried & !missing(momMarried)
{txt}(77 real changes made)

{com}. replace `availAssets' = `availAssets' - 50200 if mAge == 51 & momMarried & !missing(momMarried)
{txt}(9 real changes made)

{com}. replace `availAssets' = `availAssets' - 51500 if mAge == 52 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 53000 if mAge == 53 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 54300 if mAge == 54 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 55900 if mAge == 55 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 57300 if mAge == 56 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 59000 if mAge == 57 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 60700 if mAge == 58 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 62500 if mAge == 59 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 64300 if mAge == 60 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 66200 if mAge == 61 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 68100 if mAge == 62 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 70400 if mAge == 63 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 72400 if mAge == 64 & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 74800 if mAge >= 65 & !missing(mAge) & momMarried & !missing(momMarried)
{txt}(0 real changes made)

{com}. replace `availAssets' = . if missing(mAge)
{txt}(6 real changes made, 6 to missing)

{com}.         
. //Mother unmarried
. replace `availAssets' = `availAssets' - 0 if mAge <= 25 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 1000 if mAge == 26 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 2100 if mAge == 27 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 3100 if mAge == 28 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 4200 if mAge == 29 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 5200 if mAge == 30 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 6300 if mAge == 31 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 7300 if mAge == 32 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 8400 if mAge == 33 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 9400 if mAge == 34 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 10500 if mAge == 35 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 11500 if mAge == 36 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 12600 if mAge == 37 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 13600 if mAge == 38 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 14700 if mAge == 39 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 15700 if mAge == 40 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 16100 if mAge == 41 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 16400 if mAge == 42 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 16800 if mAge == 43 & !momMarried
{txt}(15 real changes made)

{com}. replace `availAssets' = `availAssets' - 17200 if mAge == 44 & !momMarried
{txt}(34 real changes made)

{com}. replace `availAssets' = `availAssets' - 17500 if mAge == 45 & !momMarried
{txt}(28 real changes made)

{com}. replace `availAssets' = `availAssets' - 17900 if mAge == 46 & !momMarried
{txt}(21 real changes made)

{com}. replace `availAssets' = `availAssets' - 18300 if mAge == 47 & !momMarried
{txt}(37 real changes made)

{com}. replace `availAssets' = `availAssets' - 18800 if mAge == 48 & !momMarried
{txt}(31 real changes made)

{com}. replace `availAssets' = `availAssets' - 19200 if mAge == 49 & !momMarried
{txt}(26 real changes made)

{com}. replace `availAssets' = `availAssets' - 19700 if mAge == 50 & !momMarried
{txt}(35 real changes made)

{com}. replace `availAssets' = `availAssets' - 20100 if mAge == 51 & !momMarried
{txt}(3 real changes made)

{com}. replace `availAssets' = `availAssets' - 20500 if mAge == 52 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 21000 if mAge == 53 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 21600 if mAge == 54 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 22100 if mAge == 55 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 22700 if mAge == 56 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 23200 if mAge == 57 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 23900 if mAge == 58 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 24400 if mAge == 59 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 25100 if mAge == 60 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 25700 if mAge == 61 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 26400 if mAge == 62 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 27200 if mAge == 63 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 27900 if mAge == 64 & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = `availAssets' - 28700 if mAge >= 65 & !missing(mAge) & !momMarried
{txt}(0 real changes made)

{com}. replace `availAssets' = . if missing(mAge)
{txt}(0 real changes made)

{com}. 
. //If negative, enter zero
. replace `availAssets' = max(0, 0.12 * `availAssets')
{txt}(950 real changes made)

{com}. 
. 
. //Box 5
. tempvar resources
{txt}
{com}. gen `resources' = `availInc' + `availAssets'
{txt}(195 missing values generated)

{com}. 
. tempvar grossCont
{txt}
{com}. gen `grossCont' = .
{txt}(950 missing values generated)

{com}. replace `grossCont' = -750 if `resources' < -3409
{txt}(98 real changes made)

{com}. replace `grossCont' = .22 * `availInc' if inrange(`resources', -3409, 13400)
{txt}(101 real changes made)

{com}. replace `grossCont' = 2948 + .25 * (`resources' - 13400) if inrange(`resources', 13401, 16800)
{txt}(23 real changes made)

{com}. replace `grossCont' = 3798 + .29 * (`resources' - 16800) if inrange(`resources', 16801, 20200)
{txt}(20 real changes made)

{com}. replace `grossCont' = 4784 + .34 * (`resources' - 20200) if inrange(`resources', 20201, 23700)
{txt}(21 real changes made)

{com}. replace `grossCont' = 5974 + .40 * (`resources' - 23700) if inrange(`resources', 23701, 27100)
{txt}(24 real changes made)

{com}. replace `grossCont' = 7334 + .47 * (`resources' - 27100) if `resources' >= 27101
{txt}(468 real changes made)

{com}. 
. replace `grossCont' = max(`grossCont', 0)
{txt}(313 real changes made)

{com}. 
. gen efc = `grossCont' / sibsInCol
{txt}(645 missing values generated)

{com}. 
. //If stopped at line 3
. replace efc = 0 if parInc < 20000
{txt}(67 real changes made)

{com}. 
. //Need
. gen need = tuition - efc
{txt}(612 missing values generated)

{com}. //replace need = 0 if need < 0
. 
. //Cap dummies
. gen atCap = 0 if !missing(need)
{txt}(612 missing values generated)

{com}. replace atCap = 1 if need >= 4500 & !missing(need)
{txt}(122 real changes made)

{com}. 
. //Drops temp variables (somehow not automatic?)
. drop __*
{txt}
{com}. 
. save ../Output/Need.dta, replace
{txt}file ../Output/Need.dta saved

{com}. 
{txt}end of do-file

{com}. 
. cd ../../Regressions/Code
{res}C:\Users\gmoore\desktop\honors\analysis\Regressions\Code
{txt}
{com}. do regs
{txt}
{com}. use ../../NeedCalc/Output/Need.dta, clear
{txt}
{com}. 
. //Linear time trend
. tobit loan atCap##c.polImpact need intDate i.fall i.race i.sex i.region if inrange(year, 8, 12), ll
{res}
{txt}Tobit regression{col 51}Number of obs{col 67}= {res}       191
{txt}{col 51}LR chi2({res}12{txt}){col 67}= {res}     36.64
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0003
{txt}Log likelihood = {res}  -1135.68{txt}{col 51}Pseudo R2{col 67}= {res}    0.0159

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 17}1.atCap {c |}{col 26}{res}{space 2} 84.08985{col 38}{space 2} 2755.757{col 49}{space 1}    0.03{col 58}{space 3}0.976{col 66}{space 4} -5353.86{col 79}{space 3}  5522.04
{txt}{space 15}polImpact {c |}{col 26}{res}{space 2}-1.569015{col 38}{space 2} 4.417123{col 49}{space 1}   -0.36{col 58}{space 3}0.723{col 66}{space 4}-10.28535{col 79}{space 3} 7.147317
{txt}{space 24} {c |}
{space 7}atCap#c.polImpact {c |}
{space 22}1  {c |}{col 26}{res}{space 2}  .623287{col 38}{space 2} 2.105011{col 49}{space 1}    0.30{col 58}{space 3}0.767{col 66}{space 4}-3.530543{col 79}{space 3} 4.777117
{txt}{space 24} {c |}
{space 20}need {c |}{col 26}{res}{space 2} .1325079{col 38}{space 2}  .041844{col 49}{space 1}    3.17{col 58}{space 3}0.002{col 66}{space 4}  .049937{col 79}{space 3} .2150788
{txt}{space 17}intDate {c |}{col 26}{res}{space 2} 92.27226{col 38}{space 2} 156.4238{col 49}{space 1}    0.59{col 58}{space 3}0.556{col 66}{space 4}-216.3997{col 79}{space 3} 400.9442
{txt}{space 10}1.fallSemester {c |}{col 26}{res}{space 2}-281.3757{col 38}{space 2} 1769.435{col 49}{space 1}   -0.16{col 58}{space 3}0.874{col 66}{space 4}-3773.011{col 79}{space 3}  3210.26
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 2141.139{col 38}{space 2} 2341.406{col 49}{space 1}    0.91{col 58}{space 3}0.362{col 66}{space 4}-2479.169{col 79}{space 3} 6761.447
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 2534.857{col 38}{space 2} 2174.041{col 49}{space 1}    1.17{col 58}{space 3}0.245{col 66}{space 4}-1755.189{col 79}{space 3} 6824.903
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} 1317.766{col 38}{space 2} 1453.613{col 49}{space 1}    0.91{col 58}{space 3}0.366{col 66}{space 4}-1550.657{col 79}{space 3} 4186.189
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-2928.343{col 38}{space 2} 2365.215{col 49}{space 1}   -1.24{col 58}{space 3}0.217{col 66}{space 4}-7595.634{col 79}{space 3} 1738.948
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-1604.272{col 38}{space 2} 2372.425{col 49}{space 1}   -0.68{col 58}{space 3}0.500{col 66}{space 4}-6285.791{col 79}{space 3} 3077.248
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-6408.225{col 38}{space 2} 2851.752{col 49}{space 1}   -2.25{col 58}{space 3}0.026{col 66}{space 4} -12035.6{col 79}{space 3}-780.8479
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-52761.47{col 38}{space 2} 90482.39{col 49}{space 1}   -0.58{col 58}{space 3}0.561{col 66}{space 4}-231310.9{col 79}{space 3} 125787.9
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                  /sigma {c |}{col 26}{res}{space 2} 8778.504{col 38}{space 2} 663.7636{col 66}{space 4} 7468.696{col 79}{space 3} 10088.31
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Obs. summary:{col 18}{res}       88{col 28}{txt} left-censored observations at loan<={res}0
{txt}{col 18}{res}      103{col 28}{txt}    uncensored observations
{col 18}{res}        0{col 28}{txt}right-censored observations

{com}. 
. //Dummied time trend
. tobit loan atCap##c.polImpact need i.year i.fall i.race i.sex i.region if inrange(year, 8, 12), ll
{res}
{txt}Tobit regression{col 51}Number of obs{col 67}= {res}       191
{txt}{col 51}LR chi2({res}13{txt}){col 67}= {res}     37.93
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0003
{txt}Log likelihood = {res}-1135.0348{txt}{col 51}Pseudo R2{col 67}= {res}    0.0164

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 17}1.atCap {c |}{col 26}{res}{space 2}-191.4664{col 38}{space 2} 2761.209{col 49}{space 1}   -0.07{col 58}{space 3}0.945{col 66}{space 4}-5640.383{col 79}{space 3}  5257.45
{txt}{space 15}polImpact {c |}{col 26}{res}{space 2}-8.073525{col 38}{space 2} 7.605139{col 49}{space 1}   -1.06{col 58}{space 3}0.290{col 66}{space 4}-23.08136{col 79}{space 3}  6.93431
{txt}{space 24} {c |}
{space 7}atCap#c.polImpact {c |}
{space 22}1  {c |}{col 26}{res}{space 2} .9718483{col 38}{space 2} 2.137983{col 49}{space 1}    0.45{col 58}{space 3}0.650{col 66}{space 4}-3.247206{col 79}{space 3} 5.190902
{txt}{space 24} {c |}
{space 20}need {c |}{col 26}{res}{space 2} .1325715{col 38}{space 2} .0419652{col 49}{space 1}    3.16{col 58}{space 3}0.002{col 66}{space 4}  .049758{col 79}{space 3} .2153849
{txt}{space 24} {c |}
{space 20}year {c |}
{space 21}10  {c |}{col 26}{res}{space 2} 9641.966{col 38}{space 2} 7803.561{col 49}{space 1}    1.24{col 58}{space 3}0.218{col 66}{space 4}-5757.433{col 79}{space 3} 25041.36
{txt}{space 21}12  {c |}{col 26}{res}{space 2} 16413.93{col 38}{space 2} 13930.66{col 49}{space 1}    1.18{col 58}{space 3}0.240{col 66}{space 4}-11076.57{col 79}{space 3} 43904.43
{txt}{space 24} {c |}
{space 10}1.fallSemester {c |}{col 26}{res}{space 2} 506.4888{col 38}{space 2} 1759.154{col 49}{space 1}    0.29{col 58}{space 3}0.774{col 66}{space 4}-2964.993{col 79}{space 3} 3977.971
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 2424.065{col 38}{space 2} 2348.693{col 49}{space 1}    1.03{col 58}{space 3}0.303{col 66}{space 4}  -2210.8{col 79}{space 3}  7058.93
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 2665.885{col 38}{space 2} 2180.574{col 49}{space 1}    1.22{col 58}{space 3}0.223{col 66}{space 4}-1637.218{col 79}{space 3} 6968.989
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} 1455.963{col 38}{space 2} 1462.432{col 49}{space 1}    1.00{col 58}{space 3}0.321{col 66}{space 4}-1429.973{col 79}{space 3} 4341.898
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-2766.982{col 38}{space 2} 2368.877{col 49}{space 1}   -1.17{col 58}{space 3}0.244{col 66}{space 4}-7441.678{col 79}{space 3} 1907.714
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-1539.543{col 38}{space 2} 2368.956{col 49}{space 1}   -0.65{col 58}{space 3}0.517{col 66}{space 4}-6214.395{col 79}{space 3} 3135.309
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-6154.683{col 38}{space 2} 2858.924{col 49}{space 1}   -2.15{col 58}{space 3}0.033{col 66}{space 4}-11796.43{col 79}{space 3}-512.9368
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-265.0551{col 38}{space 2} 3654.449{col 49}{space 1}   -0.07{col 58}{space 3}0.942{col 66}{space 4}-7476.675{col 79}{space 3} 6946.565
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                  /sigma {c |}{col 26}{res}{space 2} 8761.388{col 38}{space 2} 662.2349{col 66}{space 4} 7454.546{col 79}{space 3} 10068.23
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Obs. summary:{col 18}{res}       88{col 28}{txt} left-censored observations at loan<={res}0
{txt}{col 18}{res}      103{col 28}{txt}    uncensored observations
{col 18}{res}        0{col 28}{txt}right-censored observations

{com}. 
{txt}end of do-file

{com}. 
. /*
> cd ../../Tables/Code
> do tables
> */
. 
. cd ../../Charts/Code
{res}C:\Users\gmoore\desktop\honors\analysis\Charts\Code
{txt}
{com}. do charts
{txt}
{com}. 
{txt}end of do-file

{com}. 
. cd ../../Master/Code
{res}C:\Users\gmoore\desktop\honors\analysis\Master\Code
{txt}
{com}. save ../Output/Master.dta, replace
{txt}file ../Output/Master.dta saved

{com}. 
{txt}end of do-file

{com}. ls
{txt}  <dir>   3/06/19 17:52  {res}.                 
{txt}  <dir>   3/06/19 17:52  {res}..                
{txt}   0.8k   3/06/19 17:52  {res}Master.do         

{com}. desc majtype
{err}variable majtype not found
{txt}{search r(111):r(111);}

{com}. desc majType

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:majType        }{txt}{bind: float   }{bind:{txt}%14.0g    }{space 1}{txt}majTypeLab{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}

{com}. sum majType

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 5}majType {c |}{res}       772    2.360104    1.243343          0          4

{com}. graph pie majType
{res}
{com}. graph pie, by(majType)
{err}sum of pie wedges is not positive
{res}{err}sum of pie wedges is not positive
{res}{err}sum of pie wedges is not positive
{res}{err}sum of pie wedges is not positive
{res}{err}sum of pie wedges is not positive
{res}
{com}. help graph pie

. graph pie, over(majType)
{res}
{com}. hist parInc
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}
{com}. hist parInc, freq
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}
{com}. hist debt
{err}variable debt not found
{txt}{search r(111):r(111);}

{com}. hist loan
{txt}(bin={res}29{txt}, start={res}0{txt}, width={res}2758.6207{txt})
{res}
{com}. hist loan if loan
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}
{com}. hist loan if loan, freq
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}
{com}. hist need, freq
{txt}(bin={res}18{txt}, start={res}-190791.67{txt}, width={res}13543.982{txt})
{res}
{com}. count if need > 0
{res}  805

{com}. count if need > 0 & !missing(need)
{res}  193

{com}. binScatter need year
{err}unrecognized command:  binScatter not defined by binScatter.ado
{txt}{search r(199):r(199);}

{com}. help binscatter

. binscatter need year
{res}
{com}. binscatter parInc need
{res}
{com}. binscatter parInc year
{res}
{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. graph pie, over(majType)
{res}{txt}
{com}. graph save ../Output/majDist.eps, replace
{txt}(note: file ../Output/majDist.eps not found)
{res}{txt}(file ../Output/majDist.eps saved)

{com}. 
{txt}end of do-file

{com}. ls
{txt}  <dir>   3/06/19 17:52  {res}.                 
{txt}  <dir>   3/06/19 17:52  {res}..                
{txt}   0.8k   3/06/19 17:52  {res}Master.do         

{com}. pwd
{res}C:\Users\gmoore\desktop\honors\analysis\Master\Code

{com}. cd ../../charts/code
{res}C:\Users\gmoore\desktop\honors\analysis\charts\code

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. graph pie, over(majType)
{res}{txt}
{com}. graph save ../Output/majDist.eps, replace
{txt}(note: file ../Output/majDist.eps not found)
{res}{txt}(file ../Output/majDist.eps saved)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType)
{res}{txt}
{com}. graph save ../Output/majDist.eps, replace
{res}{txt}(file ../Output/majDist.eps saved)

{com}. 
. //Student income distribution
. hist parInc, freq
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph save ../Output/parIncDist.eps, replace
{txt}(note: file ../Output/parIncDist.eps not found)
{res}{txt}(file ../Output/parIncDist.eps saved)

{com}. 
. //Debt distribution
. hist loan if loan, freq
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph save ../Output/loanDist.eps, replace
{txt}(note: file ../Output/loanDist.eps not found)
{res}{txt}(file ../Output/loanDist.eps saved)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. graph pie, over(majType)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType)
{res}{txt}
{com}. graph save ../Output/majDist.pdf, replace
{txt}(note: file ../Output/majDist.pdf not found)
{res}{txt}(file ../Output/majDist.pdf saved)

{com}. 
. //Student income distribution
. hist parInc, freq
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph save ../Output/parIncDist.pdf, replace
{txt}(note: file ../Output/parIncDist.pdf not found)
{res}{txt}(file ../Output/parIncDist.pdf saved)

{com}. 
. //Debt distribution
. hist loan if loan, freq
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph save ../Output/loanDist.pdf, replace
{txt}(note: file ../Output/loanDist.pdf not found)
{res}{txt}(file ../Output/loanDist.pdf saved)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType)
{res}{txt}
{com}. graph save ../Output/majDist.pdf, as(pdf) replace
{err}option {bf:as()} not allowed
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. help graph export

. ls
{txt}  <dir>   3/06/19 21:15  {res}.                 
{txt}  <dir>   3/06/19 21:15  {res}..                
{txt}   0.3k   3/06/19 21:15  {res}charts.do         

{com}. do charts
{txt}
{com}. //General distribution of majors
. graph pie, over(majType)
{res}{txt}
{com}. graph save ../Output/majDist.ps, replace
{txt}(note: file ../Output/majDist.ps not found)
{res}{txt}(file ../Output/majDist.ps saved)

{com}. 
. //Student income distribution
. hist parInc, freq
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph save ../Output/parIncDist.ps, replace
{txt}(note: file ../Output/parIncDist.ps not found)
{res}{txt}(file ../Output/parIncDist.ps saved)

{com}. 
. //Debt distribution
. hist loan if loan, freq
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph save ../Output/loanDist.ps, replace
{txt}(note: file ../Output/loanDist.ps not found)
{res}{txt}(file ../Output/loanDist.ps saved)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType)
{res}{txt}
{com}. graph save ../Output/majDist.png, replace
{txt}(note: file ../Output/majDist.png not found)
{res}{txt}(file ../Output/majDist.png saved)

{com}. 
. //Student income distribution
. hist parInc, freq
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph save ../Output/parIncDist.png, replace
{txt}(note: file ../Output/parIncDist.png not found)
{res}{txt}(file ../Output/parIncDist.png saved)

{com}. 
. //Debt distribution
. hist loan if loan, freq
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph save ../Output/loanDist.png, replace
{txt}(note: file ../Output/loanDist.png not found)
{res}{txt}(file ../Output/loanDist.png saved)

{com}. 
{txt}end of do-file

{com}. help graph save

. help graph export

. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType)
{res}{txt}
{com}. graph export ../Output/majDist.ps, replace
{txt}(note: file ../Output/majDist.ps not found)
(file ../Output/majDist.ps written in PostScript format)

{com}. 
. //Student income distribution
. hist parInc, freq
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.ps, replace
{txt}(note: file ../Output/parIncDist.ps not found)
(file ../Output/parIncDist.ps written in PostScript format)

{com}. 
. //Debt distribution
. hist loan if loan, freq
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.ps, replace
{txt}(note: file ../Output/loanDist.ps not found)
(file ../Output/loanDist.ps written in PostScript format)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType)
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdfs, replace
{err}{p 0 4 2}
output-file suffix "pdfs" not recognized{break}
specify correct suffix or specify as() option
{p_end}
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType)
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdfs, replace
{err}{p 0 4 2}
output-file suffix "pdfs" not recognized{break}
specify correct suffix or specify as() option
{p_end}
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType)
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdf, replace
{txt}(file ../Output/loanDist.pdf written in PDF format)

{com}. 
{txt}end of do-file

{com}. help graph pie

. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. graph pie, over(majType) pie(explode)
{res}{err}invalid wedge numbers in pie(), explode
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. graph pie, over(majType) pie(_all, explode)
{res}{txt}
{com}. 
{txt}end of do-file

{com}.  do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. graph pie, over(majType) plabel(_all percent)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. help graph

. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white))
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace 
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq graphregion(color(white))
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdf, replace
{txt}(file ../Output/loanDist.pdf written in PDF format)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white)) ///
>         xlabel("Parental Income in Year of graduation"
{err}) required
{txt}{search r(100):r(100);}

end of do-file

{search r(100):r(100);}

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white)) ///
>         xlabel("Parental Income in Year of graduation")
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{err}invalid label specifier, :  "Parental Income in Year of graduation":
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white)) ///
>         xtitle("Parental Income in Year of Graduation")
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace 
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq graphregion(color(white)) ///
>         xtitle("Debt when Graduating")
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdf, replace
{txt}(file ../Output/loanDist.pdf written in PDF format)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white)) ///
>         xtitle("Parental Income in Year of Graduation")
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace 
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq graphregion(color(white)) ///
>         xtitle("Debt When Graduating")
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdf, replace
{txt}(file ../Output/loanDist.pdf written in PDF format)

{com}. 
{txt}end of do-file

{com}. desc

{txt}Contains data from {res}../Output/Master.dta
{txt}  obs:{res}           950                          
{txt} vars:{res}            32                          6 Mar 2019 17:53
{txt} size:{res}       110,200                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:cid            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}ID CODE OF CHILD{p_end}
{p 0 48}{bind:year           }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:mid            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}ID CODE OF MOTHER OF CHILD{p_end}
{p 0 48}{bind:race           }{txt}{bind: float   }{bind:{txt}%23.0g    }{space 1}{bind:raceLab  }{bind:  }{res}{res}RACE OF CHILD (FROM MOTHERS SCREENER 79){p_end}
{p 0 48}{bind:sex            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:sexLab   }{bind:  }{res}{res}SEX OF CHILD{p_end}
{p 0 48}{bind:dob            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}DATE OF BIRTH OF CHILD - YEAR{p_end}
{p 0 48}{bind:grade          }{txt}{bind: float   }{bind:{txt}%24.0g    }{space 1}{bind:gradeLab }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:maj            }{txt}{bind: float   }{bind:{txt}%67.0g    }{space 1}{txt}vlY3046600{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:tuition        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:recloan        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:ynLab    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:loan           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:region         }{txt}{bind: float   }{bind:{txt}%13.0g    }{space 1}{txt}regionLab{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:intDate        }{txt}{bind: float   }{bind:{txt}%tm       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:sibs           }{txt}{bind: byte    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:fulltuition    }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:partialtuition }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:inCollege      }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:sibsInCollege  }{txt}{bind: byte    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cohort         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:cohLab   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:polImpact      }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:majType        }{txt}{bind: float   }{bind:{txt}%14.0g    }{space 1}{txt}majTypeLab{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:fallSemester   }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:momMarried     }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:parInc         }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:assets         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:homeVal        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:parDob         }{txt}{bind: float   }{bind:{txt}%tm       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:hhSize         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:mAge           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:efc            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:need           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:atCap          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by:  
{res}     Note:  dataset has changed since last saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. by atCap: scatter intDate debt
{err}not sorted
{txt}{search r(5):r(5);}

{com}. sort atCap

. by atCap: scatter intDate debt
{err}scatter may not be combined with by
{txt}{search r(190):r(190);}

{com}. scatter intDate debt if atCap
{err}variable debt not found
{txt}{search r(111):r(111);}

{com}. scatter intDate loan if atCap
{res}
{com}. scatter loan intDate if atCap
{res}
{com}. scatter loan intDate if atCap & !missing(atCap)
{res}
{com}. scatter loan intDate if !atCap
{res}
{com}. scatter loan intDate if atCap & !missing(atCap)
{res}
{com}. binscatter loan need if !polImpact
{res}
{com}. binscatter loan need if !polImpact & need > 0
{res}
{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. graph scatter loan intDate if atCap & !missing(atCap), name(loanAtCap)
{err}{p 0 4 2}
scattergraph_g.new  loan intDate if atCap & !missing(atCap), name(loanAtCap): class member function not found
{p_end}
{txt}{search r(4023):r(4023);}

end of do-file

{search r(4023):r(4023);}

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. graph scatter loan intDate if atCap & !missing(atCap), name(loanAtCap)
{err}{p 0 4 2}
scattergraph_g.new  loan intDate if atCap & !missing(atCap), name(loanAtCap): class member function not found
{p_end}
{txt}{search r(4023):r(4023);}

end of do-file

{search r(4023):r(4023);}

{com}. help graph combine

. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. scatter loan intDate if atCap & !missing(atCap), name(loanAtCap)
{res}{txt}
{com}. scatter loan intDate if !atCap, name(loanNotAtCap)
{res}{txt}
{com}. graph combine loanAtCap loanNotAtCap
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. //Loan vs. Time vs. atCap
. scatter loan intDate if atCap & !missing(atCap), name(loanAtCap)
{err}graph loanAtCap already exists
{txt}{search r(110):r(110);}

end of do-file

{search r(110):r(110);}

{com}. clear loanAtCap loanNotAtCap
{err}loanNotAtCap not allowed
{txt}{search r(198):r(198);}

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. use ../../NeedCalc/Output/Need.dta, clear
{txt}
{com}. 
. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white)) ///
>         xtitle("Parental Income in Year of Graduation")
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace 
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq graphregion(color(white)) ///
>         xtitle("Debt When Graduating")
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdf, replace
{txt}(file ../Output/loanDist.pdf written in PDF format)

{com}. 
. //Loan vs. Time vs. atCap
. scatter loan intDate if atCap & !missing(atCap), name(loanAtCap)
{err}graph loanAtCap already exists
{txt}{search r(110):r(110);}

end of do-file

{search r(110):r(110);}

{com}. clear

. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. use ../../NeedCalc/Output/Need.dta, clear
{txt}
{com}. 
. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white)) ///
>         xtitle("Parental Income in Year of Graduation")
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace 
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq graphregion(color(white)) ///
>         xtitle("Debt When Graduating")
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdf, replace
{txt}(file ../Output/loanDist.pdf written in PDF format)

{com}. 
. //Loan vs. Time vs. atCap
. scatter loan intDate if atCap & !missing(atCap), name(loanAtCap)
{err}graph loanAtCap already exists
{txt}{search r(110):r(110);}

end of do-file

{search r(110):r(110);}

{com}. graph drop
{err}nothing found where graph name expected
{txt}{search r(198):r(198);}

{com}. graph drop *
{err}* invalid name
no graphs dropped
{txt}{search r(111):r(111);}

{com}. help graph drop

. graph drop _all

. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. use ../../NeedCalc/Output/Need.dta, clear
{txt}
{com}. 
. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white)) ///
>         xtitle("Parental Income in Year of Graduation")
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace 
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq graphregion(color(white)) ///
>         xtitle("Debt When Graduating")
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdf, replace
{txt}(file ../Output/loanDist.pdf written in PDF format)

{com}. 
. //Loan vs. Time vs. atCap
. scatter loan intDate if atCap & !missing(atCap), name(loanAtCap)
{res}{txt}
{com}. scatter loan intDate if !atCap, name(loanNotAtCap)
{res}{txt}
{com}. graph combine loanAtCap loanNotAtCap, scale(1)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. help graph combine

. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. use ../../NeedCalc/Output/Need.dta, clear
{txt}
{com}. 
. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white)) ///
>         xtitle("Parental Income in Year of Graduation")
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace 
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq graphregion(color(white)) ///
>         xtitle("Debt When Graduating")
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdf, replace
{txt}(file ../Output/loanDist.pdf written in PDF format)

{com}. 
. //Loan vs. Time vs. atCap
. capture graph drop loanAtCap loanNotAtCapd
{txt}
{com}. scatter loan intDate if atCap & !missing(atCap), name(loanAtCap)
{err}graph loanAtCap already exists
{txt}{search r(110):r(110);}

end of do-file

{search r(110):r(110);}

{com}. help graph drop

. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. use ../../NeedCalc/Output/Need.dta, clear
{txt}
{com}. 
. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white)) ///
>         xtitle("Parental Income in Year of Graduation")
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace 
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq graphregion(color(white)) ///
>         xtitle("Debt When Graduating")
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdf, replace
{txt}(file ../Output/loanDist.pdf written in PDF format)

{com}. 
. //Loan vs. Time vs. atCap
. capture graph drop loanAtCap
{txt}
{com}. capture graph drop loanNotAtCap
{txt}
{com}. scatter loan intDate if atCap & !missing(atCap), name(loanAtCap)
{res}{txt}
{com}. scatter loan intDate if !atCap, name(loanNotAtCap)
{res}{txt}
{com}. graph combine loanAtCap loanNotAtCap, iscale(1)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. capture graph drop loanAtCap
{txt}
{com}. capture graph drop loanNotAtCap
{txt}
{com}. scatter loan intDate if atCap & !missing(atCap), name(loanAtCap) ymax(50000)
{err}option {bf:ymax()} not allowed
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. use ../../NeedCalc/Output/Need.dta, clear
{txt}
{com}. 
. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white)) ///
>         xtitle("Parental Income in Year of Graduation")
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace 
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq graphregion(color(white)) ///
>         xtitle("Debt When Graduating")
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdf, replace
{txt}(file ../Output/loanDist.pdf written in PDF format)

{com}. 
. //Loan vs. Time vs. atCap
. capture graph drop loanAtCap
{txt}
{com}. capture graph drop loanNotAtCap
{txt}
{com}. scatter loan intDate if atCap & !missing(atCap), name(loanAtCap) yscale(range(0 50000))
{res}{txt}
{com}. scatter loan intDate if !atCap, name(loanNotAtCap) yscale(range(0 50000))
{res}{txt}
{com}. graph combine loanAtCap loanNotAtCap, iscale(1)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. //Loan vs. Time vs. atCap
. capture graph drop loanAtCap
{txt}
{com}. capture graph drop loanNotAtCap
{txt}
{com}. scatter loan intDate if atCap & !missing(atCap), name(loanAtCap) ///
>         yscale(range(0 50000)) title(atCap)
{res}{txt}
{com}. scatter loan intDate if !atCap, name(loanNotAtCap) ///
>         yscale(range(0 50000)) title(!atCap)
{res}{txt}
{com}. graph combine loanAtCap loanNotAtCap, iscale(1)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. //Loan vs. Time vs. atCap
. capture graph drop loanAtCap
{txt}
{com}. capture graph drop loanNotAtCap
{txt}
{com}. binscatter loan intDate if atCap & !missing(atCap), name(loanAtCap) ///
>         yscale(range(0 50000)) title(atCap)
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.
{res}{txt}
{com}. binscatter loan intDate if !atCap, name(loanNotAtCap) ///
>         yscale(range(0 50000)) title(!atCap)
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.
{res}{txt}
{com}. graph combine loanAtCap loanNotAtCap, iscale(1)
{res}{txt}
{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. //Loan vs. Time vs. atCap
. capture graph drop loanAtCap
{txt}
{com}. capture graph drop loanNotAtCap
{txt}
{com}. binscatter loan intDate if atCap & !missing(atCap), name(loanAtCap) ///
>         yscale(range(0 10000)) title(atCap)
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.
{res}{txt}
{com}. binscatter loan intDate if !atCap, name(loanNotAtCap) ///
>         yscale(range(0 10000)) title(!atCap)
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.
{res}{txt}
{com}. graph combine loanAtCap loanNotAtCap, iscale(1)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. //Loan vs. Time vs. atCap
. capture graph drop loanAtCap
{txt}
{com}. capture graph drop loanNotAtCap
{txt}
{com}. binscatter loan intDate if atCap & !missing(atCap), name(loanAtCap) ///
>         yscale(range(0 12000)) title(atCap)
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.
{res}{txt}
{com}. binscatter loan intDate if !atCap, name(loanNotAtCap) ///
>         yscale(range(0 12000)) title(!atCap)
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.
{res}{txt}
{com}. graph combine loanAtCap loanNotAtCap, iscale(1)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. binscatter loan intDate if atCap & !missing(atCap)
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.
{res}
{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. //Loan vs. Time by atCap
. capture graph drop loanAtCap
{txt}
{com}. capture graph drop loanNotAtCap
{txt}
{com}. binscatter loan intDate if atCap & !missing(atCap), name(loanAtCap) ///
>         yscale(range(0 12000)) title(atCap)
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.
{res}{txt}
{com}. binscatter loan intDate if !atCap, name(loanNotAtCap) ///
>         yscale(range(0 12000)) title(!atCap)
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.
{res}{txt}
{com}. graph combine loanAtCap loanNotAtCap, iscale(1)
{res}{txt}
{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. graph combine loanAtCap loanNotAtCap, iscale(1) col(1)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. graph combine loanAtCap loanNotAtCap, iscale(1)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. help graph combine

. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. capture graph drop loanAtCap
{txt}
{com}. capture graph drop loanNotAtCap
{txt}
{com}. binscatter loan intDate if atCap & !missing(atCap), name(loanAtCap) ///
>         title(atCap)
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.
{res}{txt}
{com}. binscatter loan intDate if !atCap, name(loanNotAtCap) ///
>         title(!atCap)
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.
{res}{txt}
{com}. graph combine loanAtCap loanNotAtCap, iscale(1) ycommon
{res}{txt}
{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. capture graph drop loanAtCap
{txt}
{com}. capture graph drop loanNotAtCap
{txt}
{com}. binscatter loan intDate if atCap & !missing(atCap), name(loanAtCap) ///
>         title(atCap) nodraw
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.

{com}. binscatter loan intDate if !atCap, name(loanNotAtCap) ///
>         title(!atCap) nodraw
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.

{com}. graph combine loanAtCap loanNotAtCap, iscale(1) ycommon
{res}{txt}
{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. graph combine loanAtCap loanNotAtCap, ycommon
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. graph combine loanAtCap loanNotAtCap, ycommon altshrink
{res}{txt}
{com}. 
{txt}end of do-file

{com}. binscatter debt need if !polImpact
{err}variable debt not found
{txt}{search r(111):r(111);}

{com}. binscatter loan need if !polImpact
{res}
{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. //Loan vs. Need by polImpact
. capture graph drop loanNeedPol
{txt}
{com}. capture graph drop loanNeedNotPol
{txt}
{com}. binscatter loan need if polImpact & !missing(polImpact) & need > -5000, ///
>         name(loanNeedPol) title(Post-Policy) nodraw
{res}{txt}
{com}. binscatter loan need if !polImpact & need > -5000, ///
>         name(loanNeedNotPol) title(Pre-Policy) nodraw
{res}{txt}
{com}. graph combine loanNeedPol loanNeedNotPol, ycommon
{res}{txt}
{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. //Loan vs. Need by polImpact
. capture graph drop loanNeedPol
{txt}
{com}. capture graph drop loanNeedNotPol
{txt}
{com}. binscatter loan need if polImpact & !missing(polImpact) & need > -5000, ///
>         name(loanNeedPol) title(Post-Policy) nodraw
{res}{txt}
{com}. binscatter loan need if !polImpact & need > -5000, ///
>         name(loanNeedNotPol) title(Pre-Policy) nodraw
{res}{txt}
{com}. graph combine loanNeedNotPol loanNeedPol, ycommon
{res}{txt}
{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. //Loan vs. Need by polImpact
. capture graph drop loanNeedPol
{txt}
{com}. capture graph drop loanNeedNotPol
{txt}
{com}. binscatter loan need if polImpact & !missing(polImpact) & ///
>         inrange(need, -5000, 30000), name(loanNeedPol) title(Post-Policy) nodraw
{res}{txt}
{com}. binscatter loan need if !polImpact & inrange(need, -5000, 30000), ///
>         name(loanNeedNotPol) title(Pre-Policy) nodraw
{res}{txt}
{com}. graph combine loanNeedNotPol loanNeedPol, ycommon
{res}{txt}
{com}. 
{txt}end of do-file

{com}. pwd
{res}C:\Users\gmoore\desktop\honors\analysis\charts\code

{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. use ../../NeedCalc/Output/Need.dta, clear
{txt}
{com}. 
. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white)) ///
>         xtitle("Parental Income in Year of Graduation")
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace 
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq graphregion(color(white)) ///
>         xtitle("Debt When Graduating")
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdf, replace
{txt}(file ../Output/loanDist.pdf written in PDF format)

{com}. 
. //Loan vs. Time by atCap
. capture graph drop loanAtCap
{txt}
{com}. capture graph drop loanNotAtCap
{txt}
{com}. binscatter loan intDate if atCap & !missing(atCap), name(loanAtCap) ///
>         title(atCap) nodraw
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.

{com}. binscatter loan intDate if !atCap, name(loanNotAtCap) ///
>         title(!atCap) nodraw
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.

{com}. graph combine loanAtCap loanNotAtCap, ycommon
{res}{txt}
{com}. graph export ../Output/LoanTimeCapBinscatter.pdf, replace
{txt}(file ../Output/LoanTimeCapBinscatter.pdf written in PDF format)

{com}. 
. //Loan vs. Need by polImpact
. capture graph drop loanNeedPol
{txt}
{com}. capture graph drop loanNeedNotPol
{txt}
{com}. binscatter loan need if polImpact & !missing(polImpact) & ///
>         inrange(need, -5000, 30000), name(loanNeedPol) title(Post-Policy) nodraw
{res}{txt}
{com}. binscatter loan need if !polImpact & inrange(need, -5000, 30000), ///
>         name(loanNeedNotPol) title(Pre-Policy) nodraw
{res}{txt}
{com}. graph combine loanNeedNotPol loanNeedPol, ycommon
{res}{txt}
{com}. graph export ../Output/LoanTimePolBinscatter.pdf, replace
{txt}(file ../Output/LoanTimePolBinscatter.pdf written in PDF format)

{com}. 
. 
{txt}end of do-file

{com}. box need
{err}unrecognized command:  box
{txt}{search r(199):r(199);}

{com}. graph box need
{res}
{com}. graph box need if need > 0
{res}
{com}. count if atCap
{res}  734

{com}. count if atCap & !missing(atCap)
{res}  122

{com}. binscatter need loan
{res}{txt}warning: nquantiles(20) was specified, but only 12 were generated. see help file under nquantiles() for explanation.
{res}
{com}. binscatter need loan if loan <= 10000
{res}{txt}warning: nquantiles(20) was specified, but only 11 were generated. see help file under nquantiles() for explanation.
{res}
{com}. do "C:\Users\gmoore\Desktop\honors\Analysis\Charts\Code\charts.do"
{txt}
{com}. use ../../NeedCalc/Output/Need.dta, clear
{txt}
{com}. 
. //General distribution of majors
. graph pie, over(majType) plabel(_all percent) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majDist.pdf, replace
{txt}(file ../Output/majDist.pdf written in PDF format)

{com}. 
. //Student income distribution
. hist parInc, freq graphregion(color(white)) ///
>         xtitle("Parental Income in Year of Graduation")
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncDist.pdf, replace 
{txt}(file ../Output/parIncDist.pdf written in PDF format)

{com}. 
. //Debt distribution
. hist loan if loan, freq graphregion(color(white)) ///
>         xtitle("Debt When Graduating")
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanDist.pdf, replace
{txt}(file ../Output/loanDist.pdf written in PDF format)

{com}. 
. //Loan vs. Time by atCap
. capture graph drop loanAtCap
{txt}
{com}. capture graph drop loanNotAtCap
{txt}
{com}. binscatter loan intDate if atCap & !missing(atCap), name(loanAtCap) ///
>         title(atCap) nodraw
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.

{com}. binscatter loan intDate if !atCap, name(loanNotAtCap) ///
>         title(!atCap) nodraw
{res}{txt}warning: nquantiles(20) was specified, but only 18 were generated. see help file under nquantiles() for explanation.

{com}. graph combine loanAtCap loanNotAtCap, ycommon
{res}{txt}
{com}. graph export ../Output/LoanTimeCapBinscatter.pdf, replace
{txt}(file ../Output/LoanTimeCapBinscatter.pdf written in PDF format)

{com}. 
. //Loan vs. Need by polImpact
. capture graph drop loanNeedPol
{txt}
{com}. capture graph drop loanNeedNotPol
{txt}
{com}. binscatter loan need if polImpact & !missing(polImpact) & ///
>         inrange(need, -5000, 30000), name(loanNeedPol) title(Post-Policy) nodraw
{res}{txt}
{com}. binscatter loan need if !polImpact & inrange(need, -5000, 30000), ///
>         name(loanNeedNotPol) title(Pre-Policy) nodraw
{res}{txt}
{com}. graph combine loanNeedNotPol loanNeedPol, ycommon
{res}{txt}
{com}. graph export ../Output/LoanNeedPolBinscatter.pdf, replace
{txt}(file ../Output/LoanNeedPolBinscatter.pdf written in PDF format)

{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. tobit loan atCap##c.polImpact need i.year i.fall i.race i.sex i.region if inrange(year, 8, 12), ll
{res}
{txt}Tobit regression{col 51}Number of obs{col 67}= {res}       191
{txt}{col 51}LR chi2({res}13{txt}){col 67}= {res}     37.93
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0003
{txt}Log likelihood = {res}-1135.0348{txt}{col 51}Pseudo R2{col 67}= {res}    0.0164

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 17}1.atCap {c |}{col 26}{res}{space 2}-191.4664{col 38}{space 2} 2761.209{col 49}{space 1}   -0.07{col 58}{space 3}0.945{col 66}{space 4}-5640.383{col 79}{space 3}  5257.45
{txt}{space 15}polImpact {c |}{col 26}{res}{space 2}-8.073525{col 38}{space 2} 7.605139{col 49}{space 1}   -1.06{col 58}{space 3}0.290{col 66}{space 4}-23.08136{col 79}{space 3}  6.93431
{txt}{space 24} {c |}
{space 7}atCap#c.polImpact {c |}
{space 22}1  {c |}{col 26}{res}{space 2} .9718483{col 38}{space 2} 2.137983{col 49}{space 1}    0.45{col 58}{space 3}0.650{col 66}{space 4}-3.247206{col 79}{space 3} 5.190902
{txt}{space 24} {c |}
{space 20}need {c |}{col 26}{res}{space 2} .1325715{col 38}{space 2} .0419652{col 49}{space 1}    3.16{col 58}{space 3}0.002{col 66}{space 4}  .049758{col 79}{space 3} .2153849
{txt}{space 24} {c |}
{space 20}year {c |}
{space 21}10  {c |}{col 26}{res}{space 2} 9641.966{col 38}{space 2} 7803.561{col 49}{space 1}    1.24{col 58}{space 3}0.218{col 66}{space 4}-5757.433{col 79}{space 3} 25041.36
{txt}{space 21}12  {c |}{col 26}{res}{space 2} 16413.93{col 38}{space 2} 13930.66{col 49}{space 1}    1.18{col 58}{space 3}0.240{col 66}{space 4}-11076.57{col 79}{space 3} 43904.43
{txt}{space 24} {c |}
{space 10}1.fallSemester {c |}{col 26}{res}{space 2} 506.4888{col 38}{space 2} 1759.154{col 49}{space 1}    0.29{col 58}{space 3}0.774{col 66}{space 4}-2964.993{col 79}{space 3} 3977.971
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 2424.065{col 38}{space 2} 2348.693{col 49}{space 1}    1.03{col 58}{space 3}0.303{col 66}{space 4}  -2210.8{col 79}{space 3}  7058.93
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 2665.885{col 38}{space 2} 2180.574{col 49}{space 1}    1.22{col 58}{space 3}0.223{col 66}{space 4}-1637.218{col 79}{space 3} 6968.989
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} 1455.963{col 38}{space 2} 1462.432{col 49}{space 1}    1.00{col 58}{space 3}0.321{col 66}{space 4}-1429.973{col 79}{space 3} 4341.898
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-2766.982{col 38}{space 2} 2368.877{col 49}{space 1}   -1.17{col 58}{space 3}0.244{col 66}{space 4}-7441.678{col 79}{space 3} 1907.714
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-1539.543{col 38}{space 2} 2368.956{col 49}{space 1}   -0.65{col 58}{space 3}0.517{col 66}{space 4}-6214.395{col 79}{space 3} 3135.309
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-6154.683{col 38}{space 2} 2858.924{col 49}{space 1}   -2.15{col 58}{space 3}0.033{col 66}{space 4}-11796.43{col 79}{space 3}-512.9368
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-265.0551{col 38}{space 2} 3654.449{col 49}{space 1}   -0.07{col 58}{space 3}0.942{col 66}{space 4}-7476.675{col 79}{space 3} 6946.565
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                  /sigma {c |}{col 26}{res}{space 2} 8761.388{col 38}{space 2} 662.2349{col 66}{space 4} 7454.546{col 79}{space 3} 10068.23
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Obs. summary:{col 18}{res}       88{col 28}{txt} left-censored observations at loan<={res}0
{txt}{col 18}{res}      103{col 28}{txt}    uncensored observations
{col 18}{res}        0{col 28}{txt}right-censored observations

{com}. 
{txt}end of do-file

{com}. tobit loan atCap##c.polImpact need i.fall i.race i.sex i.region if inrange(year, 8, 12), ll
{res}
{txt}Tobit regression{col 51}Number of obs{col 67}= {res}       191
{txt}{col 51}LR chi2({res}11{txt}){col 67}= {res}     36.29
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0002
{txt}Log likelihood = {res}-1135.8547{txt}{col 51}Pseudo R2{col 67}= {res}    0.0157

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 17}1.atCap {c |}{col 26}{res}{space 2}-14.80938{col 38}{space 2} 2757.098{col 49}{space 1}   -0.01{col 58}{space 3}0.996{col 66}{space 4}-5455.199{col 79}{space 3} 5425.581
{txt}{space 15}polImpact {c |}{col 26}{res}{space 2} .8854165{col 38}{space 2} 1.490829{col 49}{space 1}    0.59{col 58}{space 3}0.553{col 66}{space 4}-2.056333{col 79}{space 3} 3.827165
{txt}{space 24} {c |}
{space 7}atCap#c.polImpact {c |}
{space 22}1  {c |}{col 26}{res}{space 2} .6240099{col 38}{space 2} 2.108319{col 49}{space 1}    0.30{col 58}{space 3}0.768{col 66}{space 4} -3.53619{col 79}{space 3} 4.784209
{txt}{space 24} {c |}
{space 20}need {c |}{col 26}{res}{space 2} .1337525{col 38}{space 2} .0419849{col 49}{space 1}    3.19{col 58}{space 3}0.002{col 66}{space 4} .0509067{col 79}{space 3} .2165983
{txt}{space 10}1.fallSemester {c |}{col 26}{res}{space 2} 46.27752{col 38}{space 2} 1681.776{col 49}{space 1}    0.03{col 58}{space 3}0.978{col 66}{space 4}-3272.255{col 79}{space 3}  3364.81
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 2167.496{col 38}{space 2} 2343.125{col 49}{space 1}    0.93{col 58}{space 3}0.356{col 66}{space 4}-2456.031{col 79}{space 3} 6791.024
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 2460.251{col 38}{space 2} 2171.509{col 49}{space 1}    1.13{col 58}{space 3}0.259{col 66}{space 4}-1824.638{col 79}{space 3} 6745.141
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}  1317.69{col 38}{space 2} 1454.888{col 49}{space 1}    0.91{col 58}{space 3}0.366{col 66}{space 4} -1553.14{col 79}{space 3}  4188.52
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-2978.235{col 38}{space 2} 2366.103{col 49}{space 1}   -1.26{col 58}{space 3}0.210{col 66}{space 4}-7647.101{col 79}{space 3} 1690.632
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-1722.761{col 38}{space 2} 2366.515{col 49}{space 1}   -0.73{col 58}{space 3}0.468{col 66}{space 4}-6392.441{col 79}{space 3}  2946.92
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-6480.082{col 38}{space 2} 2849.871{col 49}{space 1}   -2.27{col 58}{space 3}0.024{col 66}{space 4}-12103.54{col 79}{space 3}-856.6278
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 560.6876{col 38}{space 2} 3567.738{col 49}{space 1}    0.16{col 58}{space 3}0.875{col 66}{space 4}-6479.282{col 79}{space 3} 7600.657
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                  /sigma {c |}{col 26}{res}{space 2} 8786.593{col 38}{space 2} 664.4803{col 66}{space 4}  7475.42{col 79}{space 3} 10097.77
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Obs. summary:{col 18}{res}       88{col 28}{txt} left-censored observations at loan<={res}0
{txt}{col 18}{res}      103{col 28}{txt}    uncensored observations
{col 18}{res}        0{col 28}{txt}right-censored observations

{com}. corr need atCap
{txt}(obs=338)

             {c |}     need    atCap
{hline 13}{c +}{hline 18}
        need {c |}{res}   1.0000
       {txt}atCap {c |}{res}   0.4859   1.0000


{com}. reg loan need atCap

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     323
{txt}{hline 13}{char +}{hline 30}           F(  2,   320) ={res}    8.83
    {txt}   Model {char |} {res}  536439592     2   268219796           {txt}Prob > F      = {res} 0.0002
    {txt}Residual {char |} {res} 9.7209e+09   320  30377702.3           {txt}R-squared     = {res} 0.0523
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0464
    {txt}   Total {char |} {res} 1.0257e+10   322  31854982.4           {txt}Root MSE      = {res} 5511.6

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        loan{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}need {c |}{col 14}{res}{space 2} .0199412{col 26}{space 2} .0109603{col 37}{space 1}    1.82{col 46}{space 3}0.070{col 54}{space 4}-.0016221{col 67}{space 3} .0415046
{txt}{space 7}atCap {c |}{col 14}{res}{space 2} 1791.613{col 26}{space 2} 731.6185{col 37}{space 1}    2.45{col 46}{space 3}0.015{col 54}{space 4}  352.223{col 67}{space 3} 3231.003
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  3326.72{col 26}{space 2} 435.0415{col 37}{space 1}    7.65{col 46}{space 3}0.000{col 54}{space 4} 2470.817{col 67}{space 3} 4182.623
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. loan need atCap##polImpact
{err}unrecognized command:  loan
{txt}{search r(199):r(199);}

{com}. reg loan need atCap##polImpact

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     323
{txt}{hline 13}{char +}{hline 30}           F(  6,   316) ={res}    4.02
    {txt}   Model {char |} {res}  727706214     6   121284369           {txt}Prob > F      = {res} 0.0007
    {txt}Residual {char |} {res} 9.5296e+09   316  30156956.1           {txt}R-squared     = {res} 0.0709
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0533
    {txt}   Total {char |} {res} 1.0257e+10   322  31854982.4           {txt}Root MSE      = {res} 5491.5

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           loan{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}need {c |}{col 17}{res}{space 2} .0219207{col 29}{space 2} .0109622{col 40}{space 1}    2.00{col 49}{space 3}0.046{col 57}{space 4} .0003525{col 70}{space 3} .0434889
{txt}{space 8}1.atCap {c |}{col 17}{res}{space 2} 2076.094{col 29}{space 2} 912.6865{col 40}{space 1}    2.27{col 49}{space 3}0.024{col 57}{space 4} 280.3833{col 70}{space 3} 3871.804
{txt}{space 15} {c |}
{space 6}polImpact {c |}
{space 10}1000  {c |}{col 17}{res}{space 2} 1721.374{col 29}{space 2} 905.7451{col 40}{space 1}    1.90{col 49}{space 3}0.058{col 57}{space 4}-60.67921{col 70}{space 3} 3503.427
{txt}{space 10}1875  {c |}{col 17}{res}{space 2} 1596.338{col 29}{space 2} 1239.903{col 40}{space 1}    1.29{col 49}{space 3}0.199{col 57}{space 4} -843.171{col 70}{space 3} 4035.848
{txt}{space 15} {c |}
atCap#polImpact {c |}
{space 8}1 1000  {c |}{col 17}{res}{space 2} -1957.55{col 29}{space 2} 1495.575{col 40}{space 1}   -1.31{col 49}{space 3}0.192{col 57}{space 4}-4900.093{col 70}{space 3} 984.9921
{txt}{space 8}1 1875  {c |}{col 17}{res}{space 2} 119.9233{col 29}{space 2} 1864.453{col 40}{space 1}    0.06{col 49}{space 3}0.949{col 57}{space 4}-3548.387{col 70}{space 3} 3788.233
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} 2768.844{col 29}{space 2} 507.6915{col 40}{space 1}    5.45{col 49}{space 3}0.000{col 57}{space 4} 1769.962{col 70}{space 3} 3767.727
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. reg loan need atCap##c.polImpact

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     323
{txt}{hline 13}{char +}{hline 30}           F(  4,   318) ={res}    5.62
    {txt}   Model {char |} {res}  677289608     4   169322402           {txt}Prob > F      = {res} 0.0002
    {txt}Residual {char |} {res} 9.5800e+09   318  30125832.5           {txt}R-squared     = {res} 0.0660
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0543
    {txt}   Total {char |} {res} 1.0257e+10   322  31854982.4           {txt}Root MSE      = {res} 5488.7

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}             loan{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}need {c |}{col 19}{res}{space 2} .0214907{col 31}{space 2} .0109446{col 42}{space 1}    1.96{col 51}{space 3}0.050{col 59}{space 4}-.0000422{col 72}{space 3} .0430237
{txt}{space 10}1.atCap {c |}{col 19}{res}{space 2} 1810.926{col 31}{space 2} 886.4707{col 42}{space 1}    2.04{col 51}{space 3}0.042{col 59}{space 4} 66.83709{col 72}{space 3} 3555.014
{txt}{space 8}polImpact {c |}{col 19}{res}{space 2} 1.122272{col 31}{space 2} .5818587{col 42}{space 1}    1.93{col 51}{space 3}0.055{col 59}{space 4}-.0225069{col 72}{space 3} 2.267051
{txt}{space 17} {c |}
atCap#c.polImpact {c |}
{space 15}1  {c |}{col 19}{res}{space 2}-.4348215{col 31}{space 2} .9129338{col 42}{space 1}   -0.48{col 51}{space 3}0.634{col 59}{space 4}-2.230975{col 72}{space 3} 1.361332
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2}  2850.92{col 31}{space 2} 498.5047{col 42}{space 1}    5.72{col 51}{space 3}0.000{col 59}{space 4} 1870.136{col 72}{space 3} 3831.705
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. reg loan need##atCap
{err}need:  factor variables may not contain noninteger values
{txt}{search r(452):r(452);}

{com}. reg loan c.need##atCap

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     323
{txt}{hline 13}{char +}{hline 30}           F(  3,   319) ={res}    8.45
    {txt}   Model {char |} {res}  755298076     3   251766025           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 9.5020e+09   319  29786853.5           {txt}R-squared     = {res} 0.0736
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0649
    {txt}   Total {char |} {res} 1.0257e+10   322  31854982.4           {txt}Root MSE      = {res} 5457.7

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        loan{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}need {c |}{col 14}{res}{space 2} .0145272{col 26}{space 2} .0110354{col 37}{space 1}    1.32{col 46}{space 3}0.189{col 54}{space 4}-.0071842{col 67}{space 3} .0362386
{txt}{space 5}1.atCap {c |}{col 14}{res}{space 2}-172.9726{col 26}{space 2} 1024.768{col 37}{space 1}   -0.17{col 46}{space 3}0.866{col 54}{space 4} -2189.13{col 67}{space 3} 1843.185
{txt}{space 12} {c |}
atCap#c.need {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .1652713{col 26}{space 2} .0609717{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .0453139{col 67}{space 3} .2852287
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3223.207{col 26}{space 2} 432.4792{col 37}{space 1}    7.45{col 46}{space 3}0.000{col 54}{space 4} 2372.335{col 67}{space 3} 4074.079
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. reg loan c.need##atCap if !polImpact

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     195
{txt}{hline 13}{char +}{hline 30}           F(  3,   191) ={res}    6.40
    {txt}   Model {char |} {res}  374719198     3   124906399           {txt}Prob > F      = {res} 0.0004
    {txt}Residual {char |} {res} 3.7293e+09   191  19525333.4           {txt}R-squared     = {res} 0.0913
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0770
    {txt}   Total {char |} {res} 4.1041e+09   194  21154937.5           {txt}Root MSE      = {res} 4418.7

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        loan{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}need {c |}{col 14}{res}{space 2}  .011213{col 26}{space 2} .0117279{col 37}{space 1}    0.96{col 46}{space 3}0.340{col 54}{space 4}-.0119199{col 67}{space 3} .0343458
{txt}{space 5}1.atCap {c |}{col 14}{res}{space 2}  1164.62{col 26}{space 2} 1136.568{col 37}{space 1}    1.02{col 46}{space 3}0.307{col 54}{space 4}-1077.217{col 67}{space 3} 3406.457
{txt}{space 12} {c |}
atCap#c.need {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0952166{col 26}{space 2} .0694166{col 37}{space 1}    1.37{col 46}{space 3}0.172{col 54}{space 4} -.041705{col 67}{space 3} .2321383
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2587.768{col 26}{space 2} 428.9128{col 37}{space 1}    6.03{col 46}{space 3}0.000{col 54}{space 4} 1741.754{col 67}{space 3} 3433.782
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. count
{res}  950

{com}. count if !missing(need)
{res}  338

{com}. reg loan c.need##atCap if polImpact & !missing(polImpact)

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     128
{txt}{hline 13}{char +}{hline 30}           F(  3,   124) ={res}    3.07
    {txt}   Model {char |} {res}  414926619     3   138308873           {txt}Prob > F      = {res} 0.0303
    {txt}Residual {char |} {res} 5.5811e+09   124  45009090.6           {txt}R-squared     = {res} 0.0692
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0467
    {txt}   Total {char |} {res} 5.9961e+09   127  47213022.4           {txt}Root MSE      = {res} 6708.9

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        loan{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}need {c |}{col 14}{res}{space 2} .0240374{col 26}{space 2} .0211334{col 37}{space 1}    1.14{col 46}{space 3}0.258{col 54}{space 4}-.0177916{col 67}{space 3} .0658663
{txt}{space 5}1.atCap {c |}{col 14}{res}{space 2}-2138.868{col 26}{space 2} 1874.972{col 37}{space 1}   -1.14{col 46}{space 3}0.256{col 54}{space 4}-5849.963{col 67}{space 3} 1572.227
{txt}{space 12} {c |}
atCap#c.need {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .2301021{col 26}{space 2} .1067254{col 37}{space 1}    2.16{col 46}{space 3}0.033{col 54}{space 4} .0188626{col 67}{space 3} .4413416
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4500.354{col 26}{space 2} 920.6302{col 37}{space 1}    4.89{col 46}{space 3}0.000{col 54}{space 4} 2678.169{col 67}{space 3}  6322.54
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. reg loan c.need##atCap##polImpact

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     323
{txt}{hline 13}{char +}{hline 30}           F( 11,   311) ={res}    3.67
    {txt}   Model {char |} {res} 1.1795e+09    11   107229052           {txt}Prob > F      = {res} 0.0001
    {txt}Residual {char |} {res} 9.0778e+09   311  29189018.5           {txt}R-squared     = {res} 0.1150
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0837
    {txt}   Total {char |} {res} 1.0257e+10   322  31854982.4           {txt}Root MSE      = {res} 5402.7

{txt}{hline 23}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                  loan{col 24}{c |}      Coef.{col 36}   Std. Err.{col 48}      t{col 56}   P>|t|{col 64}     [95% Con{col 77}f. Interval]
{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 18}need {c |}{col 24}{res}{space 2}  .011213{col 36}{space 2} .0143394{col 47}{space 1}    0.78{col 56}{space 3}0.435{col 64}{space 4}-.0170016{col 77}{space 3} .0394275
{txt}{space 15}1.atCap {c |}{col 24}{res}{space 2}  1164.62{col 36}{space 2} 1389.651{col 47}{space 1}    0.84{col 56}{space 3}0.403{col 64}{space 4}-1569.688{col 77}{space 3} 3898.927
{txt}{space 22} {c |}
{space 10}atCap#c.need {c |}
{space 20}1  {c |}{col 24}{res}{space 2} .0952166{col 36}{space 2} .0848739{col 47}{space 1}    1.12{col 56}{space 3}0.263{col 64}{space 4} -.071783{col 77}{space 3} .2622162
{txt}{space 22} {c |}
{space 13}polImpact {c |}
{space 17}1000  {c |}{col 24}{res}{space 2} 1777.425{col 36}{space 2} 1055.371{col 47}{space 1}    1.68{col 56}{space 3}0.093{col 64}{space 4}-299.1446{col 77}{space 3} 3853.995
{txt}{space 17}1875  {c |}{col 24}{res}{space 2} 2082.163{col 36}{space 2} 1378.475{col 47}{space 1}    1.51{col 56}{space 3}0.132{col 64}{space 4}-630.1527{col 77}{space 3}  4794.48
{txt}{space 22} {c |}
{space 6}polImpact#c.need {c |}
{space 17}1000  {c |}{col 24}{res}{space 2}  .005451{col 36}{space 2} .0260128{col 47}{space 1}    0.21{col 56}{space 3}0.834{col 64}{space 4}-.0457325{col 77}{space 3} .0566344
{txt}{space 17}1875  {c |}{col 24}{res}{space 2} .0247251{col 36}{space 2} .0309674{col 47}{space 1}    0.80{col 56}{space 3}0.425{col 64}{space 4}-.0362071{col 77}{space 3} .0856573
{txt}{space 22} {c |}
{space 7}atCap#polImpact {c |}
{space 15}1 1000  {c |}{col 24}{res}{space 2}-2217.358{col 36}{space 2} 2301.059{col 47}{space 1}   -0.96{col 56}{space 3}0.336{col 64}{space 4} -6744.97{col 77}{space 3} 2310.253
{txt}{space 15}1 1875  {c |}{col 24}{res}{space 2}-6603.947{col 36}{space 2}   3037.4{col 47}{space 1}   -2.17{col 56}{space 3}0.030{col 64}{space 4} -12580.4{col 77}{space 3}-627.4949
{txt}{space 22} {c |}
atCap#polImpact#c.need {c |}
{space 15}1 1000  {c |}{col 24}{res}{space 2} .0107531{col 36}{space 2} .1325761{col 47}{space 1}    0.08{col 56}{space 3}0.935{col 64}{space 4}-.2501064{col 77}{space 3} .2716125
{txt}{space 15}1 1875  {c |}{col 24}{res}{space 2} .4518019{col 36}{space 2} .1817245{col 47}{space 1}    2.49{col 56}{space 3}0.013{col 64}{space 4}  .094237{col 77}{space 3} .8093669
{txt}{space 22} {c |}
{space 17}_cons {c |}{col 24}{res}{space 2} 2587.768{col 36}{space 2} 524.4204{col 47}{space 1}    4.93{col 56}{space 3}0.000{col 64}{space 4} 1555.908{col 77}{space 3} 3619.629
{txt}{hline 23}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. reg loan c.need##atCap##.polImpact
{err}.polImpact invalid name
{txt}{search r(198):r(198);}

{com}. reg loan c.need##atCap##c.polImpact

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     323
{txt}{hline 13}{char +}{hline 30}           F(  7,   315) ={res}    5.08
    {txt}   Model {char |} {res} 1.0410e+09     7   148716156           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 9.2163e+09   315  29258067.5           {txt}R-squared     = {res} 0.1015
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0815
    {txt}   Total {char |} {res} 1.0257e+10   322  31854982.4           {txt}Root MSE      = {res} 5409.1

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}need {c |}{col 26}{res}{space 2} .0097146{col 38}{space 2} .0138976{col 49}{space 1}    0.70{col 58}{space 3}0.485{col 66}{space 4}-.0176292{col 79}{space 3} .0370584
{txt}{space 17}1.atCap {c |}{col 26}{res}{space 2} 1463.748{col 38}{space 2} 1338.025{col 49}{space 1}    1.09{col 58}{space 3}0.275{col 66}{space 4}-1168.848{col 79}{space 3} 4096.343
{txt}{space 24} {c |}
{space 12}atCap#c.need {c |}
{space 22}1  {c |}{col 26}{res}{space 2} .0547794{col 38}{space 2} .0814343{col 49}{space 1}    0.67{col 58}{space 3}0.502{col 66}{space 4}-.1054445{col 79}{space 3} .2150033
{txt}{space 24} {c |}
{space 15}polImpact {c |}{col 26}{res}{space 2}  1.33408{col 38}{space 2} .6523683{col 49}{space 1}    2.04{col 58}{space 3}0.042{col 66}{space 4}   .05053{col 79}{space 3}  2.61763
{txt}{space 24} {c |}
{space 6}c.need#c.polImpact {c |}{col 26}{res}{space 2} .0000115{col 38}{space 2} .0000154{col 49}{space 1}    0.75{col 58}{space 3}0.454{col 66}{space 4}-.0000188{col 79}{space 3} .0000418
{txt}{space 24} {c |}
{space 7}atCap#c.polImpact {c |}
{space 22}1  {c |}{col 26}{res}{space 2}-3.068454{col 38}{space 2} 1.478403{col 49}{space 1}   -2.08{col 58}{space 3}0.039{col 66}{space 4}-5.977246{col 79}{space 3}-.1596613
{txt}{space 24} {c |}
atCap#c.need#c.polImpact {c |}
{space 22}1  {c |}{col 26}{res}{space 2} .0001742{col 38}{space 2} .0000884{col 49}{space 1}    1.97{col 58}{space 3}0.050{col 66}{space 4} 3.34e-07{col 79}{space 3} .0003481
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 2648.992{col 38}{space 2} 513.3517{col 49}{space 1}    5.16{col 58}{space 3}0.000{col 66}{space 4} 1638.961{col 79}{space 3} 3659.024
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 