-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\gmoor\Desktop\honors\test_tobit_iv_method.log
  log type:  text
 opened on:  23 Oct 2018, 21:39:35

. clear

. set seed 1234

. set obs 2000000
obs was 0, now 2000000

. gen x=uniform()

. gen z=uniform()

. gen e=rnormal()

. gen debtlatent=3+4*z+ rnormal() +.8*e // adding e makes debt endogenous in the y1 model.  rnormal() adds an uncorrelated error.

. gen debtpos=debtlatent>7

. gen debtobs= debtpos*debtlatent

. 
. gen y1=1 + 2*debtobs + 2*x + e if debtpos==1
(1745053 missing values generated)

. replace y1=1 +  2*x + e if debtpos==0
(1745053 real changes made)

. 
. sum

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
           x |   2000000    .4998631     .288643   1.76e-07   .9999999
           z |   2000000    .5002663    .2885289   2.21e-08   .9999995
           e |   2000000    .0002864    1.000009  -4.783692   4.831412
  debtlatent |   2000000    5.000839    1.723554  -2.572064   13.06728
     debtpos |   2000000    .1274735    .3335027          0          1
-------------+--------------------------------------------------------
     debtobs |   2000000    .9946343    2.613213          0   13.06728
          y1 |   2000000    3.989281    5.643212  -3.238362   31.41693

. 
. * reg below is biased for debtobs
. reg y1 x debtobs

      Source |       SS       df       MS              Number of obs = 2000000
-------------+------------------------------           F(  2,1999997) =       .
       Model |  61878627.9     2  30939313.9           Prob > F      =  0.0000
    Residual |  1813024.051999997  .906513385           R-squared     =  0.9715
-------------+------------------------------           Adj R-squared =  0.9715
       Total |  63691651.91999999  31.8458419           Root MSE      =  .95211

------------------------------------------------------------------------------
          y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   2.006081   .0023324   860.08   0.000      2.00151    2.010653
     debtobs |   2.117014   .0002576  8217.25   0.000     2.116509    2.117519
       _cons |   .8808601   .0013705   642.71   0.000     .8781739    .8835463
------------------------------------------------------------------------------

. 
. reg debtobs z

      Source |       SS       df       MS              Number of obs = 2000000
-------------+------------------------------           F(  1,1999998) =       .
       Model |   2179010.3     1   2179010.3           Prob > F      =  0.0000
    Residual |  11478752.31999998  5.73938187           R-squared     =  0.1595
-------------+------------------------------           Adj R-squared =  0.1595
       Total |  13657762.61999999   6.8288847           Root MSE      =  2.3957

------------------------------------------------------------------------------
     debtobs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           z |   3.617641   .0058712   616.17   0.000     3.606134    3.629148
       _cons |  -.8151495   .0033907  -240.41   0.000    -.8217951   -.8085039
------------------------------------------------------------------------------

. predict debthat
(option xb assumed; fitted values)

. 
. ivreg y1 x (debtobs=z)

Instrumental variables (2SLS) regression

      Source |       SS       df       MS              Number of obs = 2000000
-------------+------------------------------           F(  2,1999997) =       .
       Model |  61692656.2     2  30846328.1           Prob > F      =  0.0000
    Residual |   1998995.71999997   .99949935           R-squared     =  0.9686
-------------+------------------------------           Adj R-squared =  0.9686
       Total |  63691651.91999999  31.8458419           Root MSE      =  .99975

------------------------------------------------------------------------------
          y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     debtobs |   2.000324   .0006773  2953.51   0.000     1.998997    2.001652
           x |   2.005865   .0024491   819.00   0.000     2.001064    2.010665
       _cons |   .9970322   .0015663   636.57   0.000     .9939624    1.000102
------------------------------------------------------------------------------
Instrumented:  debtobs
Instruments:   x z
------------------------------------------------------------------------------

. reg y1 x debthat   // this should be same as iv above

      Source |       SS       df       MS              Number of obs = 2000000
-------------+------------------------------           F(  2,1999997) =       .
       Model |  9386820.97     2  4693410.49           Prob > F      =  0.0000
    Residual |    543048311999997  27.1524562           R-squared     =  0.1474
-------------+------------------------------           Adj R-squared =  0.1474
       Total |  63691651.91999999  31.8458419           Root MSE      =  5.2108

------------------------------------------------------------------------------
          y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   2.004366   .0127652   157.02   0.000     1.979347    2.029386
     debthat |   2.000324     .00353   566.66   0.000     1.993406    2.007243
       _cons |   .9977813   .0081629   122.23   0.000     .9817823     1.01378
------------------------------------------------------------------------------

. 
. tobit debtobs z, ll(0)

Tobit regression                                  Number of obs   =    2000000
                                                  LR chi2(1)      =  388775.97
                                                  Prob > chi2     =     0.0000
Log likelihood =   -1316967                       Pseudo R2       =     0.1286

------------------------------------------------------------------------------
     debtobs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           z |    31.7186   .0762984   415.72   0.000     31.56906    31.86814
       _cons |   -31.4147   .0699884  -448.86   0.000    -31.55188   -31.27753
-------------+----------------------------------------------------------------
      /sigma |   10.37797   .0178832                      10.34292    10.41302
------------------------------------------------------------------------------
  Obs. summary:    1745053  left-censored observations at debtobs<=0
                    254947     uncensored observations
                         0 right-censored observations

. predict debttobit
(option xb assumed; fitted values)

. 
. reg y1 x debttobit      // using the fitted value directly

      Source |       SS       df       MS              Number of obs = 2000000
-------------+------------------------------           F(  2,1999997) =       .
       Model |  9386820.98     2  4693410.49           Prob > F      =  0.0000
    Residual |    543048311999997  27.1524562           R-squared     =  0.1474
-------------+------------------------------           Adj R-squared =  0.1474
       Total |  63691651.91999999  31.8458419           Root MSE      =  5.2108

------------------------------------------------------------------------------
          y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   2.004366   .0127652   157.02   0.000     1.979347    2.029386
   debttobit |   .2281455   .0004026   566.66   0.000     .2273564    .2289346
       _cons |    6.53434   .0096668   675.96   0.000     6.515393    6.553286
------------------------------------------------------------------------------

. 
. ivreg y1 x (debtobs=debttobit)  //using the fitted value as an instrument--this is harmless's method

Instrumental variables (2SLS) regression

      Source |       SS       df       MS              Number of obs = 2000000
-------------+------------------------------           F(  2,1999997) =       .
       Model |  61692656.2     2  30846328.1           Prob > F      =  0.0000
    Residual |   1998995.71999997   .99949935           R-squared     =  0.9686
-------------+------------------------------           Adj R-squared =  0.9686
       Total |  63691651.91999999  31.8458419           Root MSE      =  .99975

------------------------------------------------------------------------------
          y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     debtobs |   2.000324   .0006773  2953.51   0.000     1.998997    2.001652
           x |   2.005865   .0024491   819.00   0.000     2.001064    2.010665
       _cons |   .9970322   .0015663   636.57   0.000     .9939624    1.000102
------------------------------------------------------------------------------
Instrumented:  debtobs
Instruments:   x debttobit
------------------------------------------------------------------------------

. 
. 
. sum debt*

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  debtlatent |   2000000    5.000839    1.723554  -2.572064   13.06728
     debtpos |   2000000    .1274735    .3335027          0          1
     debtobs |   2000000    .9946343    2.613213          0   13.06728
     debthat |   2000000    .9946343    1.043794  -.8151495    2.80249
   debttobit |   2000000   -15.54695    9.151732   -31.4147   .3038841

. log close
      name:  <unnamed>
       log:  C:\Users\gmoor\Desktop\honors\test_tobit_iv_method.log
  log type:  text
 closed on:  23 Oct 2018, 21:39:44
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
