{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\gmoor\Desktop\honors\Master\master.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Nov 2018, 14:00:13
{txt}
{com}. 
. set more off
{txt}
{com}. 
. cd ../NLSY79ParentData
{res}C:\Users\gmoor\Desktop\honors\NLSY79ParentData
{txt}
{com}. do ParImport
{txt}
{com}. import delimited parInc.csv, clear case(preserve)
{res}{text}(7 vars, 12686 obs)
{com}. 
. 
. //Code Stata missings
. rename R7006500 parInc0
{res}{txt}
{com}. rename R7703700 parInc2
{res}{txt}
{com}. rename R8496100 parInc4
{res}{txt}
{com}. rename T0987800 parInc6
{res}{txt}
{com}. rename T2210000 parInc8
{res}{txt}
{com}. rename T3107800 parInc10
{res}{txt}
{com}. rename R0000100 mid
{res}{txt}
{com}. 
. 
. reshape long parInc, i(mid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}   12686   {txt}->{res}   76116
{txt}Number of variables            {res}       7   {txt}->{res}       3
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
           {res}parInc0 parInc2 ... parInc10   {txt}->   {res}parInc
{txt}{hline 77}

{com}. replace parInc = . if parInc < 0
{txt}(36089 real changes made, 36089 to missing)

{com}. sort mid year
{txt}
{com}. 
{txt}end of do-file

{com}. 
. tempfile parInc
{txt}
{com}. save `parInc'
{txt}file C:\Users\gmoor\AppData\Local\Temp\ST_00000001.tmp saved

{com}. 
. cd ../NLSYChild79Data
{res}C:\Users\gmoor\Desktop\honors\NLSYChild79Data
{txt}
{com}. do Import
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}. 
. //Change to long data
. reshape long maj recloan loan region, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      29   {txt}->{res}      10
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. //Need many:one due to siblings
. //Assertion guarantees all children have parental incomes
. //Drop those women without children in college
. merge m:1 mid year using `parInc', assert(match using) keep(match) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          19,020{txt}  
{col 5}{hline 41}

{com}. 
. //Works both with drop and without drop
. //without drop is slightly stronger
. drop if year == 10
{txt}(3170 observations deleted)

{com}. 
. //Calculates log of loans
. gen lloan = ln(loan)
{txt}(14289 missing values generated)

{com}. 
. //Dummies for each major
. gen busMaj = maj == 7
{txt}
{com}. gen artMaj = maj == 15
{txt}
{com}. gen eduMaj = maj == 12
{txt}
{com}. gen  csMaj = maj == 17
{txt}
{com}. 
. //Add birth year as control
. //Introduce second stage
. 
. //Linear estimator
. reg loan year cohort parInc i.race i.sex i.region

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}    3145
{txt}{hline 13}{char +}{hline 30}           F(  9,  3135) ={res}   11.36
    {txt}   Model {char |} {res} 2.7980e+09     9   310893209           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 8.5766e+10  3135    27357430           {txt}R-squared     = {res} 0.0316
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0288
    {txt}   Total {char |} {res} 8.8564e+10  3144  28169078.3           {txt}Root MSE      = {res} 5230.4

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2} 150.1164{col 38}{space 2} 54.12588{col 49}{space 1}    2.77{col 58}{space 3}0.006{col 66}{space 4} 43.99062{col 79}{space 3} 256.2421
{txt}{space 18}cohort {c |}{col 26}{res}{space 2} 565.0713{col 38}{space 2} 302.6834{col 49}{space 1}    1.87{col 58}{space 3}0.062{col 66}{space 4}-28.40642{col 79}{space 3} 1158.549
{txt}{space 18}parInc {c |}{col 26}{res}{space 2} .0021252{col 38}{space 2} .0014506{col 49}{space 1}    1.46{col 58}{space 3}0.143{col 66}{space 4}-.0007191{col 79}{space 3} .0049695
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 823.5849{col 38}{space 2} 281.7086{col 49}{space 1}    2.92{col 58}{space 3}0.003{col 66}{space 4}  271.233{col 79}{space 3} 1375.937
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 791.9652{col 38}{space 2} 262.8285{col 49}{space 1}    3.01{col 58}{space 3}0.003{col 66}{space 4} 276.6318{col 79}{space 3} 1307.299
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-15.22861{col 38}{space 2} 192.8794{col 49}{space 1}   -0.08{col 58}{space 3}0.937{col 66}{space 4}-393.4113{col 79}{space 3} 362.9541
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-537.4654{col 38}{space 2} 340.0582{col 49}{space 1}   -1.58{col 58}{space 3}0.114{col 66}{space 4}-1204.225{col 79}{space 3} 129.2937
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-1623.935{col 38}{space 2} 323.9739{col 49}{space 1}   -5.01{col 58}{space 3}0.000{col 66}{space 4}-2259.158{col 79}{space 3}-988.7129
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-1259.494{col 38}{space 2}   358.91{col 49}{space 1}   -3.51{col 58}{space 3}0.000{col 66}{space 4}-1963.216{col 79}{space 3}-555.7715
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}  1812.74{col 38}{space 2} 435.7105{col 49}{space 1}    4.16{col 58}{space 3}0.000{col 66}{space 4} 958.4335{col 79}{space 3} 2667.047
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg lloan year cohort parInc i.race i.sex i.region 

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}    1283
{txt}{hline 13}{char +}{hline 30}           F(  9,  1273) ={res}   18.79
    {txt}   Model {char |} {res} 126.959675     9  14.1066305           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 955.572071  1273  .750645775           {txt}R-squared     = {res} 0.1173
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.1110
    {txt}   Total {char |} {res} 1082.53175  1282  .844408538           {txt}Root MSE      = {res}  .8664

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                   lloan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2}  .059212{col 38}{space 2}  .014394{col 49}{space 1}    4.11{col 58}{space 3}0.000{col 66}{space 4} .0309735{col 79}{space 3} .0874505
{txt}{space 18}cohort {c |}{col 26}{res}{space 2} .0986194{col 38}{space 2} .0787235{col 49}{space 1}    1.25{col 58}{space 3}0.211{col 66}{space 4}-.0558226{col 79}{space 3} .2530614
{txt}{space 18}parInc {c |}{col 26}{res}{space 2} 2.99e-06{col 38}{space 2} 4.55e-07{col 49}{space 1}    6.57{col 58}{space 3}0.000{col 66}{space 4} 2.10e-06{col 79}{space 3} 3.88e-06
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} .1347635{col 38}{space 2}  .076436{col 49}{space 1}    1.76{col 58}{space 3}0.078{col 66}{space 4}-.0151909{col 79}{space 3} .2847179
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} .1671058{col 38}{space 2} .0740756{col 49}{space 1}    2.26{col 58}{space 3}0.024{col 66}{space 4} .0217822{col 79}{space 3} .3124294
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-.0964505{col 38}{space 2} .0508782{col 49}{space 1}   -1.90{col 58}{space 3}0.058{col 66}{space 4}-.1962649{col 79}{space 3} .0033639
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.1682234{col 38}{space 2} .0803906{col 49}{space 1}   -2.09{col 58}{space 3}0.037{col 66}{space 4} -.325936{col 79}{space 3}-.0105109
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-.3429995{col 38}{space 2} .0807359{col 49}{space 1}   -4.25{col 58}{space 3}0.000{col 66}{space 4}-.5013896{col 79}{space 3}-.1846094
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.0210423{col 38}{space 2} .0948945{col 49}{space 1}   -0.22{col 58}{space 3}0.825{col 66}{space 4}-.2072091{col 79}{space 3} .1651245
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}   7.8671{col 38}{space 2} .1177118{col 49}{space 1}   66.83{col 58}{space 3}0.000{col 66}{space 4} 7.636169{col 79}{space 3}  8.09803
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. ivprobit busMaj year i.race i.sex i.region recloan (loan = year cohort parInc i.race i.sex i.region) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1666.8613}  
Iteration 1:{space 3}log likelihood = {res:  -1651.29}  
Iteration 2:{space 3}log likelihood = {res:-1651.2688}  
Iteration 3:{space 3}log likelihood = {res:-1651.2688}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-32119.423}  (not concave)
Iteration 1:{space 3}log likelihood = {res:-32118.609}  (backed up)
Iteration 2:{space 3}log likelihood = {res:-32118.131}  
Iteration 3:{space 3}log likelihood = {res:-32118.131}  
Iteration 4:{space 3}log likelihood = {res:-32118.131}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}      3145
{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}     29.76
{txt}Log likelihood = {res}-32118.131{txt}{col 51}Prob > chi2{col 67}= {res}    0.0005

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2} 2.37e-06{col 38}{space 2} .0000793{col 49}{space 1}    0.03{col 58}{space 3}0.976{col 66}{space 4} -.000153{col 79}{space 3} .0001578
{txt}{space 20}year {c |}{col 26}{res}{space 2}  .025138{col 38}{space 2} .0194687{col 49}{space 1}    1.29{col 58}{space 3}0.197{col 66}{space 4}-.0130198{col 79}{space 3} .0632959
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} .1186813{col 38}{space 2} .0832277{col 49}{space 1}    1.43{col 58}{space 3}0.154{col 66}{space 4} -.044442{col 79}{space 3} .2818046
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2}-.0307923{col 38}{space 2} .0884669{col 49}{space 1}   -0.35{col 58}{space 3}0.728{col 66}{space 4}-.2041842{col 79}{space 3} .1425996
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-.2103028{col 38}{space 2} .0611512{col 49}{space 1}   -3.44{col 58}{space 3}0.001{col 66}{space 4}-.3301569{col 79}{space 3}-.0904487
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.1812183{col 38}{space 2} .1113407{col 49}{space 1}   -1.63{col 58}{space 3}0.104{col 66}{space 4}-.3994421{col 79}{space 3} .0370055
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-.1176064{col 38}{space 2} .1175847{col 49}{space 1}   -1.00{col 58}{space 3}0.317{col 66}{space 4}-.3480683{col 79}{space 3} .1128554
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.2274668{col 38}{space 2} .1065283{col 49}{space 1}   -2.14{col 58}{space 3}0.033{col 66}{space 4}-.4362584{col 79}{space 3}-.0186751
{txt}{space 24} {c |}
{space 17}recloan {c |}{col 26}{res}{space 2}-.0652084{col 38}{space 2} .4725152{col 49}{space 1}   -0.14{col 58}{space 3}0.890{col 66}{space 4}-.9913212{col 79}{space 3} .8609044
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.9192035{col 38}{space 2} .1292694{col 49}{space 1}   -7.11{col 58}{space 3}0.000{col 66}{space 4}-1.172567{col 79}{space 3}-.6658402
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2}-.0144158{col 38}{space 2} .3467456{col 49}{space 1}   -0.04{col 58}{space 3}0.967{col 66}{space 4}-.6940246{col 79}{space 3} .6651931
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.379867{col 38}{space 2} .0126088{col 49}{space 1}  664.60{col 58}{space 3}0.000{col 66}{space 4} 8.355154{col 79}{space 3} 8.404579
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2}-.0144148{col 38}{space 2} .3466735{col 66}{space 4}-.6005612{col 79}{space 3}  .581809
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2} 4358.427{col 38}{space 2} 54.95466{col 66}{space 4} 4252.038{col 79}{space 3} 4467.478
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 42}Instrumented:{space 2}loan{p_end}
{p 0 15 42}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region recloan cohort parInc{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    0.00{txt}{col 59}Prob > chi2 = {res}0.9668
{txt}
{com}. 
. //Tobit estimator
. tobit loan year cohort parInc i.race i.sex i.region if !missing(recloan), ll
{res}
{txt}Tobit regression{col 51}Number of obs{col 67}= {res}      3145
{txt}{col 51}LR chi2({res}9{txt}){col 67}= {res}    113.67
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-14658.797{txt}{col 51}Pseudo R2{col 67}= {res}    0.0039

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2} 281.2354{col 38}{space 2} 120.8614{col 49}{space 1}    2.33{col 58}{space 3}0.020{col 66}{space 4} 44.25995{col 79}{space 3} 518.2109
{txt}{space 18}cohort {c |}{col 26}{res}{space 2} 920.2015{col 38}{space 2}  664.815{col 49}{space 1}    1.38{col 58}{space 3}0.166{col 66}{space 4} -383.315{col 79}{space 3} 2223.718
{txt}{space 18}parInc {c |}{col 26}{res}{space 2} -.003318{col 38}{space 2} .0033398{col 49}{space 1}   -0.99{col 58}{space 3}0.321{col 66}{space 4}-.0098663{col 79}{space 3} .0032304
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 2496.237{col 38}{space 2} 633.3165{col 49}{space 1}    3.94{col 58}{space 3}0.000{col 66}{space 4}  1254.48{col 79}{space 3} 3737.993
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 2011.988{col 38}{space 2} 597.2117{col 49}{space 1}    3.37{col 58}{space 3}0.001{col 66}{space 4} 841.0228{col 79}{space 3} 3182.953
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}  464.768{col 38}{space 2} 426.6227{col 49}{space 1}    1.09{col 58}{space 3}0.276{col 66}{space 4}  -371.72{col 79}{space 3} 1301.256
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2} -447.974{col 38}{space 2} 715.9442{col 49}{space 1}   -0.63{col 58}{space 3}0.532{col 66}{space 4}-1851.741{col 79}{space 3} 955.7927
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-3426.814{col 38}{space 2} 695.4348{col 49}{space 1}   -4.93{col 58}{space 3}0.000{col 66}{space 4}-4790.368{col 79}{space 3}-2063.261
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-3626.961{col 38}{space 2} 788.9543{col 49}{space 1}   -4.60{col 58}{space 3}0.000{col 66}{space 4} -5173.88{col 79}{space 3}-2080.042
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-4254.088{col 38}{space 2} 977.6596{col 49}{space 1}   -4.35{col 58}{space 3}0.000{col 66}{space 4}-6171.005{col 79}{space 3} -2337.17
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                  /sigma {c |}{col 26}{res}{space 2} 9865.395{col 38}{space 2} 215.4328{col 66}{space 4} 9442.991{col 79}{space 3}  10287.8
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Obs. summary:{col 18}{res}     1862{col 28}{txt} left-censored observations at loan<={res}0
{txt}{col 18}{res}     1283{col 28}{txt}    uncensored observations
{col 18}{res}        0{col 28}{txt}right-censored observations

{com}. //Get predicted tobit values
. predict loanHat if !missing(recloan) & !missing(loan), ystar(0, .)
{txt}(12705 missing values generated)

{com}. 
. reg loan year cohort parInc i.race i.sex i.region

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}    3145
{txt}{hline 13}{char +}{hline 30}           F(  9,  3135) ={res}   11.36
    {txt}   Model {char |} {res} 2.7980e+09     9   310893209           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 8.5766e+10  3135    27357430           {txt}R-squared     = {res} 0.0316
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0288
    {txt}   Total {char |} {res} 8.8564e+10  3144  28169078.3           {txt}Root MSE      = {res} 5230.4

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2} 150.1164{col 38}{space 2} 54.12588{col 49}{space 1}    2.77{col 58}{space 3}0.006{col 66}{space 4} 43.99062{col 79}{space 3} 256.2421
{txt}{space 18}cohort {c |}{col 26}{res}{space 2} 565.0713{col 38}{space 2} 302.6834{col 49}{space 1}    1.87{col 58}{space 3}0.062{col 66}{space 4}-28.40642{col 79}{space 3} 1158.549
{txt}{space 18}parInc {c |}{col 26}{res}{space 2} .0021252{col 38}{space 2} .0014506{col 49}{space 1}    1.46{col 58}{space 3}0.143{col 66}{space 4}-.0007191{col 79}{space 3} .0049695
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 823.5849{col 38}{space 2} 281.7086{col 49}{space 1}    2.92{col 58}{space 3}0.003{col 66}{space 4}  271.233{col 79}{space 3} 1375.937
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 791.9652{col 38}{space 2} 262.8285{col 49}{space 1}    3.01{col 58}{space 3}0.003{col 66}{space 4} 276.6318{col 79}{space 3} 1307.299
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-15.22861{col 38}{space 2} 192.8794{col 49}{space 1}   -0.08{col 58}{space 3}0.937{col 66}{space 4}-393.4113{col 79}{space 3} 362.9541
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-537.4654{col 38}{space 2} 340.0582{col 49}{space 1}   -1.58{col 58}{space 3}0.114{col 66}{space 4}-1204.225{col 79}{space 3} 129.2937
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-1623.935{col 38}{space 2} 323.9739{col 49}{space 1}   -5.01{col 58}{space 3}0.000{col 66}{space 4}-2259.158{col 79}{space 3}-988.7129
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-1259.494{col 38}{space 2}   358.91{col 49}{space 1}   -3.51{col 58}{space 3}0.000{col 66}{space 4}-1963.216{col 79}{space 3}-555.7715
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}  1812.74{col 38}{space 2} 435.7105{col 49}{space 1}    4.16{col 58}{space 3}0.000{col 66}{space 4} 958.4335{col 79}{space 3} 2667.047
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. //Use fitted tobit values as an instrument
. ivprobit busMaj year i.race i.sex i.region (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1666.8613}  
Iteration 1:{space 3}log likelihood = {res:-1651.5415}  
Iteration 2:{space 3}log likelihood = {res:-1651.5198}  
Iteration 3:{space 3}log likelihood = {res:-1651.5198}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-32689.956}  (not concave)
Iteration 1:{space 3}log likelihood = {res:-32689.122}  (backed up)
Iteration 2:{space 3}log likelihood = {res:-32688.596}  (not concave)
Iteration 3:{space 3}log likelihood = {res: -32688.59}  
Iteration 4:{space 3}log likelihood = {res:-32688.519}  
Iteration 5:{space 3}log likelihood = {res:-32688.359}  
Iteration 6:{space 3}log likelihood = {res:-32688.302}  
Iteration 7:{space 3}log likelihood = {res:-32688.201}  (not concave)
Iteration 8:{space 3}log likelihood = {res:-32688.188}  (not concave)
Iteration 9:{space 3}log likelihood = {res:-32688.187}  
Iteration 10:{space 2}log likelihood = {res:-32688.156}  
Iteration 11:{space 2}log likelihood = {res:-32688.131}  
Iteration 12:{space 2}log likelihood = {res:  -32688.1}  (not concave)
Iteration 13:{space 2}log likelihood = {res:-32688.097}  
Iteration 14:{space 2}log likelihood = {res: -32688.09}  
Iteration 15:{space 2}log likelihood = {res:-32688.085}  
Iteration 16:{space 2}log likelihood = {res:-32688.084}  
Iteration 17:{space 2}log likelihood = {res:-32688.084}  
Iteration 18:{space 2}log likelihood = {res:-32688.084}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}      3145
{txt}{col 51}Wald chi2({res}8{txt}){col 67}= {res}    100.02
{txt}Log likelihood = {res}-32688.084{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2}-.0001442{col 38}{space 2} .0000722{col 49}{space 1}   -2.00{col 58}{space 3}0.046{col 66}{space 4}-.0002857{col 79}{space 3}-2.74e-06
{txt}{space 20}year {c |}{col 26}{res}{space 2} .0506474{col 38}{space 2} .0108589{col 49}{space 1}    4.66{col 58}{space 3}0.000{col 66}{space 4} .0293644{col 79}{space 3} .0719304
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} .1913637{col 38}{space 2} .0686766{col 49}{space 1}    2.79{col 58}{space 3}0.005{col 66}{space 4}   .05676{col 79}{space 3} .3259674
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} .1010409{col 38}{space 2} .0983403{col 49}{space 1}    1.03{col 58}{space 3}0.304{col 66}{space 4}-.0917026{col 79}{space 3} .2937843
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-.1481598{col 38}{space 2} .0995831{col 49}{space 1}   -1.49{col 58}{space 3}0.137{col 66}{space 4}-.3433391{col 79}{space 3} .0470194
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.2009814{col 38}{space 2} .0903351{col 49}{space 1}   -2.22{col 58}{space 3}0.026{col 66}{space 4} -.378035{col 79}{space 3}-.0239278
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-.3087153{col 38}{space 2}  .102476{col 49}{space 1}   -3.01{col 58}{space 3}0.003{col 66}{space 4}-.5095646{col 79}{space 3}-.1078659
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.3269793{col 38}{space 2} .0864025{col 49}{space 1}   -3.78{col 58}{space 3}0.000{col 66}{space 4}-.4963249{col 79}{space 3}-.1576336
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-.3855389{col 38}{space 2} .5313809{col 49}{space 1}   -0.73{col 58}{space 3}0.468{col 66}{space 4}-1.427026{col 79}{space 3} .6559486
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2}  .955841{col 38}{space 2} .8563506{col 49}{space 1}    1.12{col 58}{space 3}0.264{col 66}{space 4}-.7225753{col 79}{space 3} 2.634257
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.561204{col 38}{space 2} .0126088{col 49}{space 1}  678.99{col 58}{space 3}0.000{col 66}{space 4} 8.536491{col 79}{space 3} 8.585917
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2}  .742416{col 38}{space 2}  .384346{col 66}{space 4} -.618502{col 79}{space 3} .9897503
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2} 5224.969{col 38}{space 2} 65.88072{col 66}{space 4} 5097.428{col 79}{space 3} 5355.701
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 42}Instrumented:{space 2}loan{p_end}
{p 0 15 42}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region loanHat{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    1.25{txt}{col 59}Prob > chi2 = {res}0.2643
{txt}
{com}. 
. probit artMaj year loanHat i.race i.sex i.region if !missing(recloan)

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-289.06318}  
Iteration 1:{space 3}log likelihood = {res:-284.76732}  
Iteration 2:{space 3}log likelihood = {res:-284.69826}  
Iteration 3:{space 3}log likelihood = {res:-284.69823}  
Iteration 4:{space 3}log likelihood = {res:-284.69823}  
{res}
{txt}Probit regression{col 51}Number of obs{col 67}= {res}      3145
{txt}{col 51}LR chi2({res}8{txt}){col 67}= {res}      8.73
{txt}{col 51}Prob > chi2{col 67}= {res}    0.3656
{txt}Log likelihood = {res}-284.69823{txt}{col 51}Pseudo R2{col 67}= {res}    0.0151

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                  artMaj{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2} .0939864{col 38}{space 2} .0506301{col 49}{space 1}    1.86{col 58}{space 3}0.063{col 66}{space 4}-.0052468{col 79}{space 3} .1932196
{txt}{space 17}loanHat {c |}{col 26}{res}{space 2}-.0004704{col 38}{space 2} .0003041{col 49}{space 1}   -1.55{col 58}{space 3}0.122{col 66}{space 4}-.0010664{col 79}{space 3} .0001256
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2}  .154671{col 38}{space 2} .3196307{col 49}{space 1}    0.48{col 58}{space 3}0.628{col 66}{space 4}-.4717937{col 79}{space 3} .7811357
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} .2365897{col 38}{space 2} .2426679{col 49}{space 1}    0.97{col 58}{space 3}0.330{col 66}{space 4}-.2390306{col 79}{space 3} .7122101
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} .1263816{col 38}{space 2} .1223109{col 49}{space 1}    1.03{col 58}{space 3}0.301{col 66}{space 4}-.1133433{col 79}{space 3} .3661066
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.0621967{col 38}{space 2} .2031984{col 49}{space 1}   -0.31{col 58}{space 3}0.760{col 66}{space 4}-.4604583{col 79}{space 3} .3360649
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-.6334096{col 38}{space 2} .4512833{col 49}{space 1}   -1.40{col 58}{space 3}0.160{col 66}{space 4}-1.517909{col 79}{space 3} .2510894
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.5569371{col 38}{space 2} .4665478{col 49}{space 1}   -1.19{col 58}{space 3}0.233{col 66}{space 4}-1.471354{col 79}{space 3} .3574798
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-1.167799{col 38}{space 2}  .680552{col 49}{space 1}   -1.72{col 58}{space 3}0.086{col 66}{space 4}-2.501656{col 79}{space 3} .1660585
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. probit eduMaj year loanHat i.race i.sex i.region if !missing(recloan)

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-901.89933}  
Iteration 1:{space 3}log likelihood = {res:-853.45151}  
Iteration 2:{space 3}log likelihood = {res:-852.31579}  
Iteration 3:{space 3}log likelihood = {res:-852.31523}  
Iteration 4:{space 3}log likelihood = {res:-852.31523}  
{res}
{txt}Probit regression{col 51}Number of obs{col 67}= {res}      3145
{txt}{col 51}LR chi2({res}8{txt}){col 67}= {res}     99.17
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-852.31523{txt}{col 51}Pseudo R2{col 67}= {res}    0.0550

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                  eduMaj{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2} -.008583{col 38}{space 2} .0317564{col 49}{space 1}   -0.27{col 58}{space 3}0.787{col 66}{space 4}-.0708244{col 79}{space 3} .0536585
{txt}{space 17}loanHat {c |}{col 26}{res}{space 2}  .000036{col 38}{space 2} .0001933{col 49}{space 1}    0.19{col 58}{space 3}0.852{col 66}{space 4}-.0003428{col 79}{space 3} .0004148
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2}-.2118547{col 38}{space 2} .2042512{col 49}{space 1}   -1.04{col 58}{space 3}0.300{col 66}{space 4}-.6121796{col 79}{space 3} .1884702
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} .1394749{col 38}{space 2} .1590905{col 49}{space 1}    0.88{col 58}{space 3}0.381{col 66}{space 4}-.1723367{col 79}{space 3} .4512865
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} .6626157{col 38}{space 2} .0845094{col 49}{space 1}    7.84{col 58}{space 3}0.000{col 66}{space 4} .4969803{col 79}{space 3} .8282512
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}  .041608{col 38}{space 2} .1242672{col 49}{space 1}    0.33{col 58}{space 3}0.738{col 66}{space 4}-.2019512{col 79}{space 3} .2851671
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2} .0880534{col 38}{space 2} .2925436{col 49}{space 1}    0.30{col 58}{space 3}0.763{col 66}{space 4}-.4853215{col 79}{space 3} .6614282
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.0913298{col 38}{space 2} .3041237{col 49}{space 1}   -0.30{col 58}{space 3}0.764{col 66}{space 4}-.6874013{col 79}{space 3} .5047417
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-1.936843{col 38}{space 2} .4429682{col 49}{space 1}   -4.37{col 58}{space 3}0.000{col 66}{space 4}-2.805045{col 79}{space 3}-1.068641
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. probit  csMaj year loanHat i.race i.sex i.region if !missing(recloan)

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-244.20786}  
Iteration 1:{space 3}log likelihood = {res:-222.55452}  
Iteration 2:{space 3}log likelihood = {res:-220.31354}  
Iteration 3:{space 3}log likelihood = {res:-220.29135}  
Iteration 4:{space 3}log likelihood = {res:-220.29133}  
{res}
{txt}Probit regression{col 51}Number of obs{col 67}= {res}      3145
{txt}{col 51}LR chi2({res}8{txt}){col 67}= {res}     47.83
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-220.29133{txt}{col 51}Pseudo R2{col 67}= {res}    0.0979

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                   csMaj{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2} .0750121{col 38}{space 2} .0578727{col 49}{space 1}    1.30{col 58}{space 3}0.195{col 66}{space 4}-.0384163{col 79}{space 3} .1884405
{txt}{space 17}loanHat {c |}{col 26}{res}{space 2} -.000309{col 38}{space 2} .0003483{col 49}{space 1}   -0.89{col 58}{space 3}0.375{col 66}{space 4}-.0009916{col 79}{space 3} .0003736
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2}  .009746{col 38}{space 2}  .380951{col 49}{space 1}    0.03{col 58}{space 3}0.980{col 66}{space 4}-.7369042{col 79}{space 3} .7563962
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2}  .482427{col 38}{space 2} .2745891{col 49}{space 1}    1.76{col 58}{space 3}0.079{col 66}{space 4}-.0557578{col 79}{space 3} 1.020612
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-.4964651{col 38}{space 2} .1429817{col 49}{space 1}   -3.47{col 58}{space 3}0.001{col 66}{space 4}-.7767041{col 79}{space 3} -.216226
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.6005901{col 38}{space 2}  .207832{col 49}{space 1}   -2.89{col 58}{space 3}0.004{col 66}{space 4}-1.007933{col 79}{space 3}-.1932469
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-.7828584{col 38}{space 2} .5099625{col 49}{space 1}   -1.54{col 58}{space 3}0.125{col 66}{space 4}-1.782366{col 79}{space 3} .2166497
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2} -.498504{col 38}{space 2} .5230774{col 49}{space 1}   -0.95{col 58}{space 3}0.341{col 66}{space 4}-1.523717{col 79}{space 3} .5267089
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-1.266458{col 38}{space 2} .7831706{col 49}{space 1}   -1.62{col 58}{space 3}0.106{col 66}{space 4}-2.801444{col 79}{space 3} .2685286
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
{txt}end of do-file

{com}. 