{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\gmoore\Desktop\honors\master\master.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Feb 2019, 10:10:37
{txt}
{com}. 
. set more off
{txt}
{com}. 
. cd ../NLSY79ParentData
{res}C:\Users\gmoore\Desktop\honors\NLSY79ParentData
{txt}
{com}. do ParImport
{txt}
{com}. import delimited parInc.csv, clear case(preserve)
{res}{text}(12 vars, 12686 obs)
{com}. 
. 
. //Code Stata missings
. rename R7006500 parInc0
{res}{txt}
{com}. rename R7703700 parInc2
{res}{txt}
{com}. rename R8496100 parInc4
{res}{txt}
{com}. rename T0987800 parInc6
{res}{txt}
{com}. rename T2210000 parInc8
{res}{txt}
{com}. rename T3107800 parInc10
{res}{txt}
{com}. rename T4112300 parInc12 
{res}{txt}
{com}. rename T5022600 parInc14 
{res}{txt}
{com}. rename R0000100 mid
{res}{txt}
{com}. 
. keep parInc* mid
{txt}
{com}. 
. reshape long parInc, i(mid) j(year)
{txt}(note: j = 0 2 4 6 8 10 12 14)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}   12686   {txt}->{res}  101488
{txt}Number of variables            {res}       9   {txt}->{res}       3
{txt}j variable (8 values)                     ->   {res}year
{txt}xij variables:
           {res}parInc0 parInc2 ... parInc14   {txt}->   {res}parInc
{txt}{hline 77}

{com}. replace parInc = . if parInc < 0
{txt}(49007 real changes made, 49007 to missing)

{com}. sort mid year
{txt}
{com}. 
{txt}end of do-file

{com}. 
. tempfile parInc
{txt}
{com}. save `parInc'
{txt}file C:\Users\gmoore\AppData\Local\Temp\ST_00000001.tmp saved

{com}. 
. cd ../NLSYChild79Data
{res}C:\Users\gmoore\Desktop\honors\NLSYChild79Data
{txt}
{com}. do Import
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
  Y2633101 "DATE OF CAPI INTERVIEW-MONTH 2012"
  Y2633102 "DATE OF CAPI INTERVIEW-YEAR 2012"
  Y2673200 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2012"
  Y2691100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2012"
  Y2692100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2012"
  Y2692200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2012"
  Y2967200 "REGION OF RESIDENCE 2012"
  Y2990501 "DATE OF CAPI INTERVIEW-MONTH 2014"
  Y2990502 "DATE OF CAPI INTERVIEW-YEAR 2014"
  Y3029600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2014"
  Y3046600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2014"
  Y3047600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2014"
  Y3047700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2014"
  Y3332700 "REGION OF RESIDENCE 2014"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. rename Y2673200 grade12
{res}{txt}
{com}. rename Y3029600 grade14
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. rename Y2691100 maj12
{res}{txt}
{com}. rename Y3046600 maj14
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. label define vlY3046600   0 "NONE, NO MAJOR DECLARED YET"  54 "ACCOUNTING"  1 "AGRICULTURE/NATURAL RESOURCES"  34 "ANIMAL SCIENCE"  2 "ANTHROPOLOGY"  60 "APPLIED SCIENCES"  65 "APPLIED TECHNOLOGY (ELECTRICAL, HVAC, INDUSTRIAL MAINTENANCE, ETC.)"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  64 "AUTOMOTIVE/DIESEL TECHNOLOGY"  35 "BIOLOGY"  36 "BIOCHEMISTRY/PHYSIOLOGY/BIOMEDICAL SCIENCE"  7 "BUSINESS"  37 "CHEMISTRY"  39 "COGNITIVE SCIENCE/NEUROSCIENCE"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE/INFORMATION TECHNOLOGY"  38 "COSOMETOLOGY/AESTHETICS"  73 "COUNSELING"  10 "CRIMINOLOGY/CRIMINAL JUSTICE"  40 "CULINARY ARTS"  41 "DENTAL ASSISTANT"  11 "ECONOMICS"  12 "EDUCATION"  74 "EMERGENCY MEDICAL TECHNOLOGY"  13 "ENGINEERING"  14 "ENGLISH"  67 "ENVIRONMENTAL SCIENCES"  42 "FINANCE"  15 "FINE AND APPLIED ARTS/ART HISTORY"  16 "FOREIGN LANGUAGES"  75 "GENERAL EDUCATION"  43 "GENERAL STUDIES/LIBERAL ARTS"  56 "GEOGRAPHY"  44 "GRAPHIC DESIGN"  71 "HEALTH SCIENCES"  45 "HEALTHCARE ADMINISTRATION"  17 "HISTORY"  59 "HOSPITALITY/HOTEL MANAGEMENT"  18 "HUMAN ECOLOGY/HOME ECONOMICS"  46 "HUMAN RESOURCES"  19 "INTERDISCIPLINARY STUDIES"  55 "JOURNALISM/MEDIA STUDIES"  68 "KINESIOLOGY/SPORTS SCIENCE"  47 "MARKETING/ADVERTISING"  20 "MATHEMATICS"  48 "MEDICAL ASSISTANT"  72 "MEDICAL TECHNOLOGY"  49 "MUSIC"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  52 "OTHER SCIENCE"  62 "PARALEGAL STUDIES"  50 "PHARMACY/PRE-PHARMACY"  23 "PHILOSOPHY"  70 "PHYSICAL/OCCUPATIONAL THERAPY"  51 "PHYSICS"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  63 "PUBLIC HEALTH/HUMAN SERVIES"  61 "PUBLIC POLICY/ADMINISTRATION"  58 "PUBLIC SAFETY"  57 "SECURITY/EMERGENCY MANAGEMENT"  32 "SOCIAL WORK"  31 "SOCIOLOGY"  53 "THEATRE/ MUSICAL THEATRE/DANCE"  33 "THEOLOGY/RELIGIOUS STUDIES"  69 "VETERINARY TECHNOLOGY"  66 "WELDING"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. //Recoded majors in 2014
. label values maj14 vlY3046600
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. rename Y2692100 recloan12
{res}{txt}
{com}. rename Y3047600 recloan14
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. rename Y2967200 region12
{res}{txt}
{com}. rename Y3332700 region14
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. rename Y2692200 loan12
{res}{txt}
{com}. rename Y3047700 loan14
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. //gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
. gen intDate0 = ym(Y1180502, Y1180501)
{txt}(8496 missing values generated)

{com}. //gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
. gen intDate2 = ym(Y1421102, Y1421101)
{txt}(7283 missing values generated)

{com}. //gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
. gen intDate4 = ym(Y1450202, Y1450201)
{txt}(6497 missing values generated)

{com}. //gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
. gen intDate6 = ym(Y1695602, Y1695601)
{txt}(5677 missing values generated)

{com}. //gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
. gen intDate8 = ym(Y1981602, Y1981601) 
{txt}(5216 missing values generated)

{com}. //gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
. gen intDate10 = ym(Y2300402, Y2300401)
{txt}(5419 missing values generated)

{com}. 
. gen intDate12 = ym(Y2633102, Y2633101)
{txt}(5713 missing values generated)

{com}. gen intDate14 = ym(Y2990502, Y2990501)
{txt}(5786 missing values generated)

{com}. format intDate* %tm
{txt}
{com}. drop Y1* Y2*
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10 12 14)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   25360
{txt}Number of variables            {res}      53   {txt}->{res}      12
{txt}j variable (8 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj14   {txt}->   {res}maj
        recloan0 recloan2 ... recloan14   {txt}->   {res}recloan
                 loan0 loan2 ... loan14   {txt}->   {res}loan
           region0 region2 ... region14   {txt}->   {res}region
              grade0 grade2 ... grade14   {txt}->   {res}grade
        intDate0 intDate2 ... intDate14   {txt}->   {res}intDate
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(16163 real changes made, 16163 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3607 real changes made)

{com}. replace loan = . if loan < 0
{txt}(19063 real changes made, 19063 to missing)

{com}. replace region = . if region < 0
{txt}(6388 real changes made, 6388 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(5257 real changes made, 5257 to missing)

{com}. replace grade = . if grade < 0
{txt}(14783 real changes made, 14783 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. replace polImpact = 1000 if  ((grade == 14 & inrange(intDate, ym(2007, 8), ym(2008, 8))) | ///
>          (grade == 15 & inrange(intDate, ym(2008, 8), ym(2009, 8))) | ///
>          (grade == 16 & inrange(intDate, ym(2009, 8), ym(2010, 8))) | ///
>          (grade == 17 & inrange(intDate, ym(2010, 8), ym(2011, 8))))
{txt}(538 real changes made)

{com}. 
. //Students who enter school after the policy change get full impact
. replace polImpact = 1875 if  ((grade == 13 & intDate > ym(2007, 8)) | ///
>          (grade == 14 & intDate > ym(2008, 8)) | ///
>          (grade == 15 & intDate > ym(2009, 8)) | ///
>          (grade == 16 & intDate > ym(2010, 8)) | ///
>          (grade == 17 & intDate > ym(2011, 8)))
{txt}(2541 real changes made)

{com}.         
. 
. //Places majors into bins
. gen majType = .
{txt}(25360 missing values generated)

{com}. //Humanities: Area Studies (5) English (14) Art (15) Language (16) History (17)
. //              Interdisciplinary Studies (19) Philosophy (23) Theology (33)
. replace majType = 0 if inlist(maj, 5, 14, 15, 16, 17, 19, 23, 33)
{txt}(525 real changes made)

{com}. //STEM: Agriculture (1) Architecture (4) Biology (6) CS(9) Engineering (13) 
. //              Math (20) Physics (24)
. replace majType = 1 if inlist(maj, 1, 4, 6, 9, 13, 20, 24)
{txt}(1413 real changes made)

{com}. //Social Science: Anthropology(2) Archaeology (3) Economics (11) Home Ec (18)
. //              Political Science (25) Psychology (30) Sociology (31)
. replace majType = 2 if inlist(maj, 2, 3, 11, 18, 25, 30, 31)
{txt}(703 real changes made)

{com}. //Professional: Communications (8) Criminology (10) Education (12)
. //              Nursing (21) Other Health (22) Pre-Dental/Law/Med/Vet (26-29)
. //              Social Work (32)
. replace majType = 3 if inlist(maj, 7, 8, 10, 12, 21, 22, 26, 27, 28, 29, 32)
{txt}(4461 real changes made)

{com}. //Business: Business (7)
. replace majType = 4 if maj == 7
{txt}(1412 real changes made)

{com}. 
. 
. 
. //assert missing(majType) == missing(maj) | maj == 0 | maj == 99
. 
. label values majType majTypeLab
{txt}
{com}. 
. gen fallSemester = halfyear(dofm(intDate)) - 1
{txt}(6257 missing values generated)

{com}. 
. keep if grade == 16
{txt}(24410 observations deleted)

{com}. 
. 
. 
{txt}end of do-file

{com}. 
. //Need many:one due to siblings
. //Assertion guarantees all children have parental incomes
. //Drop those women without children in college
. merge m:1 mid year using `parInc', assert(match using) nogen keep(match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             950{txt}  
{col 5}{hline 41}

{com}. 
. //keep if parInc < 50000
. 
. cd ../Tables/Code
{res}C:\Users\gmoore\Desktop\honors\Tables\Code
{txt}
{com}. do tables
{txt}
{com}. /*
> Makes tables
> */
. 
. //Creates table in Stata window
. tabulate year, sum(loan)

            {txt}{c |}           Summary of loan
       year {c |}        Mean   Std. Dev.       Freq.
{hline 12}{c +}{hline 36}
          0 {c |}  {res}      2075   2235.5508          41
  {txt}        2 {c |}  {res} 1792.4528   2799.0966          53
  {txt}        4 {c |}  {res} 3280.9223   3787.2914         103
  {txt}        6 {c |}  {res}      3050   4009.3002         128
  {txt}        8 {c |}  {res} 4512.2727   8653.2247         165
  {txt}       10 {c |}  {res}   4025.78   7018.3489         200
  {txt}       12 {c |}  {res} 4803.7189   6921.8627         185
  {txt}       14 {c |}  {res} 16592.263   19401.333          19
{txt}{hline 12}{c +}{hline 36}
      Total {c |}  {res} 4096.2327   7140.5421         894
{txt}
{com}. //Writes table to loanStats.tex
. quietly tabout year using ../Output/loanStats.tex, ///
>         style(tex) ///Forces tex output
>         sum c(mean loan sd loan count loan) ///Marks as summary table (two-way)
>         replace //Replaces previous version
{txt}
{com}. 
. //Creates table in Stata window
. tabulate sex race

           {txt}{c |}   RACE OF CHILD (FROM MOTHERS
    SEX OF {c |}           SCREENER 79)
     CHILD {c |}  HISPANIC      BLACK  NON-BLACK {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
      MALE {c |}{res}        63         89        244 {txt}{c |}{res}       396 
{txt}    FEMALE {c |}{res}        92        166        296 {txt}{c |}{res}       554 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}       155        255        540 {txt}{c |}{res}       950 

{txt}
{com}. quietly tabout sex race using ../Output/raceStats.tex, ///
>         sum c(mean recloan mean loan sd loan count loan) ///
>         style(tex) replace
{txt}
{com}. 
. //Distribution of income
. hist parInc, freq graphregion(color(white))
{txt}(bin={res}27{txt}, start={res}0{txt}, width={res}22073.556{txt})
{res}{txt}
{com}. graph export ../Output/parIncHist.eps, replace
{txt}(file ../Output/parIncHist.eps written in EPS format)

{com}. graph export ../Output/parIncHist.png, replace
{txt}(file ../Output/parIncHist.png written in PNG format)

{com}. 
. //Student debt
. hist loan if recloan & !missing(recloan), freq graphregion(color(white))
{txt}(bin={res}21{txt}, start={res}200{txt}, width={res}3800{txt})
{res}{txt}
{com}. graph export ../Output/loanHist.eps, replace
{txt}(file ../Output/loanHist.eps written in EPS format)

{com}. graph export ../Output/loanHist.png, replace
{txt}(file ../Output/loanHist.png written in PNG format)

{com}. 
. //Student debt
. tabulate region

       {txt}region {c |}      Freq.     Percent        Cum.
{hline 14}{c +}{hline 35}
    NORTHEAST {c |}{res}        131       13.88       13.88
{txt}NORTH CENTRAL {c |}{res}        278       29.45       43.33
{txt}        SOUTH {c |}{res}        376       39.83       83.16
{txt}         WEST {c |}{res}        159       16.84      100.00
{txt}{hline 14}{c +}{hline 35}
        Total {c |}{res}        944      100.00
{txt}
{com}. quietly tabout region using ../Output/regionStats.tex, ///
>         style(tex) replace 
{txt}
{com}. 
. //Major frequency
. graph pie, over(majType) plabel(_all sum) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majPie.png, replace
{txt}(file ../Output/majPie.png written in PNG format)

{com}. 
. //Debt distribution by major
. graph box loan if recloan & !missing(recloan), over(majType) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/DebtbyMajType.png, replace
{txt}(file ../Output/DebtbyMajType.png written in PNG format)

{com}. graph box loan if recloan & !missing(recloan), over(majType) noout graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/DebtbyMajTypeNoOut.png, replace
{txt}(file ../Output/DebtbyMajTypeNoOut.png written in PNG format)

{com}. 
{txt}end of do-file

{com}. 
. cd ../../Regressions/Code
{res}C:\Users\gmoore\Desktop\honors\Regressions\Code
{txt}
{com}. do regs
{txt}
{com}. //Calculates log of loans
. gen lloan = ln(loan)
{txt}(471 missing values generated)

{com}. 
. //Dummies for each major
. gen busMaj = maj == 7
{txt}
{com}. gen artMaj = maj == 15
{txt}
{com}. gen eduMaj = maj == 12
{txt}
{com}. gen  csMaj = maj == 17
{txt}
{com}. 
. 
. 
. //Linear estimator
. reg loan year cohort parInc i.race i.sex i.region

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     704
{txt}{hline 13}{char +}{hline 30}           F(  9,   694) ={res}    2.95
    {txt}   Model {char |} {res} 1.3924e+09     9   154709590           {txt}Prob > F      = {res} 0.0019
    {txt}Residual {char |} {res} 3.6348e+10   694  52374345.9           {txt}R-squared     = {res} 0.0369
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0244
    {txt}   Total {char |} {res} 3.7740e+10   703  53684469.9           {txt}Root MSE      = {res}   7237

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2} 427.6226{col 38}{space 2} 150.3522{col 49}{space 1}    2.84{col 58}{space 3}0.005{col 66}{space 4} 132.4229{col 79}{space 3} 722.8224
{txt}{space 18}cohort {c |}{col 26}{res}{space 2}-436.2191{col 38}{space 2} 1087.355{col 49}{space 1}   -0.40{col 58}{space 3}0.688{col 66}{space 4}-2571.118{col 79}{space 3}  1698.68
{txt}{space 18}parInc {c |}{col 26}{res}{space 2}-.0048162{col 38}{space 2} .0035414{col 49}{space 1}   -1.36{col 58}{space 3}0.174{col 66}{space 4}-.0117693{col 79}{space 3} .0021369
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 496.2341{col 38}{space 2} 921.8474{col 49}{space 1}    0.54{col 58}{space 3}0.591{col 66}{space 4} -1313.71{col 79}{space 3} 2306.178
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 447.5181{col 38}{space 2} 805.0819{col 49}{space 1}    0.56{col 58}{space 3}0.578{col 66}{space 4} -1133.17{col 79}{space 3} 2028.206
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} 762.9641{col 38}{space 2} 557.8661{col 49}{space 1}    1.37{col 58}{space 3}0.172{col 66}{space 4}-332.3437{col 79}{space 3} 1858.272
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2} 256.2261{col 38}{space 2} 948.3556{col 49}{space 1}    0.27{col 58}{space 3}0.787{col 66}{space 4}-1605.764{col 79}{space 3} 2118.216
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2} 79.01678{col 38}{space 2} 908.2283{col 49}{space 1}    0.09{col 58}{space 3}0.931{col 66}{space 4}-1704.188{col 79}{space 3} 1862.221
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-468.0561{col 38}{space 2} 1039.822{col 49}{space 1}   -0.45{col 58}{space 3}0.653{col 66}{space 4} -2509.63{col 79}{space 3} 1573.518
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 708.5716{col 38}{space 2} 1349.931{col 49}{space 1}    0.52{col 58}{space 3}0.600{col 66}{space 4}-1941.867{col 79}{space 3}  3359.01
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg lloan year cohort parInc i.race i.sex i.region 

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}     394
{txt}{hline 13}{char +}{hline 30}           F(  9,   384) ={res}    5.91
    {txt}   Model {char |} {res} 31.1457368     9  3.46063742           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 224.778271   384   .58536008           {txt}R-squared     = {res} 0.1217
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.1011
    {txt}   Total {char |} {res} 255.924008   393  .651206126           {txt}Root MSE      = {res} .76509

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                   lloan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2} .0480726{col 38}{space 2}  .021494{col 49}{space 1}    2.24{col 58}{space 3}0.026{col 66}{space 4}  .005812{col 79}{space 3} .0903333
{txt}{space 18}cohort {c |}{col 26}{res}{space 2} .0842282{col 38}{space 2} .1562239{col 49}{space 1}    0.54{col 58}{space 3}0.590{col 66}{space 4}-.2229332{col 79}{space 3} .3913897
{txt}{space 18}parInc {c |}{col 26}{res}{space 2} 2.24e-06{col 38}{space 2} 6.88e-07{col 49}{space 1}    3.25{col 58}{space 3}0.001{col 66}{space 4} 8.85e-07{col 79}{space 3} 3.59e-06
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2}-.1965354{col 38}{space 2} .1331455{col 49}{space 1}   -1.48{col 58}{space 3}0.141{col 66}{space 4}-.4583209{col 79}{space 3} .0652502
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2}-.1164132{col 38}{space 2} .1205627{col 49}{space 1}   -0.97{col 58}{space 3}0.335{col 66}{space 4}-.3534588{col 79}{space 3} .1206324
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} .0565667{col 38}{space 2} .0808659{col 49}{space 1}    0.70{col 58}{space 3}0.485{col 66}{space 4}-.1024287{col 79}{space 3}  .215562
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2} .1020372{col 38}{space 2} .1291312{col 49}{space 1}    0.79{col 58}{space 3}0.430{col 66}{space 4}-.1518555{col 79}{space 3}   .35593
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2} .0369217{col 38}{space 2}  .128682{col 49}{space 1}    0.29{col 58}{space 3}0.774{col 66}{space 4}-.2160878{col 79}{space 3} .2899312
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2} .2065408{col 38}{space 2}  .155072{col 49}{space 1}    1.33{col 58}{space 3}0.184{col 66}{space 4}-.0983557{col 79}{space 3} .5114373
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 8.002882{col 38}{space 2} .2018281{col 49}{space 1}   39.65{col 58}{space 3}0.000{col 66}{space 4} 7.606055{col 79}{space 3} 8.399708
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. gen year2 = year * year
{txt}
{com}. gen parInc2 = parInc * parInc
{txt}(195 missing values generated)

{com}. 
. //First stage
. tobit loan polImpact i.year fallSemester parInc parInc2 i.race i.sex i.region if !missing(recloan) & year >= 6, ll
{res}
{txt}Tobit regression{col 51}Number of obs{col 67}= {res}       555
{txt}{col 51}LR chi2({res}14{txt}){col 67}= {res}     55.92
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-3465.4711{txt}{col 51}Pseudo R2{col 67}= {res}    0.0080

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}polImpact {c |}{col 26}{res}{space 2}-7.069325{col 38}{space 2} 6.919998{col 49}{space 1}   -1.02{col 58}{space 3}0.307{col 66}{space 4}-20.66268{col 79}{space 3} 6.524033
{txt}{space 24} {c |}
{space 20}year {c |}
{space 22}8  {c |}{col 26}{res}{space 2} 1335.742{col 38}{space 2} 1766.521{col 49}{space 1}    0.76{col 58}{space 3}0.450{col 66}{space 4}-2134.339{col 79}{space 3} 4805.824
{txt}{space 21}10  {c |}{col 26}{res}{space 2} 8738.307{col 38}{space 2} 7297.443{col 49}{space 1}    1.20{col 58}{space 3}0.232{col 66}{space 4}-5596.488{col 79}{space 3}  23073.1
{txt}{space 21}12  {c |}{col 26}{res}{space 2} 17981.91{col 38}{space 2}  12972.5{col 49}{space 1}    1.39{col 58}{space 3}0.166{col 66}{space 4}-7500.725{col 79}{space 3} 43464.54
{txt}{space 21}14  {c |}{col 26}{res}{space 2}  33495.7{col 38}{space 2} 13370.15{col 49}{space 1}    2.51{col 58}{space 3}0.013{col 66}{space 4} 7231.935{col 79}{space 3} 59759.47
{txt}{space 24} {c |}
{space 12}fallSemester {c |}{col 26}{res}{space 2}-2491.289{col 38}{space 2} 1435.862{col 49}{space 1}   -1.74{col 58}{space 3}0.083{col 66}{space 4}-5311.837{col 79}{space 3} 329.2599
{txt}{space 18}parInc {c |}{col 26}{res}{space 2}-.0322252{col 38}{space 2} .0169354{col 49}{space 1}   -1.90{col 58}{space 3}0.058{col 66}{space 4}-.0654924{col 79}{space 3}  .001042
{txt}{space 17}parInc2 {c |}{col 26}{res}{space 2} 9.24e-09{col 38}{space 2} 3.82e-08{col 49}{space 1}    0.24{col 58}{space 3}0.809{col 66}{space 4}-6.57e-08{col 79}{space 3} 8.42e-08
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 3294.835{col 38}{space 2} 1903.106{col 49}{space 1}    1.73{col 58}{space 3}0.084{col 66}{space 4}-443.5483{col 79}{space 3} 7033.218
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 1941.416{col 38}{space 2} 1677.671{col 49}{space 1}    1.16{col 58}{space 3}0.248{col 66}{space 4}-1354.131{col 79}{space 3} 5236.963
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} 2138.481{col 38}{space 2} 1136.035{col 49}{space 1}    1.88{col 58}{space 3}0.060{col 66}{space 4}-93.09929{col 79}{space 3} 4370.061
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-269.3083{col 38}{space 2} 1819.951{col 49}{space 1}   -0.15{col 58}{space 3}0.882{col 66}{space 4}-3844.345{col 79}{space 3} 3305.729
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-1817.161{col 38}{space 2} 1795.276{col 49}{space 1}   -1.01{col 58}{space 3}0.312{col 66}{space 4}-5343.727{col 79}{space 3} 1709.405
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-3611.967{col 38}{space 2} 2110.554{col 49}{space 1}   -1.71{col 58}{space 3}0.088{col 66}{space 4}-7757.851{col 79}{space 3}  533.918
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-116.0793{col 38}{space 2} 2698.967{col 49}{space 1}   -0.04{col 58}{space 3}0.966{col 66}{space 4}-5417.819{col 79}{space 3} 5185.661
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                  /sigma {c |}{col 26}{res}{space 2}  11792.9{col 38}{space 2} 514.9891{col 66}{space 4} 10781.28{col 79}{space 3} 12804.53
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Obs. summary:{col 18}{res}      249{col 28}{txt} left-censored observations at loan<={res}0
{txt}{col 18}{res}      306{col 28}{txt}    uncensored observations
{col 18}{res}        0{col 28}{txt}right-censored observations

{com}. 
. //Get predicted tobit values
. predict loanHat if !missing(recloan) & !missing(loan), ystar(0, .)
{txt}(246 missing values generated)

{com}. 
. 
. //Tobit with tailored impact
. tobit loan intDate polImpact parInc i.race i.sex i.region if !missing(recloan), ll
{res}
{txt}Tobit regression{col 51}Number of obs{col 67}= {res}       704
{txt}{col 51}LR chi2({res}9{txt}){col 67}= {res}     38.10
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-4432.3616{txt}{col 51}Pseudo R2{col 67}= {res}    0.0043

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 17}intDate {c |}{col 26}{res}{space 2} 52.24613{col 38}{space 2} 20.72503{col 49}{space 1}    2.52{col 58}{space 3}0.012{col 66}{space 4} 11.55495{col 79}{space 3} 92.93731
{txt}{space 15}polImpact {c |}{col 26}{res}{space 2}-.5786706{col 38}{space 2} 1.132452{col 49}{space 1}   -0.51{col 58}{space 3}0.610{col 66}{space 4}-2.802108{col 79}{space 3} 1.644766
{txt}{space 18}parInc {c |}{col 26}{res}{space 2}-.0237971{col 38}{space 2} .0066802{col 49}{space 1}   -3.56{col 58}{space 3}0.000{col 66}{space 4}-.0369129{col 79}{space 3}-.0106812
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 2337.028{col 38}{space 2} 1532.233{col 49}{space 1}    1.53{col 58}{space 3}0.128{col 66}{space 4} -671.332{col 79}{space 3} 5345.387
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 1230.922{col 38}{space 2} 1354.832{col 49}{space 1}    0.91{col 58}{space 3}0.364{col 66}{space 4}-1429.133{col 79}{space 3} 3890.977
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} 1473.881{col 38}{space 2} 931.2892{col 49}{space 1}    1.58{col 58}{space 3}0.114{col 66}{space 4}-354.5968{col 79}{space 3} 3302.359
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2} 310.0136{col 38}{space 2} 1553.949{col 49}{space 1}    0.20{col 58}{space 3}0.842{col 66}{space 4}-2740.984{col 79}{space 3} 3361.011
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-593.8829{col 38}{space 2} 1499.867{col 49}{space 1}   -0.40{col 58}{space 3}0.692{col 66}{space 4}-3538.697{col 79}{space 3} 2350.931
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2} -2185.26{col 38}{space 2}  1749.39{col 49}{space 1}   -1.25{col 58}{space 3}0.212{col 66}{space 4}-5619.983{col 79}{space 3} 1249.463
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-29126.82{col 38}{space 2} 11530.97{col 49}{space 1}   -2.53{col 58}{space 3}0.012{col 66}{space 4}-51766.52{col 79}{space 3}-6487.111
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                  /sigma {c |}{col 26}{res}{space 2} 10952.32{col 38}{space 2} 421.2707{col 66}{space 4}  10125.2{col 79}{space 3} 11779.43
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Obs. summary:{col 18}{res}      310{col 28}{txt} left-censored observations at loan<={res}0
{txt}{col 18}{res}      394{col 28}{txt}    uncensored observations
{col 18}{res}        0{col 28}{txt}right-censored observations

{com}. 
. 
. 
. //Creates dummies for each type of major
. gen humMajType = majType == 0
{txt}
{com}. gen stemMajType = majType == 1
{txt}
{com}. gen ssMajType = majType == 2
{txt}
{com}. gen profMajType = majType == 3
{txt}
{com}. gen busMajType = majType == 4
{txt}
{com}. 
. //Use fitted tobit values as an instrument
. ivprobit busMajType year i.race i.sex i.region parInc (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-296.54443}  
Iteration 1:{space 3}log likelihood = {res:-292.07408}  
Iteration 2:{space 3}log likelihood = {res: -292.0572}  
Iteration 3:{space 3}log likelihood = {res: -292.0572}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7525.0729}  
Iteration 1:{space 3}log likelihood = {res:-7524.4306}  
Iteration 2:{space 3}log likelihood = {res:-7524.0955}  
Iteration 3:{space 3}log likelihood = {res:-7524.0539}  
Iteration 4:{space 3}log likelihood = {res:-7524.0529}  
Iteration 5:{space 3}log likelihood = {res:-7524.0529}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}       704
{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}     13.12
{txt}Log likelihood = {res}-7524.0529{txt}{col 51}Prob > chi2{col 67}= {res}    0.1574

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2}-.0000562{col 38}{space 2}   .00004{col 49}{space 1}   -1.41{col 58}{space 3}0.160{col 66}{space 4}-.0001346{col 79}{space 3} .0000222
{txt}{space 20}year {c |}{col 26}{res}{space 2} .0061982{col 38}{space 2} .0215329{col 49}{space 1}    0.29{col 58}{space 3}0.773{col 66}{space 4}-.0360055{col 79}{space 3} .0484019
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} .2475053{col 38}{space 2}  .191534{col 49}{space 1}    1.29{col 58}{space 3}0.196{col 66}{space 4}-.1278943{col 79}{space 3}  .622905
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} .1390048{col 38}{space 2} .1696579{col 49}{space 1}    0.82{col 58}{space 3}0.413{col 66}{space 4}-.1935185{col 79}{space 3} .4715282
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-.1467366{col 38}{space 2} .1256649{col 49}{space 1}   -1.17{col 58}{space 3}0.243{col 66}{space 4}-.3930353{col 79}{space 3} .0995621
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.2980136{col 38}{space 2} .1957909{col 49}{space 1}   -1.52{col 58}{space 3}0.128{col 66}{space 4}-.6817568{col 79}{space 3} .0857295
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2} -.100706{col 38}{space 2} .1764903{col 49}{space 1}   -0.57{col 58}{space 3}0.568{col 66}{space 4}-.4466206{col 79}{space 3} .2452086
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.1016006{col 38}{space 2} .2057526{col 49}{space 1}   -0.49{col 58}{space 3}0.621{col 66}{space 4}-.5048682{col 79}{space 3}  .301667
{txt}{space 24} {c |}
{space 18}parInc {c |}{col 26}{res}{space 2}-5.86e-07{col 38}{space 2} 7.46e-07{col 49}{space 1}   -0.79{col 58}{space 3}0.432{col 66}{space 4}-2.05e-06{col 79}{space 3} 8.76e-07
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.6303001{col 38}{space 2} .3139747{col 49}{space 1}   -2.01{col 58}{space 3}0.045{col 66}{space 4}-1.245679{col 79}{space 3}-.0149209
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2} .4624777{col 38}{space 2} .3426635{col 49}{space 1}    1.35{col 58}{space 3}0.177{col 66}{space 4}-.2091304{col 79}{space 3} 1.134086
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.855231{col 38}{space 2} .0266501{col 49}{space 1}  332.28{col 58}{space 3}0.000{col 66}{space 4} 8.802998{col 79}{space 3} 8.907465
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2} .4321015{col 38}{space 2} .2786842{col 66}{space 4} -.206134{col 79}{space 3}  .812413
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2} 7010.971{col 38}{space 2}  186.843{col 66}{space 4} 6654.165{col 79}{space 3} 7386.909
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 40}Instrumented:{space 2}loan{p_end}
{p 0 15 40}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region parInc loanHat{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    1.82{txt}{col 59}Prob > chi2 = {res}0.1771
{txt}
{com}. ivprobit stemMajType year i.race i.sex i.region parInc (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-339.73461}  
Iteration 1:{space 3}log likelihood = {res:-323.21295}  
Iteration 2:{space 3}log likelihood = {res:-323.11466}  
Iteration 3:{space 3}log likelihood = {res:-323.11464}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7556.1304}  
Iteration 1:{space 3}log likelihood = {res:-7555.8167}  
Iteration 2:{space 3}log likelihood = {res:-7555.5562}  
{res}{err}{hline 2}Break{hline 2}
{txt}{search r(1):r(1);}

end of do-file
{err}{hline 2}Break{hline 2}
{txt}{search r(1):r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1):r(1);}

{com}. ls
{txt}  <dir>   2/20/19 10:10  {res}.                 
{txt}  <dir>   2/20/19 10:10  {res}..                
{txt}   0.6k   2/20/19 10:10  {res}master.smcl       
{txt}   1.4k   2/20/19  0:09  {res}regs.do           

{com}. do regs
{txt}
{com}. //Calculates log of loans
. gen lloan = ln(loan)
{err}lloan already defined
{txt}{search r(110):r(110);}

end of do-file

{search r(110):r(110);}

{com}. ksm parInc loan
{res}
{com}. ksm loan parInc
{res}
{com}. ksm loan parInc if parInc < 300000
{res}
{com}. hist loan
{txt}(bin={res}29{txt}, start={res}0{txt}, width={res}2758.6207{txt})
{res}
{com}. ksm loan parInc if parInc < 300000
{res}
{com}. binscatter loan parInc if parInc < 300000
{err}unrecognized command:  binscatter
{txt}{search r(199):r(199);}

{com}. binplot  parInc if parInc < 300000
{err}unrecognized command:  binplot
{txt}{search r(199):r(199);}

{com}. help bin

. ssc install binscatter
{txt}checking {hilite:binscatter} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.

{com}. binscatter loan parInc if parInc < 300000
{res}
{com}. binscatter loan parInc if parInc < 200000
{res}
{com}. binscatter loan parInc if parInc < 200000 & year < 6
{res}
{com}. binscatter loan parInc if parInc < 200000 & year > 8
{res}
{com}. sum loan, detail

                            {txt}loan
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        894
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}        894

{txt}50%    {res}     1500                      {txt}Mean          {res} 4096.233
                        {txt}Largest       Std. Dev.     {res} 7140.542
{txt}75%    {res}     5500          50000
{txt}90%    {res}    10000          55000       {txt}Variance      {res} 5.10e+07
{txt}95%    {res}    15000          60000       {txt}Skewness      {res}  4.23505
{txt}99%    {res}    33000          80000       {txt}Kurtosis      {res} 30.71227

{com}. graph box lloan
{res}
{com}. gen top = loan >= 33000

. tobit loan polImpact parInc parInc2 year i.race i.sex i.region fallSemester if !missing(recloan) & !top, ll
{res}
{txt}Tobit regression{col 51}Number of obs{col 67}= {res}       696
{txt}{col 51}LR chi2({res}11{txt}){col 67}= {res}     41.21
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-4235.4421{txt}{col 51}Pseudo R2{col 67}= {res}    0.0048

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}polImpact {c |}{col 26}{res}{space 2} .0659581{col 38}{space 2} .8615379{col 49}{space 1}    0.08{col 58}{space 3}0.939{col 66}{space 4}-1.625614{col 79}{space 3}  1.75753
{txt}{space 18}parInc {c |}{col 26}{res}{space 2}-.0307679{col 38}{space 2} .0104703{col 49}{space 1}   -2.94{col 58}{space 3}0.003{col 66}{space 4}-.0513256{col 79}{space 3}-.0102103
{txt}{space 17}parInc2 {c |}{col 26}{res}{space 2} 3.41e-08{col 38}{space 2} 2.38e-08{col 49}{space 1}    1.43{col 58}{space 3}0.152{col 66}{space 4}-1.26e-08{col 79}{space 3} 8.09e-08
{txt}{space 20}year {c |}{col 26}{res}{space 2} 335.4469{col 38}{space 2} 178.1543{col 49}{space 1}    1.88{col 58}{space 3}0.060{col 66}{space 4}-14.34707{col 79}{space 3} 685.2409
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 1984.898{col 38}{space 2} 1123.619{col 49}{space 1}    1.77{col 58}{space 3}0.078{col 66}{space 4} -221.253{col 79}{space 3}  4191.05
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 349.5697{col 38}{space 2} 999.2018{col 49}{space 1}    0.35{col 58}{space 3}0.727{col 66}{space 4}-1612.296{col 79}{space 3} 2311.436
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} 643.7357{col 38}{space 2} 683.4434{col 49}{space 1}    0.94{col 58}{space 3}0.347{col 66}{space 4}-698.1598{col 79}{space 3} 1985.631
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}  246.538{col 38}{space 2} 1142.426{col 49}{space 1}    0.22{col 58}{space 3}0.829{col 66}{space 4}-1996.538{col 79}{space 3} 2489.614
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-1257.572{col 38}{space 2} 1105.689{col 49}{space 1}   -1.14{col 58}{space 3}0.256{col 66}{space 4}-3428.518{col 79}{space 3} 913.3738
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-1987.957{col 38}{space 2} 1287.902{col 49}{space 1}   -1.54{col 58}{space 3}0.123{col 66}{space 4}-4516.667{col 79}{space 3} 540.7535
{txt}{space 24} {c |}
{space 12}fallSemester {c |}{col 26}{res}{space 2}-633.2957{col 38}{space 2} 804.0749{col 49}{space 1}   -0.79{col 58}{space 3}0.431{col 66}{space 4}-2212.043{col 79}{space 3} 945.4517
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 384.5283{col 38}{space 2} 1818.491{col 49}{space 1}    0.21{col 58}{space 3}0.833{col 66}{space 4}-3185.958{col 79}{space 3} 3955.015
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                  /sigma {c |}{col 26}{res}{space 2} 8025.068{col 38}{space 2} 317.0009{col 66}{space 4} 7402.658{col 79}{space 3} 8647.478
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Obs. summary:{col 18}{res}      310{col 28}{txt} left-censored observations at loan<={res}0
{txt}{col 18}{res}      386{col 28}{txt}    uncensored observations
{col 18}{res}        0{col 28}{txt}right-censored observations

{com}. 