{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\gmoore\Desktop\honors\Master\master.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}12 Feb 2019, 19:40:51
{txt}
{com}. 
. set more off
{txt}
{com}. 
. cd ../NLSY79ParentData
{res}C:\Users\gmoore\Desktop\honors\NLSY79ParentData
{txt}
{com}. do ParImport
{txt}
{com}. import delimited parInc.csv, clear case(preserve)
{res}{text}(7 vars, 12686 obs)
{com}. 
. 
. //Code Stata missings
. rename R7006500 parInc0
{res}{txt}
{com}. rename R7703700 parInc2
{res}{txt}
{com}. rename R8496100 parInc4
{res}{txt}
{com}. rename T0987800 parInc6
{res}{txt}
{com}. rename T2210000 parInc8
{res}{txt}
{com}. rename T3107800 parInc10
{res}{txt}
{com}. rename R0000100 mid
{res}{txt}
{com}. 
. 
. reshape long parInc, i(mid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}   12686   {txt}->{res}   76116
{txt}Number of variables            {res}       7   {txt}->{res}       3
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
           {res}parInc0 parInc2 ... parInc10   {txt}->   {res}parInc
{txt}{hline 77}

{com}. replace parInc = . if parInc < 0
{txt}(36089 real changes made, 36089 to missing)

{com}. sort mid year
{txt}
{com}. 
{txt}end of do-file

{com}. 
. tempfile parInc
{txt}
{com}. save `parInc'
{txt}file C:\Users\gmoore\AppData\Local\Temp\ST_00000001.tmp saved

{com}. 
. cd ../NLSYChild79Data
{res}C:\Users\gmoore\Desktop\honors\NLSYChild79Data
{txt}
{com}. do Import
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      29   {txt}->{res}      10
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. 
. 
. //Places majors into bins
. gen majType = .
{txt}(19020 missing values generated)

{com}. //Humanities: Area Studies (5) English (14) Art (15) Language (16) History (17)
. //              Interdisciplinary Studies (19) Philosophy (23) Theology (33)
. replace majType = 0 if inlist(maj, 5, 14, 15, 16, 17, 19, 23, 33)
{txt}(415 real changes made)

{com}. //STEM: Agriculture (1) Architecture (4) Biology (6) CS(9) Engineering (13) 
. //              Math (20) Physics (24)
. replace majType = 1 if inlist(maj, 1, 4, 6, 9, 13, 20, 24)
{txt}(1178 real changes made)

{com}. //Social Science: Anthropology(2) Archaeology (3) Economics (11) Home Ec (18)
. //              Political Science (25) Psychology (30) Sociology (31)
. replace majType = 2 if inlist(maj, 2, 3, 11, 18, 25, 30, 31)
{txt}(562 real changes made)

{com}. //Professional: Communications (8) Criminology (10) Education (12)
. //              Nursing (21) Other Health (22) Pre-Dental/Law/Med/Vet (26-29)
. //              Social Work (32)
. replace majType = 3 if inlist(maj, 7, 8, 10, 12, 21, 22, 26, 27, 28, 29, 32)
{txt}(3550 real changes made)

{com}. //Business: Business (7)
. replace majType = 4 if maj == 7
{txt}(1126 real changes made)

{com}. 
. assert missing(majType) == missing(maj) | maj == 0 | maj == 99
{txt}
{com}. 
. label values majType majTypeLab
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. 
. //Need many:one due to siblings
. //Assertion guarantees all children have parental incomes
. //Drop those women without children in college
. merge m:1 mid year using `parInc', assert(match using) keep(match) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          19,020{txt}  
{col 5}{hline 41}

{com}. 
. cd ../Tables/Code
{res}C:\Users\gmoore\Desktop\honors\Tables\Code
{txt}
{com}. do tables
{txt}
{com}. /*
> Makes tables
> */
. 
. //Creates table in Stata window
. tabulate year, sum(loan)

            {txt}{c |}           Summary of loan
       year {c |}        Mean   Std. Dev.       Freq.
{hline 12}{c +}{hline 36}
          0 {c |}  {res} 1397.0552    2572.465         344
  {txt}        2 {c |}  {res} 1591.2508   3410.6981         602
  {txt}        4 {c |}  {res} 2263.8759   5329.7454         822
  {txt}        6 {c |}  {res} 2297.6092   4886.8551         980
  {txt}        8 {c |}  {res}  3236.428   6566.6597        1173
  {txt}       10 {c |}  {res} 4216.5726   13073.263        1336
{txt}{hline 12}{c +}{hline 36}
      Total {c |}  {res} 2849.6774   8038.1165        5257
{txt}
{com}. //Writes table to loanStats.tex
. quietly tabout year using ../Output/loanStats.tex, ///
>         style(tex) ///Forces tex output
>         sum c(mean loan sd loan count loan) ///Marks as summary table (two-way)
>         replace //Replaces previous version
{txt}
{com}. 
. //Creates table in Stata window
. tabulate sex race

           {txt}{c |}   RACE OF CHILD (FROM MOTHERS
    SEX OF {c |}           SCREENER 79)
     CHILD {c |}  HISPANIC      BLACK  NON-BLACK {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
      MALE {c |}{res}     1,710      2,184      4,248 {txt}{c |}{res}     8,142 
{txt}    FEMALE {c |}{res}     2,094      3,876      4,908 {txt}{c |}{res}    10,878 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}     3,804      6,060      9,156 {txt}{c |}{res}    19,020 

{txt}
{com}. quietly tabout sex race using ../Output/raceStats.tex, ///
>         sum c(mean recloan mean loan sd loan count loan) ///
>         style(tex) replace
{txt}
{com}. 
. //Distribution of income
. hist parInc, freq graphregion(color(white))
{txt}(bin={res}41{txt}, start={res}0{txt}, width={res}11706.902{txt})
{res}{txt}
{com}. graph export ../Output/parIncHist.eps, replace
{txt}(file ../Output/parIncHist.eps written in EPS format)

{com}. graph export ../Output/parIncHist.png, replace
{txt}(file ../Output/parIncHist.png written in PNG format)

{com}. 
. //Student debt
. hist loan if recloan & !missing(recloan), freq graphregion(color(white))
{txt}(bin={res}33{txt}, start={res}0{txt}, width={res}12121.212{txt})
{res}{txt}
{com}. graph export ../Output/loanHist.eps, replace
{txt}(file ../Output/loanHist.eps written in EPS format)

{com}. graph export ../Output/loanHist.png, replace
{txt}(file ../Output/loanHist.png written in PNG format)

{com}. 
. //Student debt
. tabulate region

       {txt}region {c |}      Freq.     Percent        Cum.
{hline 14}{c +}{hline 35}
    NORTHEAST {c |}{res}      1,845       12.74       12.74
{txt}NORTH CENTRAL {c |}{res}      3,882       26.80       39.54
{txt}        SOUTH {c |}{res}      5,983       41.31       80.85
{txt}         WEST {c |}{res}      2,773       19.15      100.00
{txt}{hline 14}{c +}{hline 35}
        Total {c |}{res}     14,483      100.00
{txt}
{com}. quietly tabout region using ../Output/regionStats.tex, ///
>         style(tex) replace 
{txt}
{com}. 
. //Major frequency
. graph pie, over(majType) plabel(_all sum) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majPie.png, replace
{txt}(file ../Output/majPie.png written in PNG format)

{com}. 
. //Debt distribution by major
. graph box loan if recloan & !missing(recloan), over(majType) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/DebtbyMajType.png, replace
{txt}(file ../Output/DebtbyMajType.png written in PNG format)

{com}. graph box loan if recloan & !missing(recloan), over(majType) noout graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/DebtbyMajTypeNoOut.png, replace
{txt}(file ../Output/DebtbyMajTypeNoOut.png written in PNG format)

{com}. 
{txt}end of do-file

{com}. 
. cd ../../Regressions/Code
{res}C:\Users\gmoore\Desktop\honors\Regressions\Code
{txt}
{com}. do regs
{txt}
{com}. //Works both with drop and without drop
. //without drop is slightly stronger
. keep if 4 <= year & year <=8
{txt}(9510 observations deleted)

{com}. 
. //Calculates log of loans
. gen lloan = ln(loan)
{txt}(8304 missing values generated)

{com}. 
. //Dummies for each major
. gen busMaj = maj == 7
{txt}
{com}. gen artMaj = maj == 15
{txt}
{com}. gen eduMaj = maj == 12
{txt}
{com}. gen  csMaj = maj == 17
{txt}
{com}. 
. //Add birth year as control
. //Introduce second stage
. 
. //Linear estimator
. reg loan year cohort parInc i.race i.sex i.region

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}    2416
{txt}{hline 13}{char +}{hline 30}           F(  9,  2406) ={res}    7.11
    {txt}   Model {char |} {res} 2.0751e+09     9   230569488           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 7.8053e+10  2406  32440916.6           {txt}R-squared     = {res} 0.0259
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0223
    {txt}   Total {char |} {res} 8.0128e+10  2415  33179283.9           {txt}Root MSE      = {res} 5695.7

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2}-10.79163{col 38}{space 2}  149.634{col 49}{space 1}   -0.07{col 58}{space 3}0.943{col 66}{space 4}-304.2165{col 79}{space 3} 282.6332
{txt}{space 18}cohort {c |}{col 26}{res}{space 2} 998.2084{col 38}{space 2} 490.8315{col 49}{space 1}    2.03{col 58}{space 3}0.042{col 66}{space 4} 35.71223{col 79}{space 3} 1960.705
{txt}{space 18}parInc {c |}{col 26}{res}{space 2} .0013217{col 38}{space 2} .0016902{col 49}{space 1}    0.78{col 58}{space 3}0.434{col 66}{space 4}-.0019926{col 79}{space 3} .0046361
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 960.4748{col 38}{space 2} 352.0566{col 49}{space 1}    2.73{col 58}{space 3}0.006{col 66}{space 4} 270.1093{col 79}{space 3}  1650.84
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 1028.298{col 38}{space 2} 325.2827{col 49}{space 1}    3.16{col 58}{space 3}0.002{col 66}{space 4} 390.4346{col 79}{space 3} 1666.161
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-62.53431{col 38}{space 2} 239.9294{col 49}{space 1}   -0.26{col 58}{space 3}0.794{col 66}{space 4} -533.024{col 79}{space 3} 407.9554
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-793.3257{col 38}{space 2} 416.4376{col 49}{space 1}   -1.91{col 58}{space 3}0.057{col 66}{space 4}-1609.939{col 79}{space 3} 23.28777
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-1899.111{col 38}{space 2} 398.2384{col 49}{space 1}   -4.77{col 58}{space 3}0.000{col 66}{space 4}-2680.037{col 79}{space 3}-1118.185
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-1429.255{col 38}{space 2} 444.9814{col 49}{space 1}   -3.21{col 58}{space 3}0.001{col 66}{space 4}-2301.842{col 79}{space 3}-556.6688
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 2827.311{col 38}{space 2}  910.817{col 49}{space 1}    3.10{col 58}{space 3}0.002{col 66}{space 4} 1041.244{col 79}{space 3} 4613.378
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg lloan year cohort parInc i.race i.sex i.region 

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}    1008
{txt}{hline 13}{char +}{hline 30}           F(  9,   998) ={res}   12.37
    {txt}   Model {char |} {res} 82.3022731     9  9.14469701           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 737.740208   998  .739218646           {txt}R-squared     = {res} 0.1004
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0923
    {txt}   Total {char |} {res} 820.042482  1007  .814342087           {txt}Root MSE      = {res} .85978

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                   lloan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2} .0519377{col 38}{space 2} .0351805{col 49}{space 1}    1.48{col 58}{space 3}0.140{col 66}{space 4}-.0170985{col 79}{space 3} .1209739
{txt}{space 18}cohort {c |}{col 26}{res}{space 2} .1185178{col 38}{space 2} .1159724{col 49}{space 1}    1.02{col 58}{space 3}0.307{col 66}{space 4}-.1090599{col 79}{space 3} .3460956
{txt}{space 18}parInc {c |}{col 26}{res}{space 2} 2.83e-06{col 38}{space 2} 4.94e-07{col 49}{space 1}    5.73{col 58}{space 3}0.000{col 66}{space 4} 1.86e-06{col 79}{space 3} 3.80e-06
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} .1575108{col 38}{space 2} .0848095{col 49}{space 1}    1.86{col 58}{space 3}0.064{col 66}{space 4}-.0089147{col 79}{space 3} .3239363
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} .1925263{col 38}{space 2} .0828079{col 49}{space 1}    2.32{col 58}{space 3}0.020{col 66}{space 4} .0300287{col 79}{space 3}  .355024
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-.1107434{col 38}{space 2} .0567996{col 49}{space 1}   -1.95{col 58}{space 3}0.051{col 66}{space 4}-.2222036{col 79}{space 3} .0007169
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.1827984{col 38}{space 2} .0882972{col 49}{space 1}   -2.07{col 58}{space 3}0.039{col 66}{space 4}-.3560679{col 79}{space 3}-.0095289
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-.3545189{col 38}{space 2} .0892406{col 49}{space 1}   -3.97{col 58}{space 3}0.000{col 66}{space 4}-.5296396{col 79}{space 3}-.1793981
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2} .0335306{col 38}{space 2} .1050585{col 49}{space 1}    0.32{col 58}{space 3}0.750{col 66}{space 4}-.1726303{col 79}{space 3} .2396916
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 7.908263{col 38}{space 2} .2142915{col 49}{space 1}   36.90{col 58}{space 3}0.000{col 66}{space 4} 7.487749{col 79}{space 3} 8.328776
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. //Tobit estimator
. tobit loan year cohort parInc i.race i.sex i.region if !missing(recloan), ll
{res}
{txt}Tobit regression{col 51}Number of obs{col 67}= {res}      2416
{txt}{col 51}LR chi2({res}9{txt}){col 67}= {res}     81.23
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-11570.519{txt}{col 51}Pseudo R2{col 67}= {res}    0.0035

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2}-105.3161{col 38}{space 2} 325.2495{col 49}{space 1}   -0.32{col 58}{space 3}0.746{col 66}{space 4}-743.1142{col 79}{space 3} 532.4819
{txt}{space 18}cohort {c |}{col 26}{res}{space 2} 1995.153{col 38}{space 2} 1067.007{col 49}{space 1}    1.87{col 58}{space 3}0.062{col 66}{space 4}-97.19456{col 79}{space 3}   4087.5
{txt}{space 18}parInc {c |}{col 26}{res}{space 2}-.0059226{col 38}{space 2} .0038816{col 49}{space 1}   -1.53{col 58}{space 3}0.127{col 66}{space 4}-.0135341{col 79}{space 3}  .001689
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 2804.624{col 38}{space 2} 773.0503{col 49}{space 1}    3.63{col 58}{space 3}0.000{col 66}{space 4} 1288.711{col 79}{space 3} 4320.537
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 2471.717{col 38}{space 2} 725.3897{col 49}{space 1}    3.41{col 58}{space 3}0.001{col 66}{space 4} 1049.264{col 79}{space 3} 3894.169
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} 369.8625{col 38}{space 2} 520.0961{col 49}{space 1}    0.71{col 58}{space 3}0.477{col 66}{space 4}-650.0199{col 79}{space 3} 1389.745
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-973.8426{col 38}{space 2} 859.9882{col 49}{space 1}   -1.13{col 58}{space 3}0.258{col 66}{space 4}-2660.236{col 79}{space 3} 712.5513
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-4009.312{col 38}{space 2}  838.552{col 49}{space 1}   -4.78{col 58}{space 3}0.000{col 66}{space 4}-5653.671{col 79}{space 3}-2364.954
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-4039.017{col 38}{space 2} 957.9959{col 49}{space 1}   -4.22{col 58}{space 3}0.000{col 66}{space 4}-5917.599{col 79}{space 3}-2160.434
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-2253.908{col 38}{space 2}     1978{col 49}{space 1}   -1.14{col 58}{space 3}0.255{col 66}{space 4}-6132.667{col 79}{space 3} 1624.851
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                  /sigma {c |}{col 26}{res}{space 2} 10598.07{col 38}{space 2} 260.8748{col 66}{space 4} 10086.51{col 79}{space 3} 11109.63
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Obs. summary:{col 18}{res}     1408{col 28}{txt} left-censored observations at loan<={res}0
{txt}{col 18}{res}     1008{col 28}{txt}    uncensored observations
{col 18}{res}        0{col 28}{txt}right-censored observations

{com}. //Get predicted tobit values
. predict loanHat if !missing(recloan) & !missing(loan), ystar(0, .)
{txt}(7094 missing values generated)

{com}. 
. 
. //Creates dummies for each type of major
. gen humMajType = majType == 0
{txt}
{com}. gen stemMajType = majType == 1
{txt}
{com}. gen ssMajType = majType == 2
{txt}
{com}. gen profMajType = majType == 3
{txt}
{com}. gen busMajType = majType == 4
{txt}
{com}. 
. //Use fitted tobit values as an instrument
. ivprobit busMajType year i.race i.sex i.region parInc (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:  -1041.17}  
Iteration 1:{space 3}log likelihood = {res:-1029.6167}  
Iteration 2:{space 3}log likelihood = {res:-1029.5961}  
Iteration 3:{space 3}log likelihood = {res:-1029.5961}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-25344.391}  
Iteration 1:{space 3}log likelihood = {res:-25344.196}  
Iteration 2:{space 3}log likelihood = {res:-25343.965}  
Iteration 3:{space 3}log likelihood = {res:-25343.707}  
Iteration 4:{space 3}log likelihood = {res:-25343.644}  
Iteration 5:{space 3}log likelihood = {res:-25343.632}  
Iteration 6:{space 3}log likelihood = {res:-25343.629}  
Iteration 7:{space 3}log likelihood = {res:-25343.629}  
Iteration 8:{space 3}log likelihood = {res:-25343.629}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}      2416
{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}     52.08
{txt}Log likelihood = {res}-25343.629{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2}-.0001126{col 38}{space 2} .0000605{col 49}{space 1}   -1.86{col 58}{space 3}0.063{col 66}{space 4}-.0002312{col 79}{space 3} 5.95e-06
{txt}{space 20}year {c |}{col 26}{res}{space 2} .0408261{col 38}{space 2} .0208133{col 49}{space 1}    1.96{col 58}{space 3}0.050{col 66}{space 4} .0000328{col 79}{space 3} .0816195
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} .2528003{col 38}{space 2} .0835899{col 49}{space 1}    3.02{col 58}{space 3}0.002{col 66}{space 4}  .088967{col 79}{space 3} .4166335
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} .1181057{col 38}{space 2} .0998472{col 49}{space 1}    1.18{col 58}{space 3}0.237{col 66}{space 4}-.0775912{col 79}{space 3} .3138026
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} -.181942{col 38}{space 2} .0805564{col 49}{space 1}   -2.26{col 58}{space 3}0.024{col 66}{space 4}-.3398297{col 79}{space 3}-.0240544
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.2253044{col 38}{space 2} .0957806{col 49}{space 1}   -2.35{col 58}{space 3}0.019{col 66}{space 4}-.4130308{col 79}{space 3}-.0375779
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-.3411976{col 38}{space 2} .1130129{col 49}{space 1}   -3.02{col 58}{space 3}0.003{col 66}{space 4}-.5626988{col 79}{space 3}-.1196964
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.3465074{col 38}{space 2} .1048706{col 49}{space 1}   -3.30{col 58}{space 3}0.001{col 66}{space 4}  -.55205{col 79}{space 3}-.1409647
{txt}{space 24} {c |}
{space 18}parInc {c |}{col 26}{res}{space 2} 3.70e-07{col 38}{space 2} 3.94e-07{col 49}{space 1}    0.94{col 58}{space 3}0.348{col 66}{space 4}-4.02e-07{col 79}{space 3} 1.14e-06
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.5324859{col 38}{space 2}  .376056{col 49}{space 1}   -1.42{col 58}{space 3}0.157{col 66}{space 4}-1.269542{col 79}{space 3} .2045703
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2} .7358829{col 38}{space 2}  .574495{col 49}{space 1}    1.28{col 58}{space 3}0.200{col 66}{space 4}-.3901065{col 79}{space 3} 1.861872
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.645133{col 38}{space 2} .0143859{col 49}{space 1}  600.95{col 58}{space 3}0.000{col 66}{space 4} 8.616937{col 79}{space 3} 8.673328
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2} .6266513{col 38}{space 2} .3488955{col 66}{space 4}-.3714521{col 79}{space 3} .9528515
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2}  5682.42{col 38}{space 2} 81.74664{col 66}{space 4} 5524.438{col 79}{space 3} 5844.921
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 40}Instrumented:{space 2}loan{p_end}
{p 0 15 40}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region parInc loanHat{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    1.64{txt}{col 59}Prob > chi2 = {res}0.2002
{txt}
{com}. ivprobit stemMajType year i.race i.sex i.region parInc (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1037.7688}  
Iteration 1:{space 3}log likelihood = {res:-984.24203}  
Iteration 2:{space 3}log likelihood = {res:-983.84527}  
Iteration 3:{space 3}log likelihood = {res:-983.84521}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: -25298.64}  
Iteration 1:{space 3}log likelihood = {res:-25298.622}  
Iteration 2:{space 3}log likelihood = {res:-25298.602}  
Iteration 3:{space 3}log likelihood = {res:  -25298.6}  
Iteration 4:{space 3}log likelihood = {res:-25298.598}  
Iteration 5:{space 3}log likelihood = {res:-25298.598}  
Iteration 6:{space 3}log likelihood = {res:-25298.598}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}      2416
{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}    106.96
{txt}Log likelihood = {res}-25298.598{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2}-.0000262{col 38}{space 2}  .000115{col 49}{space 1}   -0.23{col 58}{space 3}0.820{col 66}{space 4}-.0002515{col 79}{space 3} .0001991
{txt}{space 20}year {c |}{col 26}{res}{space 2}-.0100162{col 38}{space 2} .0370357{col 49}{space 1}   -0.27{col 58}{space 3}0.787{col 66}{space 4} -.082605{col 79}{space 3} .0625725
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2}-.1837983{col 38}{space 2} .1688601{col 49}{space 1}   -1.09{col 58}{space 3}0.276{col 66}{space 4} -.514758{col 79}{space 3} .1471613
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2}-.0716404{col 38}{space 2} .1583019{col 49}{space 1}   -0.45{col 58}{space 3}0.651{col 66}{space 4}-.3819064{col 79}{space 3} .2386256
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-.5943414{col 38}{space 2} .0944381{col 49}{space 1}   -6.29{col 58}{space 3}0.000{col 66}{space 4}-.7794366{col 79}{space 3}-.4092461
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.0183924{col 38}{space 2} .1429265{col 49}{space 1}   -0.13{col 58}{space 3}0.898{col 66}{space 4}-.2985233{col 79}{space 3} .2617384
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2} .0764741{col 38}{space 2} .2530137{col 49}{space 1}    0.30{col 58}{space 3}0.762{col 66}{space 4}-.4194237{col 79}{space 3} .5723719
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.2006259{col 38}{space 2} .1829907{col 49}{space 1}   -1.10{col 58}{space 3}0.273{col 66}{space 4}-.5592811{col 79}{space 3} .1580292
{txt}{space 24} {c |}
{space 18}parInc {c |}{col 26}{res}{space 2} 1.73e-07{col 38}{space 2} 4.73e-07{col 49}{space 1}    0.37{col 58}{space 3}0.714{col 66}{space 4}-7.53e-07{col 79}{space 3} 1.10e-06
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.4709126{col 38}{space 2} .2972212{col 49}{space 1}   -1.58{col 58}{space 3}0.113{col 66}{space 4}-1.053455{col 79}{space 3} .1116303
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2} .1978562{col 38}{space 2} .6735573{col 49}{space 1}    0.29{col 58}{space 3}0.769{col 66}{space 4}-1.122292{col 79}{space 3} 1.518004
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.645133{col 38}{space 2} .0143859{col 49}{space 1}  600.95{col 58}{space 3}0.000{col 66}{space 4} 8.616937{col 79}{space 3} 8.673328
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2} .1953142{col 38}{space 2} .6478627{col 66}{space 4}-.8083647{col 79}{space 3} .9083492
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2}  5682.42{col 38}{space 2} 81.74664{col 66}{space 4} 5524.438{col 79}{space 3} 5844.921
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 40}Instrumented:{space 2}loan{p_end}
{p 0 15 40}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region parInc loanHat{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    0.09{txt}{col 59}Prob > chi2 = {res}0.7690
{txt}
{com}. ivprobit ssMajType year i.race i.sex i.region parInc (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-612.48125}  
Iteration 1:{space 3}log likelihood = {res:-597.85962}  
Iteration 2:{space 3}log likelihood = {res:-597.64421}  
Iteration 3:{space 3}log likelihood = {res:-597.64416}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-24912.439}  
Iteration 1:{space 3}log likelihood = {res:-24912.347}  
Iteration 2:{space 3}log likelihood = {res:-24912.222}  
Iteration 3:{space 3}log likelihood = {res:-24912.118}  
Iteration 4:{space 3}log likelihood = {res:-24912.027}  (not concave)
Iteration 5:{space 3}log likelihood = {res:-24912.018}  
Iteration 6:{space 3}log likelihood = {res:-24912.008}  
Iteration 7:{space 3}log likelihood = {res:-24912.002}  
Iteration 8:{space 3}log likelihood = {res:-24912.002}  
Iteration 9:{space 3}log likelihood = {res:-24912.001}  
Iteration 10:{space 2}log likelihood = {res:-24912.001}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}      2416
{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}     65.15
{txt}Log likelihood = {res}-24912.001{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2} .0001092{col 38}{space 2} .0000768{col 49}{space 1}    1.42{col 58}{space 3}0.155{col 66}{space 4}-.0000414{col 79}{space 3} .0002598
{txt}{space 20}year {c |}{col 26}{res}{space 2}-.0224332{col 38}{space 2} .0306218{col 49}{space 1}   -0.73{col 58}{space 3}0.464{col 66}{space 4}-.0824509{col 79}{space 3} .0375845
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} .0215387{col 38}{space 2} .1697812{col 49}{space 1}    0.13{col 58}{space 3}0.899{col 66}{space 4}-.3112264{col 79}{space 3} .3543037
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2}  .050299{col 38}{space 2} .1793645{col 49}{space 1}    0.28{col 58}{space 3}0.779{col 66}{space 4} -.301249{col 79}{space 3} .4018469
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}  .089525{col 38}{space 2} .0758098{col 49}{space 1}    1.18{col 58}{space 3}0.238{col 66}{space 4}-.0590595{col 79}{space 3} .2381095
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.2764705{col 38}{space 2}   .24044{col 49}{space 1}   -1.15{col 58}{space 3}0.250{col 66}{space 4}-.7477241{col 79}{space 3} .1947832
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-.1946759{col 38}{space 2} .3341329{col 49}{space 1}   -0.58{col 58}{space 3}0.560{col 66}{space 4}-.8495644{col 79}{space 3} .4602127
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.0992722{col 38}{space 2}  .246589{col 49}{space 1}   -0.40{col 58}{space 3}0.687{col 66}{space 4}-.5825778{col 79}{space 3} .3840334
{txt}{space 24} {c |}
{space 18}parInc {c |}{col 26}{res}{space 2} 6.12e-07{col 38}{space 2} 6.10e-07{col 49}{space 1}    1.00{col 58}{space 3}0.315{col 66}{space 4}-5.83e-07{col 79}{space 3} 1.81e-06
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-1.303416{col 38}{space 2} .4116223{col 49}{space 1}   -3.17{col 58}{space 3}0.002{col 66}{space 4}-2.110181{col 79}{space 3}-.4966515
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2}-.7061575{col 38}{space 2} .7018184{col 49}{space 1}   -1.01{col 58}{space 3}0.314{col 66}{space 4}-2.081696{col 79}{space 3} .6693813
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.645132{col 38}{space 2} .0143859{col 49}{space 1}  600.95{col 58}{space 3}0.000{col 66}{space 4} 8.616937{col 79}{space 3} 8.673328
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2}-.6082617{col 38}{space 2} .4421581{col 66}{space 4}-.9693671{col 79}{space 3} .5845728
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2}  5682.42{col 38}{space 2} 81.74657{col 66}{space 4} 5524.437{col 79}{space 3} 5844.921
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 40}Instrumented:{space 2}loan{p_end}
{p 0 15 40}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region parInc loanHat{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    1.01{txt}{col 59}Prob > chi2 = {res}0.3143
{txt}
{com}. ivprobit profMajType year i.race i.sex i.region parInc (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1553.7036}  
Iteration 1:{space 3}log likelihood = {res:-1431.9142}  
Iteration 2:{space 3}log likelihood = {res:-1431.1868}  
Iteration 3:{space 3}log likelihood = {res:-1431.1868}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-25745.982}  
Iteration 1:{space 3}log likelihood = {res:-25745.829}  
Iteration 2:{space 3}log likelihood = {res:-25745.719}  
Iteration 3:{space 3}log likelihood = {res:-25745.644}  
Iteration 4:{space 3}log likelihood = {res: -25745.64}  
Iteration 5:{space 3}log likelihood = {res:-25745.635}  
Iteration 6:{space 3}log likelihood = {res:-25745.635}  
Iteration 7:{space 3}log likelihood = {res:-25745.635}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}      2416
{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}    301.40
{txt}Log likelihood = {res}-25745.635{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2} .0000774{col 38}{space 2} .0000787{col 49}{space 1}    0.98{col 58}{space 3}0.325{col 66}{space 4}-.0000769{col 79}{space 3} .0002317
{txt}{space 20}year {c |}{col 26}{res}{space 2} .0002735{col 38}{space 2} .0297695{col 49}{space 1}    0.01{col 58}{space 3}0.993{col 66}{space 4}-.0580737{col 79}{space 3} .0586207
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2}-.0260562{col 38}{space 2}  .118116{col 49}{space 1}   -0.22{col 58}{space 3}0.825{col 66}{space 4}-.2575593{col 79}{space 3} .2054469
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2}-.1302504{col 38}{space 2} .1011517{col 49}{space 1}   -1.29{col 58}{space 3}0.198{col 66}{space 4} -.328504{col 79}{space 3} .0680033
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} .7187437{col 38}{space 2} .1740571{col 49}{space 1}    4.13{col 58}{space 3}0.000{col 66}{space 4} .3775981{col 79}{space 3} 1.059889
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}  .415806{col 38}{space 2} .1002739{col 49}{space 1}    4.15{col 58}{space 3}0.000{col 66}{space 4} .2192728{col 79}{space 3} .6123391
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2} .4711049{col 38}{space 2} .1173324{col 49}{space 1}    4.02{col 58}{space 3}0.000{col 66}{space 4} .2411377{col 79}{space 3} .7010722
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2} .3160764{col 38}{space 2} .1211113{col 49}{space 1}    2.61{col 58}{space 3}0.009{col 66}{space 4} .0787026{col 79}{space 3} .5534503
{txt}{space 24} {c |}
{space 18}parInc {c |}{col 26}{res}{space 2}-1.32e-06{col 38}{space 2} 4.44e-07{col 49}{space 1}   -2.97{col 58}{space 3}0.003{col 66}{space 4}-2.19e-06{col 79}{space 3}-4.47e-07
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-1.248745{col 38}{space 2} .2127115{col 49}{space 1}   -5.87{col 58}{space 3}0.000{col 66}{space 4}-1.665652{col 79}{space 3}-.8318382
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2}-.4646546{col 38}{space 2} .5533382{col 49}{space 1}   -0.84{col 58}{space 3}0.401{col 66}{space 4}-1.549178{col 79}{space 3} .6198684
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.645133{col 38}{space 2} .0143859{col 49}{space 1}  600.95{col 58}{space 3}0.000{col 66}{space 4} 8.616937{col 79}{space 3} 8.673328
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2}-.4338702{col 38}{space 2}  .449176{col 66}{space 4}-.9136497{col 79}{space 3} .5510364
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2}  5682.42{col 38}{space 2} 81.74665{col 66}{space 4} 5524.438{col 79}{space 3} 5844.921
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 40}Instrumented:{space 2}loan{p_end}
{p 0 15 40}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region parInc loanHat{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    0.71{txt}{col 59}Prob > chi2 = {res}0.4011
{txt}
{com}. ivprobit humMajType year i.race i.sex i.region parInc (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-540.17663}  
Iteration 1:{space 3}log likelihood = {res: -528.1223}  
Iteration 2:{space 3}log likelihood = {res:-527.98792}  
Iteration 3:{space 3}log likelihood = {res: -527.9879}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-24842.783}  
Iteration 1:{space 3}log likelihood = {res:-24842.698}  
Iteration 2:{space 3}log likelihood = {res:-24842.506}  
Iteration 3:{space 3}log likelihood = {res:-24842.364}  
Iteration 4:{space 3}log likelihood = {res:-24842.349}  
Iteration 5:{space 3}log likelihood = {res:-24842.309}  
Iteration 6:{space 3}log likelihood = {res:-24842.307}  
Iteration 7:{space 3}log likelihood = {res:-24842.306}  
Iteration 8:{space 3}log likelihood = {res:-24842.306}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}      2416
{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}     57.81
{txt}Log likelihood = {res}-24842.306{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2}-.0001109{col 38}{space 2} .0000749{col 49}{space 1}   -1.48{col 58}{space 3}0.138{col 66}{space 4}-.0002577{col 79}{space 3} .0000358
{txt}{space 20}year {c |}{col 26}{res}{space 2} .0044312{col 38}{space 2} .0368882{col 49}{space 1}    0.12{col 58}{space 3}0.904{col 66}{space 4}-.0678684{col 79}{space 3} .0767308
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2}   .04355{col 38}{space 2}  .148727{col 49}{space 1}    0.29{col 58}{space 3}0.770{col 66}{space 4}-.2479496{col 79}{space 3} .3350496
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2}  .194958{col 38}{space 2}  .102771{col 49}{space 1}    1.90{col 58}{space 3}0.058{col 66}{space 4}-.0064694{col 79}{space 3} .3963855
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-.2206105{col 38}{space 2} .1161154{col 49}{space 1}   -1.90{col 58}{space 3}0.057{col 66}{space 4}-.4481926{col 79}{space 3} .0069715
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.1556701{col 38}{space 2} .1220643{col 49}{space 1}   -1.28{col 58}{space 3}0.202{col 66}{space 4}-.3949117{col 79}{space 3} .0835716
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2} -.255592{col 38}{space 2}  .162778{col 49}{space 1}   -1.57{col 58}{space 3}0.116{col 66}{space 4}-.5746311{col 79}{space 3} .0634471
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.1461038{col 38}{space 2} .1649845{col 49}{space 1}   -0.89{col 58}{space 3}0.376{col 66}{space 4}-.4694675{col 79}{space 3} .1772598
{txt}{space 24} {c |}
{space 18}parInc {c |}{col 26}{res}{space 2} 8.64e-07{col 38}{space 2} 5.10e-07{col 49}{space 1}    1.69{col 58}{space 3}0.090{col 66}{space 4}-1.35e-07{col 79}{space 3} 1.86e-06
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.8056693{col 38}{space 2} .5990093{col 49}{space 1}   -1.35{col 58}{space 3}0.179{col 66}{space 4}-1.979706{col 79}{space 3} .3683674
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2}  .771506{col 38}{space 2} .7190493{col 49}{space 1}    1.07{col 58}{space 3}0.283{col 66}{space 4}-.6378046{col 79}{space 3} 2.180817
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.645132{col 38}{space 2} .0143859{col 49}{space 1}  600.95{col 58}{space 3}0.000{col 66}{space 4} 8.616936{col 79}{space 3} 8.673328
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2} .6478043{col 38}{space 2} .4172999{col 66}{space 4}-.5634029{col 79}{space 3} .9748063
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2} 5682.419{col 38}{space 2} 81.74659{col 66}{space 4} 5524.436{col 79}{space 3} 5844.919
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 40}Instrumented:{space 2}loan{p_end}
{p 0 15 40}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region parInc loanHat{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    1.15{txt}{col 59}Prob > chi2 = {res}0.2833
{txt}
{com}. 
{txt}end of do-file

{com}. 
{txt}end of do-file

{com}. ls
{txt}  <dir>   2/05/19 21:38  {res}.                 
{txt}  <dir>   2/05/19 21:38  {res}..                
{txt}   1.0k   2/05/19 21:38  {res}master.smcl       
{txt}   1.3k   2/05/19 21:38  {res}regs.do           

{com}. cd ..
{res}C:\Users\gmoore\Desktop\honors\Regressions

{com}. cd ../Master
{res}C:\Users\gmoore\Desktop\honors\Master

{com}. ls
{txt}  <dir>   2/12/19 19:40  {res}.                 
{txt}  <dir>   2/12/19 19:40  {res}..                
{txt}   0.4k   2/05/19 21:38  {res}Master.do         
{txt}  46.9k   2/12/19 19:41  {res}master.smcl       

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. cd ../NLSY79ParentData
{res}C:\Users\gmoore\Desktop\honors\NLSY79ParentData
{txt}
{com}. do ParImport
{txt}
{com}. import delimited parInc.csv, clear case(preserve)
{res}{text}(7 vars, 12686 obs)
{com}. 
. 
. //Code Stata missings
. rename R7006500 parInc0
{res}{txt}
{com}. rename R7703700 parInc2
{res}{txt}
{com}. rename R8496100 parInc4
{res}{txt}
{com}. rename T0987800 parInc6
{res}{txt}
{com}. rename T2210000 parInc8
{res}{txt}
{com}. rename T3107800 parInc10
{res}{txt}
{com}. rename R0000100 mid
{res}{txt}
{com}. 
. 
. reshape long parInc, i(mid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}   12686   {txt}->{res}   76116
{txt}Number of variables            {res}       7   {txt}->{res}       3
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
           {res}parInc0 parInc2 ... parInc10   {txt}->   {res}parInc
{txt}{hline 77}

{com}. replace parInc = . if parInc < 0
{txt}(36089 real changes made, 36089 to missing)

{com}. sort mid year
{txt}
{com}. 
{txt}end of do-file

{com}. 
. tempfile parInc
{txt}
{com}. save `parInc'
{txt}file C:\Users\gmoore\AppData\Local\Temp\ST_00000001.tmp saved

{com}. 
. cd ../NLSYChild79Data
{res}C:\Users\gmoore\Desktop\honors\NLSYChild79Data
{txt}
{com}. do Import
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      35   {txt}->{res}      16
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. 
. 
. //Places majors into bins
. gen majType = .
{txt}(19020 missing values generated)

{com}. //Humanities: Area Studies (5) English (14) Art (15) Language (16) History (17)
. //              Interdisciplinary Studies (19) Philosophy (23) Theology (33)
. replace majType = 0 if inlist(maj, 5, 14, 15, 16, 17, 19, 23, 33)
{txt}(415 real changes made)

{com}. //STEM: Agriculture (1) Architecture (4) Biology (6) CS(9) Engineering (13) 
. //              Math (20) Physics (24)
. replace majType = 1 if inlist(maj, 1, 4, 6, 9, 13, 20, 24)
{txt}(1178 real changes made)

{com}. //Social Science: Anthropology(2) Archaeology (3) Economics (11) Home Ec (18)
. //              Political Science (25) Psychology (30) Sociology (31)
. replace majType = 2 if inlist(maj, 2, 3, 11, 18, 25, 30, 31)
{txt}(562 real changes made)

{com}. //Professional: Communications (8) Criminology (10) Education (12)
. //              Nursing (21) Other Health (22) Pre-Dental/Law/Med/Vet (26-29)
. //              Social Work (32)
. replace majType = 3 if inlist(maj, 7, 8, 10, 12, 21, 22, 26, 27, 28, 29, 32)
{txt}(3550 real changes made)

{com}. //Business: Business (7)
. replace majType = 4 if maj == 7
{txt}(1126 real changes made)

{com}. 
. assert missing(majType) == missing(maj) | maj == 0 | maj == 99
{txt}
{com}. 
. label values majType majTypeLab
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. 
{txt}end of do-file

{com}. ls
{txt}  <dir>   2/12/19 21:00  {res}.                 
{txt}  <dir>   2/12/19 21:00  {res}..                
{txt}  <dir>   2/12/19 20:55  {res}Download          
{txt}   4.3k   2/12/19 21:00  {res}Import.do         
{txt}  36.0k   2/05/19 21:38  {res}master.smcl       
{txt}   0.1k   2/05/19 21:38  {res}RevisedReg.do     

{com}. do Import
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      35   {txt}->{res}      11
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. 
. 
. //Places majors into bins
. gen majType = .
{txt}(19020 missing values generated)

{com}. //Humanities: Area Studies (5) English (14) Art (15) Language (16) History (17)
. //              Interdisciplinary Studies (19) Philosophy (23) Theology (33)
. replace majType = 0 if inlist(maj, 5, 14, 15, 16, 17, 19, 23, 33)
{txt}(415 real changes made)

{com}. //STEM: Agriculture (1) Architecture (4) Biology (6) CS(9) Engineering (13) 
. //              Math (20) Physics (24)
. replace majType = 1 if inlist(maj, 1, 4, 6, 9, 13, 20, 24)
{txt}(1178 real changes made)

{com}. //Social Science: Anthropology(2) Archaeology (3) Economics (11) Home Ec (18)
. //              Political Science (25) Psychology (30) Sociology (31)
. replace majType = 2 if inlist(maj, 2, 3, 11, 18, 25, 30, 31)
{txt}(562 real changes made)

{com}. //Professional: Communications (8) Criminology (10) Education (12)
. //              Nursing (21) Other Health (22) Pre-Dental/Law/Med/Vet (26-29)
. //              Social Work (32)
. replace majType = 3 if inlist(maj, 7, 8, 10, 12, 21, 22, 26, 27, 28, 29, 32)
{txt}(3550 real changes made)

{com}. //Business: Business (7)
. replace majType = 4 if maj == 7
{txt}(1126 real changes made)

{com}. 
. assert missing(majType) == missing(maj) | maj == 0 | maj == 99
{txt}
{com}. 
. label values majType majTypeLab
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      35   {txt}->{res}      11
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. 
. 
. //Places majors into bins
. gen majType = .
{txt}(19020 missing values generated)

{com}. //Humanities: Area Studies (5) English (14) Art (15) Language (16) History (17)
. //              Interdisciplinary Studies (19) Philosophy (23) Theology (33)
. replace majType = 0 if inlist(maj, 5, 14, 15, 16, 17, 19, 23, 33)
{txt}(415 real changes made)

{com}. //STEM: Agriculture (1) Architecture (4) Biology (6) CS(9) Engineering (13) 
. //              Math (20) Physics (24)
. replace majType = 1 if inlist(maj, 1, 4, 6, 9, 13, 20, 24)
{txt}(1178 real changes made)

{com}. //Social Science: Anthropology(2) Archaeology (3) Economics (11) Home Ec (18)
. //              Political Science (25) Psychology (30) Sociology (31)
. replace majType = 2 if inlist(maj, 2, 3, 11, 18, 25, 30, 31)
{txt}(562 real changes made)

{com}. //Professional: Communications (8) Criminology (10) Education (12)
. //              Nursing (21) Other Health (22) Pre-Dental/Law/Med/Vet (26-29)
. //              Social Work (32)
. replace majType = 3 if inlist(maj, 7, 8, 10, 12, 21, 22, 26, 27, 28, 29, 32)
{txt}(3550 real changes made)

{com}. //Business: Business (7)
. replace majType = 4 if maj == 7
{txt}(1126 real changes made)

{com}. 
. assert missing(majType) == missing(maj) | maj == 0 | maj == 99
{txt}
{com}. 
. label values majType majTypeLab
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. br if inlist(grade, 12, 13, 14, 15) & year == 6

. count if year == 8
{res} 3170

{com}. help date

. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      59   {txt}->{res}      35
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. if year == 8{c -(}
.         polImpact = 1875 if grade == 13
.         polImpact = 
. {c )-}
{txt}
{com}. 
. 
. 
. 
. //Places majors into bins
. gen majType = .
{txt}(19020 missing values generated)

{com}. //Humanities: Area Studies (5) English (14) Art (15) Language (16) History (17)
. //              Interdisciplinary Studies (19) Philosophy (23) Theology (33)
. replace majType = 0 if inlist(maj, 5, 14, 15, 16, 17, 19, 23, 33)
{txt}(415 real changes made)

{com}. //STEM: Agriculture (1) Architecture (4) Biology (6) CS(9) Engineering (13) 
. //              Math (20) Physics (24)
. replace majType = 1 if inlist(maj, 1, 4, 6, 9, 13, 20, 24)
{txt}(1178 real changes made)

{com}. //Social Science: Anthropology(2) Archaeology (3) Economics (11) Home Ec (18)
. //              Political Science (25) Psychology (30) Sociology (31)
. replace majType = 2 if inlist(maj, 2, 3, 11, 18, 25, 30, 31)
{txt}(562 real changes made)

{com}. //Professional: Communications (8) Criminology (10) Education (12)
. //              Nursing (21) Other Health (22) Pre-Dental/Law/Med/Vet (26-29)
. //              Social Work (32)
. replace majType = 3 if inlist(maj, 7, 8, 10, 12, 21, 22, 26, 27, 28, 29, 32)
{txt}(3550 real changes made)

{com}. //Business: Business (7)
. replace majType = 4 if maj == 7
{txt}(1126 real changes made)

{com}. 
. assert missing(majType) == missing(maj) | maj == 0 | maj == 99
{txt}
{com}. 
. label values majType majTypeLab
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. ls
{txt}  <dir>   2/12/19 21:56  {res}.                 
{txt}  <dir>   2/12/19 21:56  {res}..                
{txt}  <dir>   2/12/19 21:47  {res}Download          
{txt}   4.9k   2/12/19 21:56  {res}Import.do         
{txt}  36.0k   2/05/19 21:38  {res}master.smcl       
{txt}   0.1k   2/05/19 21:38  {res}RevisedReg.do     

{com}. do Import
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      59   {txt}->{res}      35
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. if year == 8{c -(}
.         polImpact = 1875 if grade == 13
.         polImpact = 
. {c )-}
{txt}
{com}. 
. 
. 
. 
. //Places majors into bins
. gen majType = .
{txt}(19020 missing values generated)

{com}. //Humanities: Area Studies (5) English (14) Art (15) Language (16) History (17)
. //              Interdisciplinary Studies (19) Philosophy (23) Theology (33)
. replace majType = 0 if inlist(maj, 5, 14, 15, 16, 17, 19, 23, 33)
{txt}(415 real changes made)

{com}. //STEM: Agriculture (1) Architecture (4) Biology (6) CS(9) Engineering (13) 
. //              Math (20) Physics (24)
. replace majType = 1 if inlist(maj, 1, 4, 6, 9, 13, 20, 24)
{txt}(1178 real changes made)

{com}. //Social Science: Anthropology(2) Archaeology (3) Economics (11) Home Ec (18)
. //              Political Science (25) Psychology (30) Sociology (31)
. replace majType = 2 if inlist(maj, 2, 3, 11, 18, 25, 30, 31)
{txt}(562 real changes made)

{com}. //Professional: Communications (8) Criminology (10) Education (12)
. //              Nursing (21) Other Health (22) Pre-Dental/Law/Med/Vet (26-29)
. //              Social Work (32)
. replace majType = 3 if inlist(maj, 7, 8, 10, 12, 21, 22, 26, 27, 28, 29, 32)
{txt}(3550 real changes made)

{com}. //Business: Business (7)
. replace majType = 4 if maj == 7
{txt}(1126 real changes made)

{com}. 
. assert missing(majType) == missing(maj) | maj == 0 | maj == 99
{txt}
{com}. 
. label values majType majTypeLab
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. 
. kill
{err}unrecognized command:  kill
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. br *4 if !missing(intDate4)

. br *4 if missing(intDate4)

. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. 
. kill
{err}unrecognized command:  kill
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. set more off

. do Import
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      59   {txt}->{res}      30
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
        intDate0 intDate2 ... intDate10   {txt}->   {res}intDate
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. if year == 8{c -(}
.         polImpact = 1875 if grade == 13
.         polImpact = 
. {c )-}
{txt}
{com}. 
. 
. 
. 
. //Places majors into bins
. gen majType = .
{txt}(19020 missing values generated)

{com}. //Humanities: Area Studies (5) English (14) Art (15) Language (16) History (17)
. //              Interdisciplinary Studies (19) Philosophy (23) Theology (33)
. replace majType = 0 if inlist(maj, 5, 14, 15, 16, 17, 19, 23, 33)
{txt}(415 real changes made)

{com}. //STEM: Agriculture (1) Architecture (4) Biology (6) CS(9) Engineering (13) 
. //              Math (20) Physics (24)
. replace majType = 1 if inlist(maj, 1, 4, 6, 9, 13, 20, 24)
{txt}(1178 real changes made)

{com}. //Social Science: Anthropology(2) Archaeology (3) Economics (11) Home Ec (18)
. //              Political Science (25) Psychology (30) Sociology (31)
. replace majType = 2 if inlist(maj, 2, 3, 11, 18, 25, 30, 31)
{txt}(562 real changes made)

{com}. //Professional: Communications (8) Criminology (10) Education (12)
. //              Nursing (21) Other Health (22) Pre-Dental/Law/Med/Vet (26-29)
. //              Social Work (32)
. replace majType = 3 if inlist(maj, 7, 8, 10, 12, 21, 22, 26, 27, 28, 29, 32)
{txt}(3550 real changes made)

{com}. //Business: Business (7)
. replace majType = 4 if maj == 7
{txt}(1126 real changes made)

{com}. 
. assert missing(majType) == missing(maj) | maj == 0 | maj == 99
{txt}
{com}. 
. label values majType majTypeLab
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. drop Y1* Y2*
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      41   {txt}->{res}      12
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
        intDate0 intDate2 ... intDate10   {txt}->   {res}intDate
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. if year == 8{c -(}
.         polImpact = 1875 if grade == 13
.         polImpact = 
. {c )-}
{txt}
{com}. 
. 
. 
. 
. //Places majors into bins
. gen majType = .
{txt}(19020 missing values generated)

{com}. //Humanities: Area Studies (5) English (14) Art (15) Language (16) History (17)
. //              Interdisciplinary Studies (19) Philosophy (23) Theology (33)
. replace majType = 0 if inlist(maj, 5, 14, 15, 16, 17, 19, 23, 33)
{txt}(415 real changes made)

{com}. //STEM: Agriculture (1) Architecture (4) Biology (6) CS(9) Engineering (13) 
. //              Math (20) Physics (24)
. replace majType = 1 if inlist(maj, 1, 4, 6, 9, 13, 20, 24)
{txt}(1178 real changes made)

{com}. //Social Science: Anthropology(2) Archaeology (3) Economics (11) Home Ec (18)
. //              Political Science (25) Psychology (30) Sociology (31)
. replace majType = 2 if inlist(maj, 2, 3, 11, 18, 25, 30, 31)
{txt}(562 real changes made)

{com}. //Professional: Communications (8) Criminology (10) Education (12)
. //              Nursing (21) Other Health (22) Pre-Dental/Law/Med/Vet (26-29)
. //              Social Work (32)
. replace majType = 3 if inlist(maj, 7, 8, 10, 12, 21, 22, 26, 27, 28, 29, 32)
{txt}(3550 real changes made)

{com}. //Business: Business (7)
. replace majType = 4 if maj == 7
{txt}(1126 real changes made)

{com}. 
. assert missing(majType) == missing(maj) | maj == 0 | maj == 99
{txt}
{com}. 
. label values majType majTypeLab
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. br if year == 8

. sort intDate

. br if year == 8

. display max(grade)
{res}{err}invalid syntax
{txt}{search r(198):r(198);}

{com}. sort grade

. br

. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. drop Y1* Y2*
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      41   {txt}->{res}      12
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
        intDate0 intDate2 ... intDate10   {txt}->   {res}intDate
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. if  (grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008"))) || ///
>         (grade == 15 & inrange(intDate, date("15aug2008", "DMY"), date("15aug2009"))) || ///
>         (grade == 16 & inrange(intDate, date("15aug2009", "DMY"), date("15aug2010"))) || ///
>         (grade == 17 & inrange(intDate, date("15aug2010", "DMY"), date("15aug2011"))){c -(}
{err}unknown function ()
{txt}{search r(133):r(133);}

end of do-file

{search r(133):r(133);}

{com}. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. drop Y1* Y2*
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      41   {txt}->{res}      12
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
        intDate0 intDate2 ... intDate10   {txt}->   {res}intDate
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. if  ((grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008"))) || ///
>         (grade == 15 & inrange(intDate, date("15aug2008", "DMY"), date("15aug2009"))) || ///
>         (grade == 16 & inrange(intDate, date("15aug2009", "DMY"), date("15aug2010"))) || ///
>         (grade == 17 & inrange(intDate, date("15aug2010", "DMY"), date("15aug2011")))){c -(}
{err}unknown function ()
{txt}{search r(133):r(133);}

end of do-file

{search r(133):r(133);}

{com}. 1 == 1
{err}unrecognized command:  1 invalid command name
{txt}{search r(199):r(199);}

{com}. display 1 == 1
{res}1

{com}. display 1 == 2
{res}0

{com}. display (1 == 1 | 1 == 2)
{res}1

{com}. display (1 == 1 & 1 == 2)
{res}0

{com}. display (1 == 1 || 1 == 2)
{res}{err}1| invalid name
{txt}{search r(198):r(198);}

{com}. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. drop Y1* Y2*
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      41   {txt}->{res}      12
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
        intDate0 intDate2 ... intDate10   {txt}->   {res}intDate
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. if  (grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008"))) | ///
>         (grade == 15 & inrange(intDate, date("15aug2008", "DMY"), date("15aug2009"))) | ///
>         (grade == 16 & inrange(intDate, date("15aug2009", "DMY"), date("15aug2010"))) | ///
>         (grade == 17 & inrange(intDate, date("15aug2010", "DMY"), date("15aug2011"))){c -(}
{err}invalid syntax
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. drop Y1* Y2*
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      41   {txt}->{res}      12
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
        intDate0 intDate2 ... intDate10   {txt}->   {res}intDate
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. if  ((grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008"))) | ///
>          (grade == 15 & inrange(intDate, date("15aug2008", "DMY"), date("15aug2009"))) | ///
>          (grade == 16 & inrange(intDate, date("15aug2009", "DMY"), date("15aug2010"))) | ///
>          (grade == 17 & inrange(intDate, date("15aug2010", "DMY"), date("15aug2011")))){c -(}
{err}invalid syntax
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. drop Y1* Y2*
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      41   {txt}->{res}      12
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
        intDate0 intDate2 ... intDate10   {txt}->   {res}intDate
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. if  (grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008"))  ///
>          /*(grade == 15 & inrange(intDate, date("15aug2008", "DMY"), date("15aug2009"))) | ///
>          (grade == 16 & inrange(intDate, date("15aug2009", "DMY"), date("15aug2010"))) | ///
>          (grade == 17 & inrange(intDate, date("15aug2010", "DMY"), date("15aug2011"))))*/{c -(}
{err}too few ')' or ']'
{txt}{search r(132):r(132);}

end of do-file

{search r(132):r(132);}

{com}. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. drop Y1* Y2*
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      41   {txt}->{res}      12
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
        intDate0 intDate2 ... intDate10   {txt}->   {res}intDate
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. if  (grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008")))  ///
>          /*(grade == 15 & inrange(intDate, date("15aug2008", "DMY"), date("15aug2009"))) | ///
>          (grade == 16 & inrange(intDate, date("15aug2009", "DMY"), date("15aug2010"))) | ///
>          (grade == 17 & inrange(intDate, date("15aug2010", "DMY"), date("15aug2011"))))*/{c -(}
{err}invalid syntax
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. help inrange

. display (grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008")))
{res}{err}invalid syntax
{txt}{search r(198):r(198);}

{com}. display grade == 14
{res}0

{com}. display inrange(intDate, date("15aug2007", "DMY"), date("15aug2008"))
{res}{err}invalid syntax
{txt}{search r(198):r(198);}

{com}. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. drop Y1* Y2*
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      41   {txt}->{res}      12
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
        intDate0 intDate2 ... intDate10   {txt}->   {res}intDate
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. if  ((grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008", "DMY"))) | ///
>          (grade == 15 & inrange(intDate, date("15aug2008", "DMY"), date("15aug2009", "DMY"))) | ///
>          (grade == 16 & inrange(intDate, date("15aug2009", "DMY"), date("15aug2010", "DMY"))) | ///
>          (grade == 17 & inrange(intDate, date("15aug2010", "DMY"), date("15aug2011", "DMY")))){c -(}
.                 replace polImpact = 1000
. {c )-}
{txt}
{com}. 
. //Students who enter school after the policy change get full impact
. if  (grade == 13 & intDate > date("15aug2007", "DMY")) | ///
>         (grade == 14 & intDate > date("15aug2008", "DMY")) | ///
>         (grade == 15 & intDate > date("15aug2009", "DMY")) | ///
>         (grade == 16 & intDate > date("15aug2010", "DMY")) | ///
>         (grade == 17 & intDate > date("15aug2011", "DMY")) {c -(}
.                 replace polImpact = 1875
. {c )-}
{txt}
{com}.         
. replace polImpact = 1000 if grade == 14 date("15aug2007", "DMY") < intDate & intDate < date("1aug2008", "DMY"
{err}invalid 'date' 
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. display date("15aug2007", "DMY")
{res}17393

{com}. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. drop Y1* Y2*
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      41   {txt}->{res}      12
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
        intDate0 intDate2 ... intDate10   {txt}->   {res}intDate
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. if  ((grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008", "DMY"))) | ///
>          (grade == 15 & inrange(intDate, date("15aug2008", "DMY"), date("15aug2009", "DMY"))) | ///
>          (grade == 16 & inrange(intDate, date("15aug2009", "DMY"), date("15aug2010", "DMY"))) | ///
>          (grade == 17 & inrange(intDate, date("15aug2010", "DMY"), date("15aug2011", "DMY")))){c -(}
.                 replace polImpact = 1000
. {c )-}
{txt}
{com}. 
. //Students who enter school after the policy change get full impact
. if  ((grade == 13 & intDate > date("15aug2007", "DMY")) | ///
>          (grade == 14 & intDate > date("15aug2008", "DMY")) | ///
>          (grade == 15 & intDate > date("15aug2009", "DMY")) | ///
>          (grade == 16 & intDate > date("15aug2010", "DMY")) | ///
>          (grade == 17 & intDate > date("15aug2011", "DMY"))) {c -(}
.                 replace polImpact = 1875
. {c )-}
{txt}
{com}.         
. replace polImpact = 1000 if grade == 14 date("15aug2007", "DMY") < intDate & intDate < date("1aug2008", "DMY"
{err}invalid 'date' 
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. do "C:\Users\gmoore\Desktop\honors\NLSYChild79Data\Import.do"
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1012100 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2000"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1180500 "DATE OF CAPI INTERVIEW 2000"
  Y1180501 "DATE OF CAPI INTERVIEW 2000"
  Y1180502 "DATE OF CAPI INTERVIEW 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1254300 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2002"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1421100 "DATE OF CAPI INTERVIEW 2002"
  Y1421101 "DATE OF CAPI INTERVIEW 2002"
  Y1421102 "DATE OF CAPI INTERVIEW 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1450200 "DATE OF CAPI INTERVIEW-DAY 2004"
  Y1450201 "DATE OF CAPI INTERVIEW-MONTH 2004"
  Y1450202 "DATE OF CAPI INTERVIEW-YEAR 2004"
  Y1488000 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2004"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1695600 "DATE OF CAPI INTERVIEW-DAY 2006"
  Y1695601 "DATE OF CAPI INTERVIEW-MONTH 2006"
  Y1695602 "DATE OF CAPI INTERVIEW-YEAR 2006"
  Y1737800 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2006"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y1981600 "DATE OF CAPI INTERVIEW-DAY 2008"
  Y1981601 "DATE OF CAPI INTERVIEW-MONTH 2008"
  Y1981602 "DATE OF CAPI INTERVIEW-YEAR 2008"
  Y2018600 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2008"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2300400 "DATE OF CAPI INTERVIEW-DAY 2010"
  Y2300401 "DATE OF CAPI INTERVIEW-MONTH 2010"
  Y2300402 "DATE OF CAPI INTERVIEW-YEAR 2010"
  Y2343700 "GRADE OR YR OF SCHOOL R IS CURRENTLY ENROLLED IN 2010"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. label define gradeLab 1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YEAR COLLEGE"  14 "2ND YEAR COLLEGE"  15 "3RD YEAR COLLEGE"  16 "4TH YEAR COLLEGE"  17 "5TH YEAR COLLEGE"  18 "6TH YEAR COLLEGE"  19 "7TH YEAR COLLEGE"  20 "8TH YEAR COLLEGE OR MORE"  95 "UNGRADED"  0 "None"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Year of study
. rename Y1012100 grade0
{res}{txt}
{com}. rename Y1254300 grade2
{res}{txt}
{com}. rename Y1488000 grade4
{res}{txt}
{com}. rename Y1737800 grade6
{res}{txt}
{com}. rename Y2018600 grade8
{res}{txt}
{com}. rename Y2343700 grade10
{res}{txt}
{com}. 
. label values grade* gradeLab
{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Interview dates
. gen intDate0 = mdy(Y1180501, Y1180500, Y1180502)
{txt}(8496 missing values generated)

{com}. gen intDate2 = mdy(Y1421101, Y1421100, Y1421102)
{txt}(7283 missing values generated)

{com}. gen intDate4 = mdy(Y1450201, Y1450200, Y1450202)
{txt}(6497 missing values generated)

{com}. gen intDate6 = mdy(Y1695601, Y1695600, Y1695602)
{txt}(5677 missing values generated)

{com}. gen intDate8 = mdy(Y1981601, Y1981600, Y1981602)
{txt}(5216 missing values generated)

{com}. gen intDate10 = mdy(Y2300401, Y2300400, Y2300402)
{txt}(5419 missing values generated)

{com}. format intDate* %td
{txt}
{com}. drop Y1* Y2*
{txt}
{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region grade intDate, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      41   {txt}->{res}      12
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
              grade0 grade2 ... grade10   {txt}->   {res}grade
        intDate0 intDate2 ... intDate10   {txt}->   {res}intDate
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. replace grade = . if grade < 0
{txt}(9562 real changes made, 9562 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. //Creates value of treatment
. //Freshmen received an increase of 3500-2625=875
. //Sophomores received an increase of 4500-3500=1000
. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. if  ((grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008", "DMY"))) | ///
>          (grade == 15 & inrange(intDate, date("15aug2008", "DMY"), date("15aug2009", "DMY"))) | ///
>          (grade == 16 & inrange(intDate, date("15aug2009", "DMY"), date("15aug2010", "DMY"))) | ///
>          (grade == 17 & inrange(intDate, date("15aug2010", "DMY"), date("15aug2011", "DMY")))){c -(}
.                 replace polImpact = 1000
. {c )-}
{txt}
{com}. 
. //Students who enter school after the policy change get full impact
. if  ((grade == 13 & intDate > date("15aug2007", "DMY")) | ///
>          (grade == 14 & intDate > date("15aug2008", "DMY")) | ///
>          (grade == 15 & intDate > date("15aug2009", "DMY")) | ///
>          (grade == 16 & intDate > date("15aug2010", "DMY")) | ///
>          (grade == 17 & intDate > date("15aug2011", "DMY"))) {c -(}
.                 replace polImpact = 1875
. {c )-}
{txt}
{com}.         
. 
. //Places majors into bins
. gen majType = .
{txt}(19020 missing values generated)

{com}. //Humanities: Area Studies (5) English (14) Art (15) Language (16) History (17)
. //              Interdisciplinary Studies (19) Philosophy (23) Theology (33)
. replace majType = 0 if inlist(maj, 5, 14, 15, 16, 17, 19, 23, 33)
{txt}(415 real changes made)

{com}. //STEM: Agriculture (1) Architecture (4) Biology (6) CS(9) Engineering (13) 
. //              Math (20) Physics (24)
. replace majType = 1 if inlist(maj, 1, 4, 6, 9, 13, 20, 24)
{txt}(1178 real changes made)

{com}. //Social Science: Anthropology(2) Archaeology (3) Economics (11) Home Ec (18)
. //              Political Science (25) Psychology (30) Sociology (31)
. replace majType = 2 if inlist(maj, 2, 3, 11, 18, 25, 30, 31)
{txt}(562 real changes made)

{com}. //Professional: Communications (8) Criminology (10) Education (12)
. //              Nursing (21) Other Health (22) Pre-Dental/Law/Med/Vet (26-29)
. //              Social Work (32)
. replace majType = 3 if inlist(maj, 7, 8, 10, 12, 21, 22, 26, 27, 28, 29, 32)
{txt}(3550 real changes made)

{com}. //Business: Business (7)
. replace majType = 4 if maj == 7
{txt}(1126 real changes made)

{com}. 
. assert missing(majType) == missing(maj) | maj == 0 | maj == 99
{txt}
{com}. 
. label values majType majTypeLab
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. sort polImpact

. sort polImpact intDate

. sort polImpact intDate grade

. sort polImpact grade intDate

. br polImpact grade intDate

. br polImpact grade intDate if grade > 12

. count if  ((grade == 13 & intDate > date("15aug2007", "DMY")) | ///
{err}too few ')' or ']'
{txt}{search r(132):r(132);}

{com}. 
.  (grade == 14 & intDate > date("15aug2008", "DMY")) | ///
{err}unrecognized command:  ( invalid command name
{txt}{search r(199):r(199);}

{com}. 
.  (grade == 15 & intDate > date("15aug2009", "DMY")) | ///
{err}unrecognized command:  ( invalid command name
{txt}{search r(199):r(199);}

{com}. 
.  (grade == 16 & intDate > date("15aug2010", "DMY")) | ///
{err}unrecognized command:  ( invalid command name
{txt}{search r(199):r(199);}

{com}. 
.  (grade == 17 & intDate > date("15aug2011", "DMY")))
{err}unrecognized command:  ( invalid command name
{txt}{search r(199):r(199);}

{com}. countif  ((grade == 13 & intDate > date("15aug2007", "DMY")) |  (grade == 14 & intDate > date("15aug2008", "DMY")) | (grade == 15 & intDate > date("15aug2009", "DMY")) | (grade == 16 & intDate > date("15aug2010", "DMY")) |  (grade == 17 & intDate > date("15aug2011", "DMY")))
{err}unrecognized command:  countif
{txt}{search r(199):r(199);}

{com}. count if  ((grade == 13 & intDate > date("15aug2007", "DMY")) |  (grade == 14 & intDate > date("15aug2008", "DMY")) | (grade == 15 & intDate > date("15aug2009", "DMY")) | (grade == 16 & intDate > date("15aug2010", "DMY")) |  (grade == 17 & intDate > date("15aug2011", "DMY")))
{res} 1537

{com}. count if ((grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008", "DMY"))) | (grade == 15 & inrange(intDate, date("15aug2008", "DMY"), date("15aug2009", "DMY"))) | (grade == 16 & inrange(intDate, date("15aug2009", "DMY"), date("15aug2010", "DMY"))) |  (grade == 17 & inrange(intDate, date("15aug2010", "DMY"), date("15aug2011", "DMY"))))
{res}  513

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. gen polImpact = 0
{err}polImpact already defined
{txt}{search r(110):r(110);}

end of do-file

{search r(110):r(110);}

{com}. drop polImpact

. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. if  ((grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008", "DMY"))) | ///
>          (grade == 15 & inrange(intDate, date("15aug2008", "DMY"), date("15aug2009", "DMY"))) | ///
>          (grade == 16 & inrange(intDate, date("15aug2009", "DMY"), date("15aug2010", "DMY"))) | ///
>          (grade == 17 & inrange(intDate, date("15aug2010", "DMY"), date("15aug2011", "DMY")))){c -(}
.                 replace polImpact = 1000
. {c )-}
{txt}
{com}. 
. //Students who enter school after the policy change get full impact
. if  ((grade == 13 & intDate > date("15aug2007", "DMY")) | ///
>          (grade == 14 & intDate > date("15aug2008", "DMY")) | ///
>          (grade == 15 & intDate > date("15aug2009", "DMY")) | ///
>          (grade == 16 & intDate > date("15aug2010", "DMY")) | ///
>          (grade == 17 & intDate > date("15aug2011", "DMY"))) {c -(}
.                 replace polImpact = 1875
. {c )-}
{txt}
{com}.         
. 
{txt}end of do-file

{com}. count if polImpact > 0
{res}    0

{com}. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. gen polImpact = 0
{err}polImpact already defined
{txt}{search r(110):r(110);}

end of do-file

{search r(110):r(110);}

{com}. drop polI

. do "C:\Users\gmoore\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. gen polImpact = 0
{txt}
{com}. //Students who are sophomores in the 2007-2008 school year receive only sophomore package
. replace polImpact = 1000 if  ((grade == 14 & inrange(intDate, date("15aug2007", "DMY"), date("15aug2008", "DMY"))) | ///
>          (grade == 15 & inrange(intDate, date("15aug2008", "DMY"), date("15aug2009", "DMY"))) | ///
>          (grade == 16 & inrange(intDate, date("15aug2009", "DMY"), date("15aug2010", "DMY"))) | ///
>          (grade == 17 & inrange(intDate, date("15aug2010", "DMY"), date("15aug2011", "DMY"))))
{txt}(513 real changes made)

{com}. 
. //Students who enter school after the policy change get full impact
. replace polImpact = 1875 if  ((grade == 13 & intDate > date("15aug2007", "DMY")) | ///
>          (grade == 14 & intDate > date("15aug2008", "DMY")) | ///
>          (grade == 15 & intDate > date("15aug2009", "DMY")) | ///
>          (grade == 16 & intDate > date("15aug2010", "DMY")) | ///
>          (grade == 17 & intDate > date("15aug2011", "DMY")))
{txt}(1537 real changes made)

{com}.         
. 
{txt}end of do-file

{com}. count if polI > 0
{res} 2050

{com}. br polImpact grade intDate if grade > 12

. sort polImpact grade intDate

. br polImpact grade intDate if grade > 12

. 