{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\gmoor\Desktop\honors\Master\master.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Dec 2018, 21:50:53
{txt}
{com}. 
. set more off
{txt}
{com}. 
. cd ../NLSY79ParentData
{res}C:\Users\gmoor\Desktop\honors\NLSY79ParentData
{txt}
{com}. do ParImport
{txt}
{com}. import delimited parInc.csv, clear case(preserve)
{res}{text}(7 vars, 12686 obs)
{com}. 
. 
. //Code Stata missings
. rename R7006500 parInc0
{res}{txt}
{com}. rename R7703700 parInc2
{res}{txt}
{com}. rename R8496100 parInc4
{res}{txt}
{com}. rename T0987800 parInc6
{res}{txt}
{com}. rename T2210000 parInc8
{res}{txt}
{com}. rename T3107800 parInc10
{res}{txt}
{com}. rename R0000100 mid
{res}{txt}
{com}. 
. 
. reshape long parInc, i(mid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}   12686   {txt}->{res}   76116
{txt}Number of variables            {res}       7   {txt}->{res}       3
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
           {res}parInc0 parInc2 ... parInc10   {txt}->   {res}parInc
{txt}{hline 77}

{com}. replace parInc = . if parInc < 0
{txt}(36089 real changes made, 36089 to missing)

{com}. sort mid year
{txt}
{com}. 
{txt}end of do-file

{com}. 
. tempfile parInc
{txt}
{com}. save `parInc'
{txt}file C:\Users\gmoor\AppData\Local\Temp\ST_00000001.tmp saved

{com}. 
. cd ../NLSYChild79Data
{res}C:\Users\gmoor\Desktop\honors\NLSYChild79Data
{txt}
{com}. do Import
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/child.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1193000 "REGION OF RESIDENCE 2000"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1435200 "REGION OF RESIDENCE 2002"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1673400 "REGION OF RESIDENCE 2004"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1949200 "REGION OF RESIDENCE 2006"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2267000 "VERSION_R26 CHILD/YOUNG ADULT XRND"
  Y2267800 "REGION OF RESIDENCE 2008"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2616700 "REGION OF RESIDENCE 2010"
{c )-}

(11521 observations read)

{com}. 
. //Unneeded documentation parameter
. drop Y2267000
{txt}
{com}. 
. //Define labels
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label define regionLab 1 "NORTHEAST" 2 "NORTH CENTRAL" 3 "SOUTH" 4 "WEST"
{txt}
{com}. label define majTypeLab 0 "Humanities" 1 "STEM" 2 "Social Science" 3 "Professions" 4 "Business"
{txt}
{com}. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. label values race raceLab
{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. label values sex sexLab
{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. label values maj* majLab
{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. label values recloan* ynLab
{txt}
{com}. 
. //Region
. rename Y1193000 region0
{res}{txt}
{com}. rename Y1435200 region2
{res}{txt}
{com}. rename Y1673400 region4
{res}{txt}
{com}. rename Y1949200 region6
{res}{txt}
{com}. rename Y2267800 region8
{res}{txt}
{com}. rename Y2616700 region10
{res}{txt}
{com}. 
. label values region* regionLab
{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' < 0
{txt}  3{com}. {c )-}
{txt}(11153 real changes made, 11153 to missing)
(10886 real changes made, 10886 to missing)
(10637 real changes made, 10637 to missing)
(10479 real changes made, 10479 to missing)
(10267 real changes made, 10267 to missing)
(10088 real changes made, 10088 to missing)

{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8351 observations deleted)

{com}.         
. //Change to long data
. reshape long maj recloan loan region, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3170   {txt}->{res}   19020
{txt}Number of variables            {res}      29   {txt}->{res}      10
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
           region0 region2 ... region10   {txt}->   {res}region
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj < 0
{txt}(11736 real changes made, 11736 to missing)

{com}. replace loan = 0 if !recloan & !missing(recloan)
{txt}(3083 real changes made)

{com}. replace loan = . if loan < 0
{txt}(13763 real changes made, 13763 to missing)

{com}. replace region = . if region < 0
{txt}(4537 real changes made, 4537 to missing)

{com}. replace recloan = . if recloan < 0
{txt}(0 real changes made)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year >= 8)
{txt}
{com}. label define cohLab 0 "control" 1 "test"
{txt}
{com}. label values cohort cohLab
{txt}
{com}. 
. 
. 
. //Places majors into bins
. gen majType = .
{txt}(19020 missing values generated)

{com}. //Humanities: Area Studies (5) English (14) Art (15) Language (16) History (17)
. //              Interdisciplinary Studies (19) Philosophy (23) Theology (33)
. replace majType = 0 if inlist(maj, 5, 14, 15, 16, 17, 19, 23, 33)
{txt}(415 real changes made)

{com}. //STEM: Agriculture (1) Architecture (4) Biology (6) CS(9) Engineering (13) 
. //              Math (20) Physics (24)
. replace majType = 1 if inlist(maj, 1, 4, 6, 9, 13, 20, 24)
{txt}(1178 real changes made)

{com}. //Social Science: Anthropology(2) Archaeology (3) Economics (11) Home Ec (18)
. //              Political Science (25) Psychology (30) Sociology (31)
. replace majType = 2 if inlist(maj, 2, 3, 11, 18, 25, 30, 31)
{txt}(562 real changes made)

{com}. //Professional: Communications (8) Criminology (10) Education (12)
. //              Nursing (21) Other Health (22) Pre-Dental/Law/Med/Vet (26-29)
. //              Social Work (32)
. replace majType = 3 if inlist(maj, 7, 8, 10, 12, 21, 22, 26, 27, 28, 29, 32)
{txt}(3550 real changes made)

{com}. //Business: Business (7)
. replace majType = 4 if maj == 7
{txt}(1126 real changes made)

{com}. 
. assert missing(majType) == missing(maj) | maj == 0 | maj == 99
{txt}
{com}. 
. label values majType majTypeLab
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. 
. //Need many:one due to siblings
. //Assertion guarantees all children have parental incomes
. //Drop those women without children in college
. merge m:1 mid year using `parInc', assert(match using) keep(match) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          19,020{txt}  
{col 5}{hline 41}

{com}. 
. cd ../Tables/Code
{res}C:\Users\gmoor\Desktop\honors\Tables\Code
{txt}
{com}. do tables
{txt}
{com}. /*
> Makes tables
> */
. 
. //Creates table in Stata window
. tabulate year, sum(loan)

            {txt}{c |}           Summary of loan
       year {c |}        Mean   Std. Dev.       Freq.
{hline 12}{c +}{hline 36}
          0 {c |}  {res} 1397.0552    2572.465         344
  {txt}        2 {c |}  {res} 1591.2508   3410.6981         602
  {txt}        4 {c |}  {res} 2263.8759   5329.7454         822
  {txt}        6 {c |}  {res} 2297.6092   4886.8551         980
  {txt}        8 {c |}  {res}  3236.428   6566.6597        1173
  {txt}       10 {c |}  {res} 4216.5726   13073.263        1336
{txt}{hline 12}{c +}{hline 36}
      Total {c |}  {res} 2849.6774   8038.1165        5257
{txt}
{com}. //Writes table to loanStats.tex
. quietly tabout year using ../Output/loanStats.tex, ///
>         style(tex) ///Forces tex output
>         sum c(mean loan sd loan count loan) ///Marks as summary table (two-way)
>         replace //Replaces previous version
{txt}
{com}. 
. //Creates table in Stata window
. tabulate sex race

           {txt}{c |}   RACE OF CHILD (FROM MOTHERS
    SEX OF {c |}           SCREENER 79)
     CHILD {c |}  HISPANIC      BLACK  NON-BLACK {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
      MALE {c |}{res}     1,710      2,184      4,248 {txt}{c |}{res}     8,142 
{txt}    FEMALE {c |}{res}     2,094      3,876      4,908 {txt}{c |}{res}    10,878 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}     3,804      6,060      9,156 {txt}{c |}{res}    19,020 

{txt}
{com}. quietly tabout sex race using ../Output/raceStats.tex, ///
>         sum c(mean recloan mean loan sd loan count loan) ///
>         style(tex) replace
{txt}
{com}. 
. //Distribution of income
. hist parInc, freq
{txt}(bin={res}41{txt}, start={res}0{txt}, width={res}11706.902{txt})
{res}{txt}
{com}. graph export ../Output/parIncHist.eps, replace
{txt}(file ../Output/parIncHist.eps written in EPS format)

{com}. graph export ../Output/parIncHist.png, replace
{txt}(file ../Output/parIncHist.png written in PNG format)

{com}. 
. //Student debt
. hist loan if recloan, freq
{txt}(bin={res}33{txt}, start={res}0{txt}, width={res}12121.212{txt})
{res}{txt}
{com}. graph export ../Output/loanHist.eps, replace
{txt}(file ../Output/loanHist.eps written in EPS format)

{com}. graph export ../Output/loanHist.png, replace
{txt}(file ../Output/loanHist.png written in PNG format)

{com}. 
. //Student debt
. tabulate region

       {txt}region {c |}      Freq.     Percent        Cum.
{hline 14}{c +}{hline 35}
    NORTHEAST {c |}{res}      1,845       12.74       12.74
{txt}NORTH CENTRAL {c |}{res}      3,882       26.80       39.54
{txt}        SOUTH {c |}{res}      5,983       41.31       80.85
{txt}         WEST {c |}{res}      2,773       19.15      100.00
{txt}{hline 14}{c +}{hline 35}
        Total {c |}{res}     14,483      100.00
{txt}
{com}. quietly tabout region using ../Output/regionStats.tex, ///
>         style(tex) replace 
{txt}
{com}. 
. //Major frequency
. graph pie, over(majType) plabel(_all sum)
{res}{txt}
{com}. graph export ../Output/majPie.png, replace
{txt}(file ../Output/majPie.png written in PNG format)

{com}. 
. //Debt distribution by major
. graph box loan if recloan, over(majType)
{res}{txt}
{com}. graph export ../Output/DebtbyMajType.png, replace
{txt}(file ../Output/DebtbyMajType.png written in PNG format)

{com}. graph box loan if recloan, over(majType) noout
{res}{txt}
{com}. graph export ../Output/DebtbyMajTypeNoOut.png, replace
{txt}(file ../Output/DebtbyMajTypeNoOut.png written in PNG format)

{com}. 
{txt}end of do-file

{com}. 
. cd ../../Regressions/Code
{res}C:\Users\gmoor\Desktop\honors\Regressions\Code
{txt}
{com}. do regs
{txt}
{com}. //Works both with drop and without drop
. //without drop is slightly stronger
. keep if 4 <= year & year <=8
{txt}(9510 observations deleted)

{com}. 
. //Calculates log of loans
. gen lloan = ln(loan)
{txt}(8304 missing values generated)

{com}. 
. //Dummies for each major
. gen busMaj = maj == 7
{txt}
{com}. gen artMaj = maj == 15
{txt}
{com}. gen eduMaj = maj == 12
{txt}
{com}. gen  csMaj = maj == 17
{txt}
{com}. 
. //Add birth year as control
. //Introduce second stage
. 
. //Linear estimator
. reg loan year cohort parInc i.race i.sex i.region

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}    2416
{txt}{hline 13}{char +}{hline 30}           F(  9,  2406) ={res}    7.11
    {txt}   Model {char |} {res} 2.0751e+09     9   230569488           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 7.8053e+10  2406  32440916.6           {txt}R-squared     = {res} 0.0259
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0223
    {txt}   Total {char |} {res} 8.0128e+10  2415  33179283.9           {txt}Root MSE      = {res} 5695.7

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2}-10.79163{col 38}{space 2}  149.634{col 49}{space 1}   -0.07{col 58}{space 3}0.943{col 66}{space 4}-304.2165{col 79}{space 3} 282.6332
{txt}{space 18}cohort {c |}{col 26}{res}{space 2} 998.2084{col 38}{space 2} 490.8315{col 49}{space 1}    2.03{col 58}{space 3}0.042{col 66}{space 4} 35.71223{col 79}{space 3} 1960.705
{txt}{space 18}parInc {c |}{col 26}{res}{space 2} .0013217{col 38}{space 2} .0016902{col 49}{space 1}    0.78{col 58}{space 3}0.434{col 66}{space 4}-.0019926{col 79}{space 3} .0046361
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 960.4748{col 38}{space 2} 352.0566{col 49}{space 1}    2.73{col 58}{space 3}0.006{col 66}{space 4} 270.1093{col 79}{space 3}  1650.84
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 1028.298{col 38}{space 2} 325.2827{col 49}{space 1}    3.16{col 58}{space 3}0.002{col 66}{space 4} 390.4346{col 79}{space 3} 1666.161
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-62.53431{col 38}{space 2} 239.9294{col 49}{space 1}   -0.26{col 58}{space 3}0.794{col 66}{space 4} -533.024{col 79}{space 3} 407.9554
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-793.3257{col 38}{space 2} 416.4376{col 49}{space 1}   -1.91{col 58}{space 3}0.057{col 66}{space 4}-1609.939{col 79}{space 3} 23.28777
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-1899.111{col 38}{space 2} 398.2384{col 49}{space 1}   -4.77{col 58}{space 3}0.000{col 66}{space 4}-2680.037{col 79}{space 3}-1118.185
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-1429.255{col 38}{space 2} 444.9814{col 49}{space 1}   -3.21{col 58}{space 3}0.001{col 66}{space 4}-2301.842{col 79}{space 3}-556.6688
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 2827.311{col 38}{space 2}  910.817{col 49}{space 1}    3.10{col 58}{space 3}0.002{col 66}{space 4} 1041.244{col 79}{space 3} 4613.378
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg lloan year cohort parInc i.race i.sex i.region 

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}    1008
{txt}{hline 13}{char +}{hline 30}           F(  9,   998) ={res}   12.37
    {txt}   Model {char |} {res} 82.3022731     9  9.14469701           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 737.740208   998  .739218646           {txt}R-squared     = {res} 0.1004
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0923
    {txt}   Total {char |} {res} 820.042482  1007  .814342087           {txt}Root MSE      = {res} .85978

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                   lloan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2} .0519377{col 38}{space 2} .0351805{col 49}{space 1}    1.48{col 58}{space 3}0.140{col 66}{space 4}-.0170985{col 79}{space 3} .1209739
{txt}{space 18}cohort {c |}{col 26}{res}{space 2} .1185178{col 38}{space 2} .1159724{col 49}{space 1}    1.02{col 58}{space 3}0.307{col 66}{space 4}-.1090599{col 79}{space 3} .3460956
{txt}{space 18}parInc {c |}{col 26}{res}{space 2} 2.83e-06{col 38}{space 2} 4.94e-07{col 49}{space 1}    5.73{col 58}{space 3}0.000{col 66}{space 4} 1.86e-06{col 79}{space 3} 3.80e-06
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} .1575108{col 38}{space 2} .0848095{col 49}{space 1}    1.86{col 58}{space 3}0.064{col 66}{space 4}-.0089147{col 79}{space 3} .3239363
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} .1925263{col 38}{space 2} .0828079{col 49}{space 1}    2.32{col 58}{space 3}0.020{col 66}{space 4} .0300287{col 79}{space 3}  .355024
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-.1107434{col 38}{space 2} .0567996{col 49}{space 1}   -1.95{col 58}{space 3}0.051{col 66}{space 4}-.2222036{col 79}{space 3} .0007169
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.1827984{col 38}{space 2} .0882972{col 49}{space 1}   -2.07{col 58}{space 3}0.039{col 66}{space 4}-.3560679{col 79}{space 3}-.0095289
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-.3545189{col 38}{space 2} .0892406{col 49}{space 1}   -3.97{col 58}{space 3}0.000{col 66}{space 4}-.5296396{col 79}{space 3}-.1793981
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2} .0335306{col 38}{space 2} .1050585{col 49}{space 1}    0.32{col 58}{space 3}0.750{col 66}{space 4}-.1726303{col 79}{space 3} .2396916
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 7.908263{col 38}{space 2} .2142915{col 49}{space 1}   36.90{col 58}{space 3}0.000{col 66}{space 4} 7.487749{col 79}{space 3} 8.328776
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. //Tobit estimator
. tobit loan year cohort parInc i.race i.sex i.region if !missing(recloan), ll
{res}
{txt}Tobit regression{col 51}Number of obs{col 67}= {res}      2416
{txt}{col 51}LR chi2({res}9{txt}){col 67}= {res}     81.23
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-11570.519{txt}{col 51}Pseudo R2{col 67}= {res}    0.0035

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                    loan{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}year {c |}{col 26}{res}{space 2}-105.3161{col 38}{space 2} 325.2495{col 49}{space 1}   -0.32{col 58}{space 3}0.746{col 66}{space 4}-743.1142{col 79}{space 3} 532.4819
{txt}{space 18}cohort {c |}{col 26}{res}{space 2} 1995.153{col 38}{space 2} 1067.007{col 49}{space 1}    1.87{col 58}{space 3}0.062{col 66}{space 4}-97.19456{col 79}{space 3}   4087.5
{txt}{space 18}parInc {c |}{col 26}{res}{space 2}-.0059226{col 38}{space 2} .0038816{col 49}{space 1}   -1.53{col 58}{space 3}0.127{col 66}{space 4}-.0135341{col 79}{space 3}  .001689
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} 2804.624{col 38}{space 2} 773.0503{col 49}{space 1}    3.63{col 58}{space 3}0.000{col 66}{space 4} 1288.711{col 79}{space 3} 4320.537
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} 2471.717{col 38}{space 2} 725.3897{col 49}{space 1}    3.41{col 58}{space 3}0.001{col 66}{space 4} 1049.264{col 79}{space 3} 3894.169
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} 369.8625{col 38}{space 2} 520.0961{col 49}{space 1}    0.71{col 58}{space 3}0.477{col 66}{space 4}-650.0199{col 79}{space 3} 1389.745
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-973.8426{col 38}{space 2} 859.9882{col 49}{space 1}   -1.13{col 58}{space 3}0.258{col 66}{space 4}-2660.236{col 79}{space 3} 712.5513
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-4009.312{col 38}{space 2}  838.552{col 49}{space 1}   -4.78{col 58}{space 3}0.000{col 66}{space 4}-5653.671{col 79}{space 3}-2364.954
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-4039.017{col 38}{space 2} 957.9959{col 49}{space 1}   -4.22{col 58}{space 3}0.000{col 66}{space 4}-5917.599{col 79}{space 3}-2160.434
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-2253.908{col 38}{space 2}     1978{col 49}{space 1}   -1.14{col 58}{space 3}0.255{col 66}{space 4}-6132.667{col 79}{space 3} 1624.851
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                  /sigma {c |}{col 26}{res}{space 2} 10598.07{col 38}{space 2} 260.8748{col 66}{space 4} 10086.51{col 79}{space 3} 11109.63
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Obs. summary:{col 18}{res}     1408{col 28}{txt} left-censored observations at loan<={res}0
{txt}{col 18}{res}     1008{col 28}{txt}    uncensored observations
{col 18}{res}        0{col 28}{txt}right-censored observations

{com}. //Get predicted tobit values
. predict loanHat if !missing(recloan) & !missing(loan), ystar(0, .)
{txt}(7094 missing values generated)

{com}. 
. 
. //Creates dummies for each type of major
. gen humMajType = majType == 0
{txt}
{com}. gen stemMajType = majType == 1
{txt}
{com}. gen ssMajType = majType == 2
{txt}
{com}. gen profMajType = majType == 3
{txt}
{com}. gen busMajType = majType == 4
{txt}
{com}. 
. //Use fitted tobit values as an instrument
. ivprobit busMajType year i.race i.sex i.region parInc (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:  -1041.17}  
Iteration 1:{space 3}log likelihood = {res:-1029.6167}  
Iteration 2:{space 3}log likelihood = {res:-1029.5961}  
Iteration 3:{space 3}log likelihood = {res:-1029.5961}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-25344.391}  
Iteration 1:{space 3}log likelihood = {res:-25344.196}  
Iteration 2:{space 3}log likelihood = {res:-25343.965}  
Iteration 3:{space 3}log likelihood = {res:-25343.707}  
Iteration 4:{space 3}log likelihood = {res:-25343.644}  
Iteration 5:{space 3}log likelihood = {res:-25343.632}  
Iteration 6:{space 3}log likelihood = {res:-25343.629}  
Iteration 7:{space 3}log likelihood = {res:-25343.629}  
Iteration 8:{space 3}log likelihood = {res:-25343.629}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}      2416
{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}     52.08
{txt}Log likelihood = {res}-25343.629{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2}-.0001126{col 38}{space 2} .0000605{col 49}{space 1}   -1.86{col 58}{space 3}0.063{col 66}{space 4}-.0002312{col 79}{space 3} 5.95e-06
{txt}{space 20}year {c |}{col 26}{res}{space 2} .0408262{col 38}{space 2} .0208133{col 49}{space 1}    1.96{col 58}{space 3}0.050{col 66}{space 4} .0000329{col 79}{space 3} .0816194
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} .2528003{col 38}{space 2} .0835899{col 49}{space 1}    3.02{col 58}{space 3}0.002{col 66}{space 4} .0889671{col 79}{space 3} .4166335
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} .1181057{col 38}{space 2} .0998471{col 49}{space 1}    1.18{col 58}{space 3}0.237{col 66}{space 4} -.077591{col 79}{space 3} .3138025
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} -.181942{col 38}{space 2} .0805564{col 49}{space 1}   -2.26{col 58}{space 3}0.024{col 66}{space 4}-.3398296{col 79}{space 3}-.0240544
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.2253044{col 38}{space 2} .0957806{col 49}{space 1}   -2.35{col 58}{space 3}0.019{col 66}{space 4}-.4130308{col 79}{space 3}-.0375779
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-.3411977{col 38}{space 2} .1130128{col 49}{space 1}   -3.02{col 58}{space 3}0.003{col 66}{space 4}-.5626987{col 79}{space 3}-.1196967
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.3465074{col 38}{space 2} .1048706{col 49}{space 1}   -3.30{col 58}{space 3}0.001{col 66}{space 4}-.5520499{col 79}{space 3}-.1409648
{txt}{space 24} {c |}
{space 18}parInc {c |}{col 26}{res}{space 2} 3.70e-07{col 38}{space 2} 3.94e-07{col 49}{space 1}    0.94{col 58}{space 3}0.348{col 66}{space 4}-4.02e-07{col 79}{space 3} 1.14e-06
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.5324856{col 38}{space 2} .3760557{col 49}{space 1}   -1.42{col 58}{space 3}0.157{col 66}{space 4}-1.269541{col 79}{space 3} .2045701
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2} .7358835{col 38}{space 2} .5744945{col 49}{space 1}    1.28{col 58}{space 3}0.200{col 66}{space 4}-.3901051{col 79}{space 3} 1.861872
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.645133{col 38}{space 2} .0143859{col 49}{space 1}  600.95{col 58}{space 3}0.000{col 66}{space 4} 8.616937{col 79}{space 3} 8.673328
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2} .6266516{col 38}{space 2}  .348895{col 66}{space 4}-.3714508{col 79}{space 3} .9528515
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2}  5682.42{col 38}{space 2} 81.74664{col 66}{space 4} 5524.438{col 79}{space 3} 5844.921
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 91}Instrumented:{space 2}loan{p_end}
{p 0 15 91}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region parInc loanHat{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    1.64{txt}{col 59}Prob > chi2 = {res}0.2002
{txt}
{com}. ivprobit stemMajType year i.race i.sex i.region parInc (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1037.7688}  
Iteration 1:{space 3}log likelihood = {res:-984.24203}  
Iteration 2:{space 3}log likelihood = {res:-983.84527}  
Iteration 3:{space 3}log likelihood = {res:-983.84521}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: -25298.64}  
Iteration 1:{space 3}log likelihood = {res:-25298.622}  
Iteration 2:{space 3}log likelihood = {res:-25298.602}  
Iteration 3:{space 3}log likelihood = {res:  -25298.6}  
Iteration 4:{space 3}log likelihood = {res:-25298.598}  
Iteration 5:{space 3}log likelihood = {res:-25298.598}  
Iteration 6:{space 3}log likelihood = {res:-25298.598}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}      2416
{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}    106.96
{txt}Log likelihood = {res}-25298.598{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2}-.0000262{col 38}{space 2}  .000115{col 49}{space 1}   -0.23{col 58}{space 3}0.820{col 66}{space 4}-.0002515{col 79}{space 3} .0001991
{txt}{space 20}year {c |}{col 26}{res}{space 2}-.0100162{col 38}{space 2} .0370357{col 49}{space 1}   -0.27{col 58}{space 3}0.787{col 66}{space 4}-.0826049{col 79}{space 3} .0625725
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2}-.1837983{col 38}{space 2}   .16886{col 49}{space 1}   -1.09{col 58}{space 3}0.276{col 66}{space 4}-.5147579{col 79}{space 3} .1471613
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2}-.0716404{col 38}{space 2} .1583018{col 49}{space 1}   -0.45{col 58}{space 3}0.651{col 66}{space 4}-.3819063{col 79}{space 3} .2386255
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-.5943414{col 38}{space 2} .0944381{col 49}{space 1}   -6.29{col 58}{space 3}0.000{col 66}{space 4}-.7794366{col 79}{space 3}-.4092462
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.0183924{col 38}{space 2} .1429265{col 49}{space 1}   -0.13{col 58}{space 3}0.898{col 66}{space 4}-.2985232{col 79}{space 3} .2617384
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2} .0764741{col 38}{space 2} .2530137{col 49}{space 1}    0.30{col 58}{space 3}0.762{col 66}{space 4}-.4194236{col 79}{space 3} .5723718
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.2006259{col 38}{space 2} .1829907{col 49}{space 1}   -1.10{col 58}{space 3}0.273{col 66}{space 4} -.559281{col 79}{space 3} .1580292
{txt}{space 24} {c |}
{space 18}parInc {c |}{col 26}{res}{space 2} 1.73e-07{col 38}{space 2} 4.73e-07{col 49}{space 1}    0.37{col 58}{space 3}0.714{col 66}{space 4}-7.53e-07{col 79}{space 3} 1.10e-06
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.4709126{col 38}{space 2} .2972212{col 49}{space 1}   -1.58{col 58}{space 3}0.113{col 66}{space 4}-1.053455{col 79}{space 3} .1116302
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2} .1978562{col 38}{space 2} .6735571{col 49}{space 1}    0.29{col 58}{space 3}0.769{col 66}{space 4}-1.122292{col 79}{space 3} 1.518004
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.645133{col 38}{space 2} .0143859{col 49}{space 1}  600.95{col 58}{space 3}0.000{col 66}{space 4} 8.616937{col 79}{space 3} 8.673328
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2} .1953141{col 38}{space 2} .6478625{col 66}{space 4}-.8083645{col 79}{space 3} .9083492
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2}  5682.42{col 38}{space 2} 81.74664{col 66}{space 4} 5524.438{col 79}{space 3} 5844.921
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 91}Instrumented:{space 2}loan{p_end}
{p 0 15 91}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region parInc loanHat{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    0.09{txt}{col 59}Prob > chi2 = {res}0.7690
{txt}
{com}. ivprobit ssMajType year i.race i.sex i.region parInc (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-612.48125}  
Iteration 1:{space 3}log likelihood = {res:-597.85962}  
Iteration 2:{space 3}log likelihood = {res:-597.64421}  
Iteration 3:{space 3}log likelihood = {res:-597.64416}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-24912.439}  
Iteration 1:{space 3}log likelihood = {res:-24912.347}  
Iteration 2:{space 3}log likelihood = {res:-24912.222}  
Iteration 3:{space 3}log likelihood = {res:-24912.118}  
Iteration 4:{space 3}log likelihood = {res:-24912.027}  (not concave)
Iteration 5:{space 3}log likelihood = {res:-24912.018}  
Iteration 6:{space 3}log likelihood = {res:-24912.008}  
Iteration 7:{space 3}log likelihood = {res:-24912.002}  
Iteration 8:{space 3}log likelihood = {res:-24912.002}  
Iteration 9:{space 3}log likelihood = {res:-24912.001}  
Iteration 10:{space 2}log likelihood = {res:-24912.001}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}      2416
{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}     65.14
{txt}Log likelihood = {res}-24912.001{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2} .0001092{col 38}{space 2} .0000768{col 49}{space 1}    1.42{col 58}{space 3}0.155{col 66}{space 4}-.0000414{col 79}{space 3} .0002598
{txt}{space 20}year {c |}{col 26}{res}{space 2}-.0224322{col 38}{space 2} .0306223{col 49}{space 1}   -0.73{col 58}{space 3}0.464{col 66}{space 4}-.0824507{col 79}{space 3} .0375863
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} .0215445{col 38}{space 2} .1697819{col 49}{space 1}    0.13{col 58}{space 3}0.899{col 66}{space 4} -.311222{col 79}{space 3} .3543109
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} .0503055{col 38}{space 2} .1793646{col 49}{space 1}    0.28{col 58}{space 3}0.779{col 66}{space 4}-.3012427{col 79}{space 3} .4018538
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} .0895262{col 38}{space 2} .0758101{col 49}{space 1}    1.18{col 58}{space 3}0.238{col 66}{space 4}-.0590588{col 79}{space 3} .2381113
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.2764798{col 38}{space 2} .2404372{col 49}{space 1}   -1.15{col 58}{space 3}0.250{col 66}{space 4}-.7477281{col 79}{space 3} .1947685
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-.1946897{col 38}{space 2} .3341309{col 49}{space 1}   -0.58{col 58}{space 3}0.560{col 66}{space 4}-.8495743{col 79}{space 3} .4601949
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.0992817{col 38}{space 2} .2465885{col 49}{space 1}   -0.40{col 58}{space 3}0.687{col 66}{space 4}-.5825862{col 79}{space 3} .3840229
{txt}{space 24} {c |}
{space 18}parInc {c |}{col 26}{res}{space 2} 6.12e-07{col 38}{space 2} 6.10e-07{col 49}{space 1}    1.00{col 58}{space 3}0.315{col 66}{space 4}-5.83e-07{col 79}{space 3} 1.81e-06
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-1.303432{col 38}{space 2} .4116076{col 49}{space 1}   -3.17{col 58}{space 3}0.002{col 66}{space 4}-2.110169{col 79}{space 3}-.4966962
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2} -.706127{col 38}{space 2} .7018057{col 49}{space 1}   -1.01{col 58}{space 3}0.314{col 66}{space 4}-2.081641{col 79}{space 3} .6693869
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.645132{col 38}{space 2} .0143859{col 49}{space 1}  600.95{col 58}{space 3}0.000{col 66}{space 4} 8.616937{col 79}{space 3} 8.673328
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2}-.6082424{col 38}{space 2} .4421665{col 66}{space 4}-.9693638{col 79}{space 3} .5845764
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2}  5682.42{col 38}{space 2} 81.74657{col 66}{space 4} 5524.437{col 79}{space 3} 5844.921
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 91}Instrumented:{space 2}loan{p_end}
{p 0 15 91}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region parInc loanHat{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    1.01{txt}{col 59}Prob > chi2 = {res}0.3143
{txt}
{com}. ivprobit profMajType year i.race i.sex i.region parInc (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1553.7036}  
Iteration 1:{space 3}log likelihood = {res:-1431.9142}  
Iteration 2:{space 3}log likelihood = {res:-1431.1868}  
Iteration 3:{space 3}log likelihood = {res:-1431.1868}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-25745.982}  
Iteration 1:{space 3}log likelihood = {res:-25745.829}  
Iteration 2:{space 3}log likelihood = {res:-25745.719}  
Iteration 3:{space 3}log likelihood = {res:-25745.644}  
Iteration 4:{space 3}log likelihood = {res: -25745.64}  
Iteration 5:{space 3}log likelihood = {res:-25745.635}  
Iteration 6:{space 3}log likelihood = {res:-25745.635}  
Iteration 7:{space 3}log likelihood = {res:-25745.635}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}      2416
{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}    301.40
{txt}Log likelihood = {res}-25745.635{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2} .0000774{col 38}{space 2} .0000787{col 49}{space 1}    0.98{col 58}{space 3}0.325{col 66}{space 4}-.0000769{col 79}{space 3} .0002317
{txt}{space 20}year {c |}{col 26}{res}{space 2} .0002735{col 38}{space 2} .0297695{col 49}{space 1}    0.01{col 58}{space 3}0.993{col 66}{space 4}-.0580737{col 79}{space 3} .0586206
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2}-.0260562{col 38}{space 2} .1181159{col 49}{space 1}   -0.22{col 58}{space 3}0.825{col 66}{space 4}-.2575592{col 79}{space 3} .2054468
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2}-.1302504{col 38}{space 2} .1011516{col 49}{space 1}   -1.29{col 58}{space 3}0.198{col 66}{space 4}-.3285039{col 79}{space 3} .0680031
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2} .7187437{col 38}{space 2} .1740569{col 49}{space 1}    4.13{col 58}{space 3}0.000{col 66}{space 4} .3775984{col 79}{space 3} 1.059889
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}  .415806{col 38}{space 2} .1002739{col 49}{space 1}    4.15{col 58}{space 3}0.000{col 66}{space 4} .2192728{col 79}{space 3} .6123391
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2} .4711049{col 38}{space 2} .1173323{col 49}{space 1}    4.02{col 58}{space 3}0.000{col 66}{space 4} .2411378{col 79}{space 3} .7010721
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2} .3160764{col 38}{space 2} .1211113{col 49}{space 1}    2.61{col 58}{space 3}0.009{col 66}{space 4} .0787027{col 79}{space 3} .5534502
{txt}{space 24} {c |}
{space 18}parInc {c |}{col 26}{res}{space 2}-1.32e-06{col 38}{space 2} 4.44e-07{col 49}{space 1}   -2.97{col 58}{space 3}0.003{col 66}{space 4}-2.19e-06{col 79}{space 3}-4.47e-07
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-1.248745{col 38}{space 2} .2127113{col 49}{space 1}   -5.87{col 58}{space 3}0.000{col 66}{space 4}-1.665652{col 79}{space 3}-.8318384
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2}-.4646546{col 38}{space 2} .5533376{col 49}{space 1}   -0.84{col 58}{space 3}0.401{col 66}{space 4}-1.549176{col 79}{space 3} .6198671
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.645133{col 38}{space 2} .0143859{col 49}{space 1}  600.95{col 58}{space 3}0.000{col 66}{space 4} 8.616937{col 79}{space 3} 8.673328
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2}-.4338702{col 38}{space 2} .4491754{col 66}{space 4}-.9136495{col 79}{space 3} .5510355
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2}  5682.42{col 38}{space 2} 81.74665{col 66}{space 4} 5524.438{col 79}{space 3} 5844.921
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 91}Instrumented:{space 2}loan{p_end}
{p 0 15 91}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region parInc loanHat{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    0.71{txt}{col 59}Prob > chi2 = {res}0.4011
{txt}
{com}. ivprobit humMajType year i.race i.sex i.region parInc (loan = loanHat) if !missing(recloan)

{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-540.17663}  
Iteration 1:{space 3}log likelihood = {res: -528.1223}  
Iteration 2:{space 3}log likelihood = {res:-527.98792}  
Iteration 3:{space 3}log likelihood = {res: -527.9879}  
{res}
{txt}Fitting full model
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-24842.783}  
Iteration 1:{space 3}log likelihood = {res:-24842.698}  
Iteration 2:{space 3}log likelihood = {res:-24842.506}  
Iteration 3:{space 3}log likelihood = {res:-24842.364}  
Iteration 4:{space 3}log likelihood = {res:-24842.349}  
Iteration 5:{space 3}log likelihood = {res:-24842.309}  
Iteration 6:{space 3}log likelihood = {res:-24842.307}  
Iteration 7:{space 3}log likelihood = {res:-24842.306}  
Iteration 8:{space 3}log likelihood = {res:-24842.306}  
{res}
{txt}Probit model with endogenous regressors{col 51}Number of obs{col 67}= {res}      2416
{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}     57.81
{txt}Log likelihood = {res}-24842.306{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      z{col 58}   P>|z|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}loan {c |}{col 26}{res}{space 2}-.0001109{col 38}{space 2} .0000749{col 49}{space 1}   -1.48{col 58}{space 3}0.138{col 66}{space 4}-.0002577{col 79}{space 3} .0000358
{txt}{space 20}year {c |}{col 26}{res}{space 2} .0044308{col 38}{space 2} .0368873{col 49}{space 1}    0.12{col 58}{space 3}0.904{col 66}{space 4} -.067867{col 79}{space 3} .0767286
{txt}{space 24} {c |}
{space 20}race {c |}
{space 18}BLACK  {c |}{col 26}{res}{space 2} .0435486{col 38}{space 2} .1487245{col 49}{space 1}    0.29{col 58}{space 3}0.770{col 66}{space 4}-.2479461{col 79}{space 3} .3350433
{txt}NON-BLACK, NON-HISPANIC  {c |}{col 26}{res}{space 2} .1949575{col 38}{space 2}  .102771{col 49}{space 1}    1.90{col 58}{space 3}0.058{col 66}{space 4}  -.00647{col 79}{space 3}  .396385
{txt}{space 24} {c |}
{space 21}sex {c |}
{space 17}FEMALE  {c |}{col 26}{res}{space 2}-.2206119{col 38}{space 2} .1161118{col 49}{space 1}   -1.90{col 58}{space 3}0.057{col 66}{space 4}-.4481868{col 79}{space 3} .0069631
{txt}{space 24} {c |}
{space 18}region {c |}
{space 10}NORTH CENTRAL  {c |}{col 26}{res}{space 2}-.1556698{col 38}{space 2} .1220647{col 49}{space 1}   -1.28{col 58}{space 3}0.202{col 66}{space 4}-.3949122{col 79}{space 3} .0835727
{txt}{space 18}SOUTH  {c |}{col 26}{res}{space 2}-.2555905{col 38}{space 2} .1627758{col 49}{space 1}   -1.57{col 58}{space 3}0.116{col 66}{space 4}-.5746251{col 79}{space 3} .0634441
{txt}{space 19}WEST  {c |}{col 26}{res}{space 2}-.1461024{col 38}{space 2} .1649824{col 49}{space 1}   -0.89{col 58}{space 3}0.376{col 66}{space 4}-.4694621{col 79}{space 3} .1772572
{txt}{space 24} {c |}
{space 18}parInc {c |}{col 26}{res}{space 2} 8.64e-07{col 38}{space 2} 5.10e-07{col 49}{space 1}    1.69{col 58}{space 3}0.090{col 66}{space 4}-1.35e-07{col 79}{space 3} 1.86e-06
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.8056772{col 38}{space 2} .5989842{col 49}{space 1}   -1.35{col 58}{space 3}0.179{col 66}{space 4}-1.979665{col 79}{space 3} .3683101
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 /athrho {c |}{col 26}{res}{space 2}  .771496{col 38}{space 2} .7190149{col 49}{space 1}    1.07{col 58}{space 3}0.283{col 66}{space 4}-.6377473{col 79}{space 3} 2.180739
{txt}                /lnsigma {c |}{col 26}{res}{space 2} 8.645132{col 38}{space 2} .0143859{col 49}{space 1}  600.95{col 58}{space 3}0.000{col 66}{space 4} 8.616936{col 79}{space 3} 8.673328
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                     rho{col 26}{c |}{res}{space 2} .6477985{col 38}{space 2} .4172854{col 66}{space 4}-.5633638{col 79}{space 3} .9748025
{col 1}{txt}                   sigma{col 26}{c |}{res}{space 2} 5682.419{col 38}{space 2} 81.74659{col 66}{space 4} 5524.436{col 79}{space 3} 5844.919
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 15 91}Instrumented:{space 2}loan{p_end}
{p 0 15 91}Instruments:{space 3}year 2.race 3.race 2.sex 2.region 3.region 4.region parInc loanHat{p_end}
{hline 90}
Wald test of exogeneity (/athrho = 0): chi2({res}1{txt}) = {res}    1.15{txt}{col 59}Prob > chi2 = {res}0.2833
{txt}
{com}. 
{txt}end of do-file

{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoor\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. hist loan if recloan, freq
{txt}(bin={res}30{txt}, start={res}100{txt}, width={res}2830{txt})
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoor\Desktop\honors\Tables\Code\tables.do"
{txt}
{com}. /*
> Makes tables
> */
. 
. //Creates table in Stata window
. tabulate year, sum(loan)

            {txt}{c |}           Summary of loan
       year {c |}        Mean   Std. Dev.       Freq.
{hline 12}{c +}{hline 36}
          4 {c |}  {res} 2263.8759   5329.7454         822
  {txt}        6 {c |}  {res} 2297.6092   4886.8551         980
  {txt}        8 {c |}  {res}  3236.428   6566.6597        1173
{txt}{hline 12}{c +}{hline 36}
      Total {c |}  {res} 2658.4514   5737.0827        2975
{txt}
{com}. //Writes table to loanStats.tex
. quietly tabout year using ../Output/loanStats.tex, ///
>         style(tex) ///Forces tex output
>         sum c(mean loan sd loan count loan) ///Marks as summary table (two-way)
>         replace //Replaces previous version
{err}File ../Output/loanStats.tex
is already open inside another application.
Please close it before running tabout.
{txt}
{com}. 
. //Creates table in Stata window
. tabulate sex race

           {txt}{c |}   RACE OF CHILD (FROM MOTHERS
    SEX OF {c |}           SCREENER 79)
     CHILD {c |}  HISPANIC      BLACK  NON-BLACK {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
      MALE {c |}{res}       855      1,092      2,124 {txt}{c |}{res}     4,071 
{txt}    FEMALE {c |}{res}     1,047      1,938      2,454 {txt}{c |}{res}     5,439 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}     1,902      3,030      4,578 {txt}{c |}{res}     9,510 

{txt}
{com}. quietly tabout sex race using ../Output/raceStats.tex, ///
>         sum c(mean recloan mean loan sd loan count loan) ///
>         style(tex) replace
{err}File ../Output/raceStats.tex
is already open inside another application.
Please close it before running tabout.
{txt}
{com}. 
. //Distribution of income
. hist parInc, freq
{txt}(bin={res}38{txt}, start={res}0{txt}, width={res}12631.132{txt})
{res}{txt}
{com}. graph export ../Output/parIncHist.eps, replace
{txt}(note: file ../Output/parIncHist.eps not found)
{err}{p 0 4 2}
file ../Output/parIncHist.eps
could not be opened
{p_end}
{txt}{search r(603):r(603);}

end of do-file

{search r(603):r(603);}

{com}. ls
{txt}  <dir>  12/04/18 21:19  {res}.                 
{txt}  <dir>  12/04/18 21:19  {res}..                
{txt}   1.1k  12/04/18 19:51  {res}master.smcl       
{txt}   1.3k  12/04/18 21:19  {res}regs.do           

{com}. cd ..
{res}C:\Users\gmoor\Desktop\honors\Regressions

{com}. ls
{txt}  <dir>  12/04/18 17:40  {res}.                 
{txt}  <dir>  12/04/18 17:40  {res}..                
{txt}  <dir>  12/04/18 21:19  {res}Code              

{com}. cd ..
{res}C:\Users\gmoor\Desktop\honors

{com}. cd Tables
{res}C:\Users\gmoor\Desktop\honors\Tables

{com}. ls
{txt}  <dir>  10/30/18 18:05  {res}.                 
{txt}  <dir>  10/30/18 18:05  {res}..                
{txt}  <dir>  12/04/18 21:50  {res}Code              
{txt}  <dir>  12/04/18 21:50  {res}Output            

{com}. cd Code
{res}C:\Users\gmoor\Desktop\honors\Tables\Code

{com}. ls
{txt}  <dir>  12/04/18 21:50  {res}.                 
{txt}  <dir>  12/04/18 21:50  {res}..                
{txt}   1.2k  12/04/18 21:50  {res}tables.do         

{com}. do tables
{txt}
{com}. /*
> Makes tables
> */
. 
. //Creates table in Stata window
. tabulate year, sum(loan)

            {txt}{c |}           Summary of loan
       year {c |}        Mean   Std. Dev.       Freq.
{hline 12}{c +}{hline 36}
          4 {c |}  {res} 2263.8759   5329.7454         822
  {txt}        6 {c |}  {res} 2297.6092   4886.8551         980
  {txt}        8 {c |}  {res}  3236.428   6566.6597        1173
{txt}{hline 12}{c +}{hline 36}
      Total {c |}  {res} 2658.4514   5737.0827        2975
{txt}
{com}. //Writes table to loanStats.tex
. quietly tabout year using ../Output/loanStats.tex, ///
>         style(tex) ///Forces tex output
>         sum c(mean loan sd loan count loan) ///Marks as summary table (two-way)
>         replace //Replaces previous version
{txt}
{com}. 
. //Creates table in Stata window
. tabulate sex race

           {txt}{c |}   RACE OF CHILD (FROM MOTHERS
    SEX OF {c |}           SCREENER 79)
     CHILD {c |}  HISPANIC      BLACK  NON-BLACK {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
      MALE {c |}{res}       855      1,092      2,124 {txt}{c |}{res}     4,071 
{txt}    FEMALE {c |}{res}     1,047      1,938      2,454 {txt}{c |}{res}     5,439 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}     1,902      3,030      4,578 {txt}{c |}{res}     9,510 

{txt}
{com}. quietly tabout sex race using ../Output/raceStats.tex, ///
>         sum c(mean recloan mean loan sd loan count loan) ///
>         style(tex) replace
{txt}
{com}. 
. //Distribution of income
. hist parInc, freq
{txt}(bin={res}38{txt}, start={res}0{txt}, width={res}12631.132{txt})
{res}{txt}
{com}. graph export ../Output/parIncHist.eps, replace
{txt}(file ../Output/parIncHist.eps written in EPS format)

{com}. graph export ../Output/parIncHist.png, replace
{txt}(file ../Output/parIncHist.png written in PNG format)

{com}. 
. //Student debt
. hist loan if recloan, freq
{txt}(bin={res}30{txt}, start={res}100{txt}, width={res}2830{txt})
{res}{txt}
{com}. graph export ../Output/loanHist.eps, replace
{txt}(file ../Output/loanHist.eps written in EPS format)

{com}. graph export ../Output/loanHist.png, replace
{txt}(file ../Output/loanHist.png written in PNG format)

{com}. 
. //Student debt
. tabulate region

       {txt}region {c |}      Freq.     Percent        Cum.
{hline 14}{c +}{hline 35}
    NORTHEAST {c |}{res}      1,077       12.87       12.87
{txt}NORTH CENTRAL {c |}{res}      2,253       26.93       39.80
{txt}        SOUTH {c |}{res}      3,448       41.21       81.02
{txt}         WEST {c |}{res}      1,588       18.98      100.00
{txt}{hline 14}{c +}{hline 35}
        Total {c |}{res}      8,366      100.00
{txt}
{com}. quietly tabout region using ../Output/regionStats.tex, ///
>         style(tex) replace 
{txt}
{com}. 
. //Major frequency
. graph pie, over(majType) plabel(_all sum)
{res}{txt}
{com}. graph export ../Output/majPie.png, replace
{txt}(file ../Output/majPie.png written in PNG format)

{com}. 
. //Debt distribution by major
. graph box loan if recloan, over(majType)
{res}{txt}
{com}. graph export ../Output/DebtbyMajType.png, replace
{txt}(file ../Output/DebtbyMajType.png written in PNG format)

{com}. graph box loan if recloan, over(majType) noout
{res}{txt}
{com}. graph export ../Output/DebtbyMajTypeNoOut.png, replace
{txt}(file ../Output/DebtbyMajTypeNoOut.png written in PNG format)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoor\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. hist loan if recloan, freq bgcolor(white)
{txt}(bin={res}30{txt}, start={res}100{txt}, width={res}2830{txt})
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoor\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. hist loan if recloan, freq graphregion(color(white))
{txt}(bin={res}30{txt}, start={res}100{txt}, width={res}2830{txt})
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do tables
{txt}
{com}. /*
> Makes tables
> */
. 
. //Creates table in Stata window
. tabulate year, sum(loan)

            {txt}{c |}           Summary of loan
       year {c |}        Mean   Std. Dev.       Freq.
{hline 12}{c +}{hline 36}
          4 {c |}  {res} 2263.8759   5329.7454         822
  {txt}        6 {c |}  {res} 2297.6092   4886.8551         980
  {txt}        8 {c |}  {res}  3236.428   6566.6597        1173
{txt}{hline 12}{c +}{hline 36}
      Total {c |}  {res} 2658.4514   5737.0827        2975
{txt}
{com}. //Writes table to loanStats.tex
. quietly tabout year using ../Output/loanStats.tex, ///
>         style(tex) ///Forces tex output
>         sum c(mean loan sd loan count loan) ///Marks as summary table (two-way)
>         replace //Replaces previous version
{txt}
{com}. 
. //Creates table in Stata window
. tabulate sex race

           {txt}{c |}   RACE OF CHILD (FROM MOTHERS
    SEX OF {c |}           SCREENER 79)
     CHILD {c |}  HISPANIC      BLACK  NON-BLACK {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
      MALE {c |}{res}       855      1,092      2,124 {txt}{c |}{res}     4,071 
{txt}    FEMALE {c |}{res}     1,047      1,938      2,454 {txt}{c |}{res}     5,439 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}     1,902      3,030      4,578 {txt}{c |}{res}     9,510 

{txt}
{com}. quietly tabout sex race using ../Output/raceStats.tex, ///
>         sum c(mean recloan mean loan sd loan count loan) ///
>         style(tex) replace
{txt}
{com}. 
. //Distribution of income
. hist parInc, freq
{txt}(bin={res}38{txt}, start={res}0{txt}, width={res}12631.132{txt})
{res}{txt}
{com}. graph export ../Output/parIncHist.eps, replace
{txt}(file ../Output/parIncHist.eps written in EPS format)

{com}. graph export ../Output/parIncHist.png, replace
{txt}(file ../Output/parIncHist.png written in PNG format)

{com}. 
. //Student debt
. hist loan if recloan, freq graphregion(color(white))
{txt}(bin={res}30{txt}, start={res}100{txt}, width={res}2830{txt})
{res}{txt}
{com}. graph export ../Output/loanHist.eps, replace
{txt}(file ../Output/loanHist.eps written in EPS format)

{com}. graph export ../Output/loanHist.png, replace
{txt}(file ../Output/loanHist.png written in PNG format)

{com}. 
. //Student debt
. tabulate region

       {txt}region {c |}      Freq.     Percent        Cum.
{hline 14}{c +}{hline 35}
    NORTHEAST {c |}{res}      1,077       12.87       12.87
{txt}NORTH CENTRAL {c |}{res}      2,253       26.93       39.80
{txt}        SOUTH {c |}{res}      3,448       41.21       81.02
{txt}         WEST {c |}{res}      1,588       18.98      100.00
{txt}{hline 14}{c +}{hline 35}
        Total {c |}{res}      8,366      100.00
{txt}
{com}. quietly tabout region using ../Output/regionStats.tex, ///
>         style(tex) replace 
{txt}
{com}. 
. //Major frequency
. graph pie, over(majType) plabel(_all sum)
{res}{txt}
{com}. graph export ../Output/majPie.png, replace
{txt}(file ../Output/majPie.png written in PNG format)

{com}. 
. //Debt distribution by major
. graph box loan if recloan, over(majType)
{res}{txt}
{com}. graph export ../Output/DebtbyMajType.png, replace
{txt}(file ../Output/DebtbyMajType.png written in PNG format)

{com}. graph box loan if recloan, over(majType) noout
{res}{txt}
{com}. graph export ../Output/DebtbyMajTypeNoOut.png, replace
{txt}(file ../Output/DebtbyMajTypeNoOut.png written in PNG format)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\gmoor\Desktop\honors\Tables\Code\tables.do"
{txt}
{com}. /*
> Makes tables
> */
. 
. //Creates table in Stata window
. tabulate year, sum(loan)

            {txt}{c |}           Summary of loan
       year {c |}        Mean   Std. Dev.       Freq.
{hline 12}{c +}{hline 36}
          4 {c |}  {res} 2263.8759   5329.7454         822
  {txt}        6 {c |}  {res} 2297.6092   4886.8551         980
  {txt}        8 {c |}  {res}  3236.428   6566.6597        1173
{txt}{hline 12}{c +}{hline 36}
      Total {c |}  {res} 2658.4514   5737.0827        2975
{txt}
{com}. //Writes table to loanStats.tex
. quietly tabout year using ../Output/loanStats.tex, ///
>         style(tex) ///Forces tex output
>         sum c(mean loan sd loan count loan) ///Marks as summary table (two-way)
>         replace //Replaces previous version
{txt}
{com}. 
. //Creates table in Stata window
. tabulate sex race

           {txt}{c |}   RACE OF CHILD (FROM MOTHERS
    SEX OF {c |}           SCREENER 79)
     CHILD {c |}  HISPANIC      BLACK  NON-BLACK {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
      MALE {c |}{res}       855      1,092      2,124 {txt}{c |}{res}     4,071 
{txt}    FEMALE {c |}{res}     1,047      1,938      2,454 {txt}{c |}{res}     5,439 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}     1,902      3,030      4,578 {txt}{c |}{res}     9,510 

{txt}
{com}. quietly tabout sex race using ../Output/raceStats.tex, ///
>         sum c(mean recloan mean loan sd loan count loan) ///
>         style(tex) replace
{txt}
{com}. 
. //Distribution of income
. hist parInc, freq graphregion(color(white))
{txt}(bin={res}38{txt}, start={res}0{txt}, width={res}12631.132{txt})
{res}{txt}
{com}. graph export ../Output/parIncHist.eps, replace
{txt}(file ../Output/parIncHist.eps written in EPS format)

{com}. graph export ../Output/parIncHist.png, replace
{txt}(file ../Output/parIncHist.png written in PNG format)

{com}. 
. //Student debt
. hist loan if recloan, freq graphregion(color(white))
{txt}(bin={res}30{txt}, start={res}100{txt}, width={res}2830{txt})
{res}{txt}
{com}. graph export ../Output/loanHist.eps, replace
{txt}(file ../Output/loanHist.eps written in EPS format)

{com}. graph export ../Output/loanHist.png, replace
{txt}(file ../Output/loanHist.png written in PNG format)

{com}. 
. //Student debt
. tabulate region

       {txt}region {c |}      Freq.     Percent        Cum.
{hline 14}{c +}{hline 35}
    NORTHEAST {c |}{res}      1,077       12.87       12.87
{txt}NORTH CENTRAL {c |}{res}      2,253       26.93       39.80
{txt}        SOUTH {c |}{res}      3,448       41.21       81.02
{txt}         WEST {c |}{res}      1,588       18.98      100.00
{txt}{hline 14}{c +}{hline 35}
        Total {c |}{res}      8,366      100.00
{txt}
{com}. quietly tabout region using ../Output/regionStats.tex, ///
>         style(tex) replace 
{txt}
{com}. 
. //Major frequency
. graph pie, over(majType) plabel(_all sum)
{res}{txt}
{com}. graph export ../Output/majPie.png, replace
{txt}(file ../Output/majPie.png written in PNG format)

{com}. 
. //Debt distribution by major
. graph box loan if recloan, over(majType) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/DebtbyMajType.png, replace
{txt}(file ../Output/DebtbyMajType.png written in PNG format)

{com}. graph box loan if recloan, over(majType) noout graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/DebtbyMajTypeNoOut.png, replace
{txt}(file ../Output/DebtbyMajTypeNoOut.png written in PNG format)

{com}. 
{txt}end of do-file

{com}. pwd
{res}C:\Users\gmoor\Desktop\honors\Tables\Code

{com}. do Tables
{txt}
{com}. /*
> Makes tables
> */
. 
. //Creates table in Stata window
. tabulate year, sum(loan)

            {txt}{c |}           Summary of loan
       year {c |}        Mean   Std. Dev.       Freq.
{hline 12}{c +}{hline 36}
          4 {c |}  {res} 2263.8759   5329.7454         822
  {txt}        6 {c |}  {res} 2297.6092   4886.8551         980
  {txt}        8 {c |}  {res}  3236.428   6566.6597        1173
{txt}{hline 12}{c +}{hline 36}
      Total {c |}  {res} 2658.4514   5737.0827        2975
{txt}
{com}. //Writes table to loanStats.tex
. quietly tabout year using ../Output/loanStats.tex, ///
>         style(tex) ///Forces tex output
>         sum c(mean loan sd loan count loan) ///Marks as summary table (two-way)
>         replace //Replaces previous version
{txt}
{com}. 
. //Creates table in Stata window
. tabulate sex race

           {txt}{c |}   RACE OF CHILD (FROM MOTHERS
    SEX OF {c |}           SCREENER 79)
     CHILD {c |}  HISPANIC      BLACK  NON-BLACK {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
      MALE {c |}{res}       855      1,092      2,124 {txt}{c |}{res}     4,071 
{txt}    FEMALE {c |}{res}     1,047      1,938      2,454 {txt}{c |}{res}     5,439 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}     1,902      3,030      4,578 {txt}{c |}{res}     9,510 

{txt}
{com}. quietly tabout sex race using ../Output/raceStats.tex, ///
>         sum c(mean recloan mean loan sd loan count loan) ///
>         style(tex) replace
{txt}
{com}. 
. //Distribution of income
. hist parInc, freq graphregion(color(white))
{txt}(bin={res}38{txt}, start={res}0{txt}, width={res}12631.132{txt})
{res}{txt}
{com}. graph export ../Output/parIncHist.eps, replace
{txt}(file ../Output/parIncHist.eps written in EPS format)

{com}. graph export ../Output/parIncHist.png, replace
{txt}(file ../Output/parIncHist.png written in PNG format)

{com}. 
. //Student debt
. hist loan if recloan, freq graphregion(color(white))
{txt}(bin={res}30{txt}, start={res}100{txt}, width={res}2830{txt})
{res}{txt}
{com}. graph export ../Output/loanHist.eps, replace
{txt}(file ../Output/loanHist.eps written in EPS format)

{com}. graph export ../Output/loanHist.png, replace
{txt}(file ../Output/loanHist.png written in PNG format)

{com}. 
. //Student debt
. tabulate region

       {txt}region {c |}      Freq.     Percent        Cum.
{hline 14}{c +}{hline 35}
    NORTHEAST {c |}{res}      1,077       12.87       12.87
{txt}NORTH CENTRAL {c |}{res}      2,253       26.93       39.80
{txt}        SOUTH {c |}{res}      3,448       41.21       81.02
{txt}         WEST {c |}{res}      1,588       18.98      100.00
{txt}{hline 14}{c +}{hline 35}
        Total {c |}{res}      8,366      100.00
{txt}
{com}. quietly tabout region using ../Output/regionStats.tex, ///
>         style(tex) replace 
{txt}
{com}. 
. //Major frequency
. graph pie, over(majType) plabel(_all sum) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/majPie.png, replace
{txt}(file ../Output/majPie.png written in PNG format)

{com}. 
. //Debt distribution by major
. graph box loan if recloan, over(majType) graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/DebtbyMajType.png, replace
{txt}(file ../Output/DebtbyMajType.png written in PNG format)

{com}. graph box loan if recloan, over(majType) noout graphregion(color(white))
{res}{txt}
{com}. graph export ../Output/DebtbyMajTypeNoOut.png, replace
{txt}(file ../Output/DebtbyMajTypeNoOut.png written in PNG format)

{com}. 
{txt}end of do-file

{com}. centile parInc

{txt}{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
      parInc {c |}{col 14}{res}    7692{col 27}     50{col 39}    58000{col 55}    57000{col 67}    59600{txt}

{com}. centile parInc, percent(80)
{err}option {bf:percent()} not allowed
{txt}{search r(198):r(198);}

{com}. help centile

. centile parInc, centile(20)

{txt}{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
      parInc {c |}{col 14}{res}    7692{col 27}     20{col 39}  23287.2{col 55} 22411.83{col 67}    24500{txt}

{com}. centile parInc, centile(30)

{txt}{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
      parInc {c |}{col 14}{res}    7692{col 27}     30{col 39}    34000{col 55}    33000{col 67}    35200{txt}

{com}. sum race

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}race {c |}{res}      9510    2.281388    .7760619          1          3

{com}. tabulate race

    {txt}RACE OF CHILD (FROM {c |}
   MOTHERS SCREENER 79) {c |}      Freq.     Percent        Cum.
{hline 24}{c +}{hline 35}
               HISPANIC {c |}{res}      1,902       20.00       20.00
{txt}                  BLACK {c |}{res}      3,030       31.86       51.86
{txt}NON-BLACK, NON-HISPANIC {c |}{res}      4,578       48.14      100.00
{txt}{hline 24}{c +}{hline 35}
                  Total {c |}{res}      9,510      100.00

{com}. by majType: sum debt
{err}not sorted
{txt}{search r(5):r(5);}

{com}. bysort majType: sum debt

{txt}{hline}
-> majType = Humanities
{err}variable debt not found
{txt}{search r(111):r(111);}

{com}. bysort majType: sum loan

{txt}{hline}
-> majType = Humanities

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}loan {c |}{res}       165    3171.818    5815.115          0      36000

{txt}{hline}
-> majType = STEM

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}loan {c |}{res}       456    3022.213    6208.706          0      80000

{txt}{hline}
-> majType = Social Science

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}loan {c |}{res}       213     2988.31    5294.483          0      38000

{txt}{hline}
-> majType = Professions

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}loan {c |}{res}      1011    2623.924    6190.166          0      85000

{txt}{hline}
-> majType = Business

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}loan {c |}{res}       468    2457.162    4832.402          0      35000

{txt}{hline}
-> majType = .

    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 8}loan {c |}{res}       662    2368.829    5368.328          0      49000


{com}. 
. bysort majType: centile loan

{txt}{hline}
-> majType = Humanities

{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
        loan {c |}{col 14}{res}     165{col 27}     50{col 39}        0{col 55}        0{col 67}     1500{txt}

{hline}
-> majType = STEM

{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
        loan {c |}{col 14}{res}     456{col 27}     50{col 39}        0{col 55}        0{col 67} 852.2545{txt}

{hline}
-> majType = Social Science

{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
        loan {c |}{col 14}{res}     213{col 27}     50{col 39}        0{col 55}        0{col 67} 1931.472{txt}

{hline}
-> majType = Professions

{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
        loan {c |}{col 14}{res}    1011{col 27}     50{col 39}        0{col 55}        0{col 67}        0{txt}

{hline}
-> majType = Business

{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
        loan {c |}{col 14}{res}     468{col 27}     50{col 39}        0{col 55}        0{col 67}        0{txt}

{hline}
-> majType = .

{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
        loan {c |}{col 14}{res}     662{col 27}     50{col 39}        0{col 55}        0{col 67}        0{txt}

{com}. 
. bysort majType: centile loan if recloan & !missing(recloan)

{txt}{hline}
-> majType = Humanities

{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
        loan {c |}{col 14}{res}      76{col 27}     50{col 39}     5000{col 55} 3597.927{col 67}     5500{txt}

{hline}
-> majType = STEM

{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
        loan {c |}{col 14}{res}     214{col 27}     50{col 39}     4000{col 55}     3500{col 67}     5000{txt}

{hline}
-> majType = Social Science

{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
        loan {c |}{col 14}{res}     102{col 27}     50{col 39}     4500{col 55}     3500{col 67} 5198.914{txt}

{hline}
-> majType = Professions

{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
        loan {c |}{col 14}{res}     402{col 27}     50{col 39}     4000{col 55}     3500{col 67}     4500{txt}

{hline}
-> majType = Business

{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
        loan {c |}{col 14}{res}     183{col 27}     50{col 39}     4000{col 55} 3045.432{col 67}     5000{txt}

{hline}
-> majType = .

{col 56}{hline 2} Binom. Interp. {hline 2}
    Variable {c |}     Obs  Percentile      Centile        [95% Conf. Interval]
{hline 13}{c +}{hline 61}
        loan {c |}{col 14}{res}     229{col 27}     50{col 39}     5000{col 55}     4000{col 67}     5000{txt}

{com}. 