{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\gmoor\Desktop\honors\NLSY79ParentData\master.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Oct 2018, 18:57:52
{txt}
{com}. 
. set more off
{txt}
{com}. 
. cd ../NLSY79ParentData
{res}C:\Users\gmoor\Desktop\honors\NLSY79ParentData
{txt}
{com}. do ParImport
{txt}
{com}. import delimited parInc.csv, clear case(preserve)
{res}{text}(7 vars, 12686 obs)
{com}. 
. 
. //Code Stata missings
. rename R7006500 parInc0
{res}{txt}
{com}. rename R7703700 parInc2
{res}{txt}
{com}. rename R8496100 parInc4
{res}{txt}
{com}. rename T0987800 parInc6
{res}{txt}
{com}. rename T2210000 parInc8
{res}{txt}
{com}. rename T3107800 parInc10
{res}{txt}
{com}. rename R0000100 mid
{res}{txt}
{com}. 
. 
. forvalues i = 6(2)10{c -(}
{txt}  2{com}.         replace parInc`i' = . if parInc`i' < 0
{txt}  3{com}. {c )-}
{txt}(5495 real changes made, 5495 to missing)
(5959 real changes made, 5959 to missing)
(6287 real changes made, 6287 to missing)

{com}. 
. reshape long parInc, i(mid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}   12686   {txt}->{res}   76116
{txt}Number of variables            {res}       7   {txt}->{res}       3
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
           {res}parInc0 parInc2 ... parInc10   {txt}->   {res}parInc
{txt}{hline 77}

{com}. sort mid year
{txt}
{com}. 
{txt}end of do-file

{com}. 
. tempfile parInc
{txt}
{com}. save `parInc'
{txt}file C:\Users\gmoor\AppData\Local\Temp\ST_00000001.tmp saved

{com}. 
. cd ../NLSYChild79Data
{res}C:\Users\gmoor\Desktop\honors\NLSYChild79Data
{txt}
{com}. do Import
{txt}
{com}. clear all
{txt}
{com}. 
. infile using Download/2000-10DebtAndMajor.dct

{txt}infile dictionary {c -(}
  C0000100 "ID CODE OF CHILD"
  C0000200 "ID CODE OF MOTHER OF CHILD"
  C0005300 "RACE OF CHILD (FROM MOTHERS SCREENER 79)"
  C0005400 "SEX OF CHILD"
  C0005700 "DATE OF BIRTH OF CHILD - YEAR"
  Y1025600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2000"
  Y1026600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1026700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2000"
  Y1270800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2002"
  Y1271800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1271900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2002"
  Y1504800 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2004"
  Y1505800 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1505900 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2004"
  Y1755100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2006"
  Y1756100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y1756200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2006"
  Y2036100 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2008"
  Y2037100 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2037200 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2008"
  Y2360600 "FIELD OF STUDY CURR/MOST REC COLL -- NUMERIC CODE 2010"
  Y2361600 "REC LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
  Y2361700 "AMT LOAN TO COVER COST OF YEAR*S COLLEGE EXPENSES 2010"
{c )-}

(11521 observations read)

{com}. 
. //Labels from site
. label define raceLab   1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC"
{txt}
{com}. label values C0005300 raceLab
{txt}
{com}. label define sexLab  1 "MALE"  2 "FEMALE"
{txt}
{com}. label values C0005400 sexLab
{txt}
{com}. label define majLab  0 "NONE, NO MAJOR DECLARED YET"  1 "AGRICULTURE / NATURAL RESOURCES"  2 "ANTHROPOLOGY"  3 "ARCHAEOLOGY"  4 "ARCHITECTURE/ENVIRONMENTAL DESIGN"  5 "AREA STUDIES"  6 "BIOLOGICAL SCIENCES"  7 "BUSINESS"  8 "COMMUNICATIONS"  9 "COMPUTER/INFORMATION SCIENCE"  10 "CRIMINOLOGY"  11 "ECONOMICS"  12 "EDUCATION"  13 "ENGINEERING"  14 "ENGLISH"  15 "FINE AND APPLIED ARTS"  16 "FOREIGN LANGUAGES"  17 "HISTORY"  18 "HOME ECONOMICS"  19 "INTERDISCIPLINARY STUDIES"  20 "MATHEMATICS"  21 "NURSING"  22 "OTHER HEALTH PROFESSIONS"  23 "PHILOSOPHY"  24 "PHYSICAL SCIENCES"  25 "POLITICAL SCIENCE AND GOVERNMENT"  26 "PRE-DENTAL"  27 "PRE-LAW"  28 "PRE-MED"  29 "PRE-VET"  30 "PSYCHOLOGY"  31 "SOCIOLOGY"  32 "SOCIAL WORK"  33 "THEOLOGY/RELIGIOUS STUDIES"  99 "OTHER FIELD (SPECIFY)"
{txt}
{com}. label values Y1025600 majLab
{txt}
{com}. label define ynLab  1 "Yes"  0 "No"
{txt}
{com}. label values Y1026600 ynLab
{txt}
{com}. label values Y1270800 majLab
{txt}
{com}. label values Y1271800 ynLab
{txt}
{com}. label values Y1504800 majLab
{txt}
{com}. label values Y1505800 ynLab
{txt}
{com}. label values Y1755100 majLab
{txt}
{com}. label values Y1756100 ynLab
{txt}
{com}. label values Y2036100 majLab
{txt}
{com}. label values Y2037100 ynLab
{txt}
{com}. label values Y2360600 majLab
{txt}
{com}. label values Y2361600 ynLab
{txt}
{com}. 
. 
. //ID Numbers
. rename C0000100 cid
{res}{txt}
{com}. rename C0000200 mid
{res}{txt}
{com}. 
. //Demographics
. rename C0005300 race
{res}{txt}
{com}. rename C0005400 sex
{res}{txt}
{com}. rename C0005700 dob
{res}{txt}
{com}. 
. //Fields of study
. rename Y1025600 maj0
{res}{txt}
{com}. rename Y1270800 maj2
{res}{txt}
{com}. rename Y1504800 maj4
{res}{txt}
{com}. rename Y1755100 maj6
{res}{txt}
{com}. rename Y2036100 maj8
{res}{txt}
{com}. rename Y2360600 maj10
{res}{txt}
{com}. 
. //Receive loan?
. rename Y1026600 recloan0
{res}{txt}
{com}. rename Y1271800 recloan2
{res}{txt}
{com}. rename Y1505800 recloan4
{res}{txt}
{com}. rename Y1756100 recloan6
{res}{txt}
{com}. rename Y2037100 recloan8
{res}{txt}
{com}. rename Y2361600 recloan10
{res}{txt}
{com}. 
. //Loan quantities
. rename Y1026700 loan0
{res}{txt}
{com}. rename Y1271900 loan2
{res}{txt}
{com}. rename Y1505900 loan4
{res}{txt}
{com}. rename Y1756200 loan6
{res}{txt}
{com}. rename Y2037200 loan8
{res}{txt}
{com}. rename Y2361700 loan10
{res}{txt}
{com}. 
. forval i = 0(2)10{c -(}
{txt}  2{com}.         replace recloan`i' = . if recloan`i' == -7
{txt}  3{com}. {c )-}
{txt}(11151 real changes made, 11151 to missing)
(10883 real changes made, 10883 to missing)
(10626 real changes made, 10626 to missing)
(10466 real changes made, 10466 to missing)
(10255 real changes made, 10255 to missing)
(10081 real changes made, 10081 to missing)

{com}. 
. //Get only observations with data on receiving loans
. drop if missing(recloan0) & missing(recloan2) ///
>         & missing(recloan4) & missing(recloan6) ///
>         & missing(recloan8) & missing(recloan10)
{txt}(8335 observations deleted)

{com}. 
. 
. //Change to long data
. reshape long maj recloan loan, i(cid) j(year)
{txt}(note: j = 0 2 4 6 8 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    3186   {txt}->{res}   19116
{txt}Number of variables            {res}      23   {txt}->{res}       9
{txt}j variable (6 values)                     ->   {res}year
{txt}xij variables:
                    {res}maj0 maj2 ... maj10   {txt}->   {res}maj
        recloan0 recloan2 ... recloan10   {txt}->   {res}recloan
                 loan0 loan2 ... loan10   {txt}->   {res}loan
{txt}{hline 77}

{com}. 
. //Code to Stata missings
. replace maj = . if maj == -7
{txt}(11755 real changes made, 11755 to missing)

{com}. replace loan = 0 if !recloan
{txt}(3083 real changes made)

{com}. replace loan = . if loan == -7
{txt}(13495 real changes made, 13495 to missing)

{com}. 
. //Generates dummy for after policy change
. gen cohort = (year == 8)
{txt}
{com}. 
. 
. 
. 
. 
{txt}end of do-file

{com}. 
. //Need many:one due to siblings
. //Assertion guarantees all children have parental incomes
. //Drop those women without children in college
. merge m:1 mid year using `parInc', assert(match using) keep(match) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          19,116{txt}  
{col 5}{hline 41}

{com}. 
. drop if year == 10
{txt}(3186 observations deleted)

{com}. 
. reg loan i.year parInc i.race i.sex 

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}    3791
{txt}{hline 13}{char +}{hline 30}           F(  8,  3782) ={res}    9.74
    {txt}   Model {char |} {res} 1.9436e+09     8   242943767           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 9.4287e+10  3782  24930534.5           {txt}R-squared     = {res} 0.0202
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0181
    {txt}   Total {char |} {res} 9.6231e+10  3790  25390720.7           {txt}Root MSE      = {res}   4993

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                loan{col 22}{c |}      Coef.{col 34}   Std. Err.{col 46}      t{col 54}   P>|t|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}year {c |}
{space 18}2  {c |}{col 22}{res}{space 2}  218.418{col 34}{space 2} 326.3629{col 45}{space 1}    0.67{col 54}{space 3}0.503{col 62}{space 4}-421.4464{col 75}{space 3} 858.2824
{txt}{space 18}4  {c |}{col 22}{res}{space 2} 783.8055{col 34}{space 2} 309.5374{col 45}{space 1}    2.53{col 54}{space 3}0.011{col 62}{space 4} 176.9292{col 75}{space 3} 1390.682
{txt}{space 18}6  {c |}{col 22}{res}{space 2}  818.181{col 34}{space 2} 311.6868{col 45}{space 1}    2.63{col 54}{space 3}0.009{col 62}{space 4} 207.0906{col 75}{space 3} 1429.271
{txt}{space 18}8  {c |}{col 22}{res}{space 2} 1672.434{col 34}{space 2}  308.044{col 45}{space 1}    5.43{col 54}{space 3}0.000{col 62}{space 4} 1068.486{col 75}{space 3} 2276.382
{txt}{space 20} {c |}
{space 14}parInc {c |}{col 22}{res}{space 2} .0021586{col 34}{space 2} .0013026{col 45}{space 1}    1.66{col 54}{space 3}0.098{col 62}{space 4}-.0003952{col 75}{space 3} .0047124
{txt}{space 20} {c |}
{space 16}race {c |}
{space 14}BLACK  {c |}{col 22}{res}{space 2} 679.3634{col 34}{space 2} 226.7497{col 45}{space 1}    3.00{col 54}{space 3}0.003{col 62}{space 4} 234.7998{col 75}{space 3} 1123.927
{txt}NON-BLACK, NON-HI..  {c |}{col 22}{res}{space 2} 892.5016{col 34}{space 2} 213.7312{col 45}{space 1}    4.18{col 54}{space 3}0.000{col 62}{space 4}  473.462{col 75}{space 3} 1311.541
{txt}{space 20} {c |}
{space 17}sex {c |}
{space 13}FEMALE  {c |}{col 22}{res}{space 2}-136.0822{col 34}{space 2} 167.0511{col 45}{space 1}   -0.81{col 54}{space 3}0.415{col 62}{space 4}-463.6011{col 75}{space 3} 191.4367
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 655.8775{col 34}{space 2} 321.2727{col 45}{space 1}    2.04{col 54}{space 3}0.041{col 62}{space 4} 25.99292{col 75}{space 3} 1285.762
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. help #

. do "C:\Users\gmoor\Desktop\honors\Master\Master.do"
{txt}
{com}. capture log close
{smcl}
{com}{sf}{ul off}